------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/smorgan/Documents/GitHub/tess-civil-liberties/log/analyze-experimental-results-without-covariates.lo
> g
  log type:  text
 opened on:  12 Mar 2019, 14:43:49

. 
. use data/tess-civ-lib.dta

. 
. ********************************************************************************
. *** Set up for analysis
. ********************************************************************************
. 
. *** Set macros
. 
. local domain spk col lib 

. 
. *** Create additional regressors
. 
. recode partyid7 1/2 = 1 2/5 = 2 6/7 = 3, gen(partyid3)
(1703 differences between partyid7 and partyid3)

. recode partyid7 1/3 = 1 4 = 2 5/7 = 3, gen(partyid3l)
(1703 differences between partyid7 and partyid3l)

. order partyid7 partyid3 partyid3l, after(treat)

. tab partyid7 partyid3, miss

DATA-ONLY: |
  Computed |
   7-level |
 political |
     party |   RECODE of partyid7 (DATA-ONLY: Computed
identifica |   7-level political party identification)
      tion |         1          2          3          . |     Total
-----------+--------------------------------------------+----------
         1 |       309          0          0          0 |       309 
         2 |       424          0          0          0 |       424 
         3 |         0        220          0          0 |       220 
         4 |         0        338          0          0 |       338 
         5 |         0        191          0          0 |       191 
         6 |         0          0        347          0 |       347 
         7 |         0          0        183          0 |       183 
         . |         0          0          0          7 |         7 
-----------+--------------------------------------------+----------
     Total |       733        749        530          7 |     2,019 

. tab partyid7 partyid3l, miss

DATA-ONLY: |
  Computed |
   7-level |
 political |
     party |   RECODE of partyid7 (DATA-ONLY: Computed
identifica |   7-level political party identification)
      tion |         1          2          3          . |     Total
-----------+--------------------------------------------+----------
         1 |       309          0          0          0 |       309 
         2 |       424          0          0          0 |       424 
         3 |       220          0          0          0 |       220 
         4 |         0        338          0          0 |       338 
         5 |         0          0        191          0 |       191 
         6 |         0          0        347          0 |       347 
         7 |         0          0        183          0 |       183 
         . |         0          0          0          7 |         7 
-----------+--------------------------------------------+----------
     Total |       953        338        721          7 |     2,019 

. 
. ********************************************************************************
. *** Summary of outcomes
. ********************************************************************************
. 
. summ `domain' [aweight = weight]

    Variable |     Obs      Weight        Mean   Std. Dev.       Min        Max
-------------+-----------------------------------------------------------------
         spk |   2,016  2015.95849    .4466732   .4972715          0          1
         col |   2,012   2011.2303    .2497988   .4330041          0          1
         lib |   2,009  2011.16718    .5253773   .4994799          0          1

. corr `domain' [aweight = weight]
(sum of wgt is 2,006.2353708017)
(obs=2,005)

             |      spk      col      lib
-------------+---------------------------
         spk |   1.0000
         col |   0.4948   1.0000
         lib |   0.4078   0.2767   1.0000


. bys treat: corr `domain' [aweight = weight]

------------------------------------------------------------------------------------------------------------------------
-> treat = mc
(sum of wgt is 721.2025177945)
(obs=700)

             |      spk      col      lib
-------------+---------------------------
         spk |   1.0000
         col |   0.4333   1.0000
         lib |   0.3924   0.2744   1.0000


------------------------------------------------------------------------------------------------------------------------
-> treat = ic
(sum of wgt is 665.2614538197)
(obs=656)

             |      spk      col      lib
-------------+---------------------------
         spk |   1.0000
         col |   0.5871   1.0000
         lib |   0.4005   0.2773   1.0000


------------------------------------------------------------------------------------------------------------------------
-> treat = irl
(sum of wgt is 619.7713991875)
(obs=649)

             |      spk      col      lib
-------------+---------------------------
         spk |   1.0000
         col |   0.4702   1.0000
         lib |   0.4327   0.2826   1.0000



. bys partyid3: corr `domain' [aweight = weight]

------------------------------------------------------------------------------------------------------------------------
-> partyid3 = 1
(sum of wgt is 673.5352909395)
(obs=730)

             |      spk      col      lib
-------------+---------------------------
         spk |   1.0000
         col |   0.4307   1.0000
         lib |   0.4276   0.2980   1.0000


------------------------------------------------------------------------------------------------------------------------
-> partyid3 = 2
(sum of wgt is 773.0350914344)
(obs=739)

             |      spk      col      lib
-------------+---------------------------
         spk |   1.0000
         col |   0.5275   1.0000
         lib |   0.3634   0.2834   1.0000


------------------------------------------------------------------------------------------------------------------------
-> partyid3 = 3
(sum of wgt is 551.8284831877)
(obs=529)

             |      spk      col      lib
-------------+---------------------------
         spk |   1.0000
         col |   0.5297   1.0000
         lib |   0.4484   0.2201   1.0000


------------------------------------------------------------------------------------------------------------------------
-> partyid3 = .
(sum of wgt is 7.8365052401)
(obs=7)

             |      spk      col      lib
-------------+---------------------------
         spk |   1.0000
         col |   0.6022   1.0000
         lib |  -0.0632   0.3809   1.0000



. 
. ********************************************************************************
. *** Basic treatment effect analysis
. ********************************************************************************
. 
. *** OLS regression models, with no additional adjustment
. 
. foreach dom in `domain' {
  2. 
. regress `dom' b1.treat [pweight=weight]
  3. estimates store `dom'_r1
  4. 
. regress `dom' b1.treat c.partyid7 [pweight=weight]
  5. estimates store `dom'_r2
  6. 
. regress `dom' b1.treat##c.partyid7 [pweight=weight]
  7. estimates store `dom'_r3
  8. 
. regress `dom' b1.treat b2.partyid3 [pweight=weight]
  9. estimates store `dom'_r4
 10. 
. regress `dom' b1.treat##b2.partyid3 [pweight=weight]
 11. estimates store `dom'_r5
 12. 
. regress `dom' b1.treat b2.partyid3l [pweight=weight]
 13. estimates store `dom'_r6
 14. 
. regress `dom' b1.treat##b2.partyid3l [pweight=weight]
 15. estimates store `dom'_r7
 16. 
. }
(sum of wgt is 2,015.9584942246)

Linear regression                               Number of obs     =      2,016
                                                F(2, 2013)        =       2.17
                                                Prob > F          =     0.1143
                                                R-squared         =     0.0042
                                                Root MSE          =     .49647

------------------------------------------------------------------------------
             |               Robust
         spk |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.078      0.037    -2.08   0.038       -0.151      -0.004
        irl  |     -0.034      0.039    -0.87   0.383       -0.111       0.043
             |
       _cons |      0.483      0.026    18.61   0.000        0.432       0.534
------------------------------------------------------------------------------
(sum of wgt is 2,008.1219889845)

Linear regression                               Number of obs     =      2,009
                                                F(3, 2005)        =       2.98
                                                Prob > F          =     0.0302
                                                R-squared         =     0.0083
                                                Root MSE          =     .49558

------------------------------------------------------------------------------
             |               Robust
         spk |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.074      0.037    -1.99   0.046       -0.148      -0.001
        irl  |     -0.031      0.039    -0.80   0.423       -0.108       0.046
             |
    partyid7 |     -0.017      0.008    -2.09   0.036       -0.032      -0.001
       _cons |      0.545      0.040    13.68   0.000        0.467       0.624
------------------------------------------------------------------------------
(sum of wgt is 2,008.1219889845)

Linear regression                               Number of obs     =      2,009
                                                F(5, 2003)        =       2.07
                                                Prob > F          =     0.0660
                                                R-squared         =     0.0090
                                                Root MSE          =     .49565

----------------------------------------------------------------------------------
                 |               Robust
             spk |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           treat |
             ic  |     -0.011      0.082    -0.14   0.891       -0.171       0.149
            irl  |      0.006      0.089     0.07   0.943       -0.168       0.181
                 |
        partyid7 |     -0.009      0.012    -0.71   0.479       -0.033       0.016
                 |
treat#c.partyid7 |
             ic  |     -0.016      0.018    -0.89   0.373       -0.052       0.020
            irl  |     -0.010      0.020    -0.50   0.619       -0.049       0.029
                 |
           _cons |      0.515      0.054     9.61   0.000        0.410       0.620
----------------------------------------------------------------------------------
(sum of wgt is 2,008.1219889845)

Linear regression                               Number of obs     =      2,009
                                                F(4, 2004)        =       2.34
                                                Prob > F          =     0.0528
                                                R-squared         =     0.0083
                                                Root MSE          =      .4957

------------------------------------------------------------------------------
             |               Robust
         spk |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.082      0.037    -2.18   0.029       -0.155      -0.008
        irl  |     -0.032      0.039    -0.80   0.421       -0.109       0.046
             |
    partyid3 |
          1  |     -0.029      0.038    -0.77   0.441       -0.104       0.046
          3  |     -0.081      0.038    -2.14   0.032       -0.156      -0.007
             |
       _cons |      0.516      0.034    15.12   0.000        0.449       0.583
------------------------------------------------------------------------------
(sum of wgt is 2,008.1219889845)

Linear regression                               Number of obs     =      2,009
                                                F(8, 2000)        =       1.55
                                                Prob > F          =     0.1350
                                                R-squared         =     0.0101
                                                Root MSE          =     .49574

--------------------------------------------------------------------------------
               |               Robust
           spk |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
         treat |
           ic  |     -0.077      0.062    -1.24   0.214       -0.199       0.045
          irl  |     -0.082      0.065    -1.26   0.206       -0.210       0.045
               |
      partyid3 |
            1  |     -0.061      0.062    -0.99   0.322       -0.183       0.060
            3  |     -0.086      0.066    -1.30   0.193       -0.216       0.044
               |
treat#partyid3 |
         ic#1  |      0.014      0.090     0.16   0.875       -0.162       0.191
         ic#3  |     -0.044      0.090    -0.48   0.628       -0.221       0.133
        irl#1  |      0.093      0.095     0.97   0.330       -0.094       0.279
        irl#3  |      0.061      0.095     0.64   0.520       -0.125       0.248
               |
         _cons |      0.529      0.046    11.56   0.000        0.439       0.618
--------------------------------------------------------------------------------
(sum of wgt is 2,008.1219889845)

Linear regression                               Number of obs     =      2,009
                                                F(4, 2004)        =       1.92
                                                Prob > F          =     0.1045
                                                R-squared         =     0.0070
                                                Root MSE          =     .49602

------------------------------------------------------------------------------
             |               Robust
         spk |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.075      0.037    -2.02   0.044       -0.149      -0.002
        irl  |     -0.031      0.039    -0.79   0.431       -0.108       0.046
             |
   partyid3l |
          1  |      0.005      0.045     0.11   0.909       -0.084       0.094
          3  |     -0.053      0.045    -1.16   0.246       -0.142       0.036
             |
       _cons |      0.499      0.045    11.14   0.000        0.411       0.586
------------------------------------------------------------------------------
(sum of wgt is 2,008.1219889845)

Linear regression                               Number of obs     =      2,009
                                                F(8, 2000)        =       1.48
                                                Prob > F          =     0.1600
                                                R-squared         =     0.0098
                                                Root MSE          =     .49583

---------------------------------------------------------------------------------
                |               Robust
            spk |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
          treat |
            ic  |     -0.033      0.093    -0.36   0.722       -0.215       0.149
           irl  |     -0.077      0.097    -0.80   0.426       -0.267       0.113
                |
      partyid3l |
             1  |     -0.012      0.079    -0.16   0.876       -0.167       0.142
             3  |     -0.023      0.081    -0.29   0.773       -0.183       0.136
                |
treat#partyid3l |
          ic#1  |     -0.007      0.109    -0.06   0.950       -0.220       0.206
          ic#3  |     -0.110      0.109    -1.01   0.315       -0.323       0.104
         irl#1  |      0.076      0.114     0.67   0.506       -0.147       0.299
         irl#3  |      0.033      0.115     0.29   0.772       -0.191       0.258
                |
          _cons |      0.496      0.070     7.13   0.000        0.359       0.632
---------------------------------------------------------------------------------
(sum of wgt is 2,011.2303007225)

Linear regression                               Number of obs     =      2,012
                                                F(2, 2009)        =       1.73
                                                Prob > F          =     0.1784
                                                R-squared         =     0.0035
                                                Root MSE          =     .43245

------------------------------------------------------------------------------
             |               Robust
         col |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.054      0.033    -1.63   0.104       -0.120       0.011
        irl  |     -0.053      0.033    -1.62   0.106       -0.117       0.011
             |
       _cons |      0.284      0.024    11.83   0.000        0.237       0.331
------------------------------------------------------------------------------
(sum of wgt is 2,003.3937954824)

Linear regression                               Number of obs     =      2,005
                                                F(3, 2001)        =       5.66
                                                Prob > F          =     0.0007
                                                R-squared         =     0.0151
                                                Root MSE          =     .42909

------------------------------------------------------------------------------
             |               Robust
         col |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.051      0.033    -1.54   0.123       -0.116       0.014
        irl  |     -0.049      0.033    -1.50   0.134       -0.114       0.015
             |
    partyid7 |     -0.024      0.006    -3.74   0.000       -0.037      -0.012
       _cons |      0.374      0.036    10.35   0.000        0.303       0.444
------------------------------------------------------------------------------
(sum of wgt is 2,003.3937954824)

Linear regression                               Number of obs     =      2,005
                                                F(5, 1999)        =       3.96
                                                Prob > F          =     0.0014
                                                R-squared         =     0.0179
                                                Root MSE          =      .4287

----------------------------------------------------------------------------------
                 |               Robust
             col |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           treat |
             ic  |     -0.115      0.073    -1.57   0.117       -0.258       0.029
            irl  |     -0.155      0.072    -2.15   0.031       -0.296      -0.014
                 |
        partyid7 |     -0.038      0.011    -3.53   0.000       -0.059      -0.017
                 |
treat#c.partyid7 |
             ic  |      0.017      0.015     1.10   0.274       -0.013       0.047
            irl  |      0.028      0.016     1.75   0.080       -0.003       0.059
                 |
           _cons |      0.426      0.051     8.39   0.000        0.327       0.526
----------------------------------------------------------------------------------
(sum of wgt is 2,003.3937954824)

Linear regression                               Number of obs     =      2,005
                                                F(4, 2000)        =       4.85
                                                Prob > F          =     0.0007
                                                R-squared         =     0.0160
                                                Root MSE          =     .42899

------------------------------------------------------------------------------
             |               Robust
         col |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.059      0.033    -1.79   0.074       -0.124       0.006
        irl  |     -0.049      0.033    -1.49   0.137       -0.113       0.016
             |
    partyid3 |
          1  |     -0.012      0.033    -0.35   0.724       -0.077       0.054
          3  |     -0.114      0.031    -3.68   0.000       -0.176      -0.053
             |
       _cons |      0.318      0.030    10.53   0.000        0.259       0.378
------------------------------------------------------------------------------
(sum of wgt is 2,003.3937954824)

Linear regression                               Number of obs     =      2,005
                                                F(8, 1996)        =       2.91
                                                Prob > F          =     0.0031
                                                R-squared         =     0.0192
                                                Root MSE          =     .42873

--------------------------------------------------------------------------------
               |               Robust
           col |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
         treat |
           ic  |     -0.045      0.055    -0.81   0.418       -0.154       0.064
          irl  |     -0.067      0.056    -1.20   0.231       -0.176       0.042
               |
      partyid3 |
            1  |      0.019      0.059     0.33   0.744       -0.097       0.135
            3  |     -0.151      0.056    -2.69   0.007       -0.261      -0.041
               |
treat#partyid3 |
         ic#1  |     -0.064      0.083    -0.77   0.443       -0.226       0.099
         ic#3  |      0.021      0.075     0.28   0.781       -0.126       0.167
        irl#1  |     -0.032      0.080    -0.40   0.687       -0.189       0.125
        irl#3  |      0.100      0.079     1.27   0.205       -0.055       0.254
               |
         _cons |      0.318      0.041     7.71   0.000        0.237       0.399
--------------------------------------------------------------------------------
(sum of wgt is 2,003.3937954824)

Linear regression                               Number of obs     =      2,005
                                                F(4, 2000)        =       4.75
                                                Prob > F          =     0.0008
                                                R-squared         =     0.0172
                                                Root MSE          =     .42873

------------------------------------------------------------------------------
             |               Robust
         col |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.054      0.033    -1.63   0.103       -0.118       0.011
        irl  |     -0.049      0.033    -1.47   0.140       -0.114       0.016
             |
   partyid3l |
          1  |     -0.022      0.040    -0.54   0.591       -0.100       0.057
          3  |     -0.119      0.039    -3.04   0.002       -0.196      -0.042
             |
       _cons |      0.334      0.040     8.42   0.000        0.256       0.412
------------------------------------------------------------------------------
(sum of wgt is 2,003.3937954824)

Linear regression                               Number of obs     =      2,005
                                                F(8, 1996)        =       3.09
                                                Prob > F          =     0.0018
                                                R-squared         =     0.0225
                                                Root MSE          =       .428

---------------------------------------------------------------------------------
                |               Robust
            col |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
          treat |
            ic  |     -0.031      0.086    -0.36   0.718       -0.199       0.137
           irl  |     -0.126      0.080    -1.56   0.118       -0.284       0.032
                |
      partyid3l |
             1  |     -0.011      0.073    -0.16   0.875       -0.154       0.131
             3  |     -0.168      0.072    -2.34   0.019       -0.308      -0.027
                |
treat#partyid3l |
          ic#1  |     -0.056      0.101    -0.56   0.576       -0.254       0.141
          ic#3  |      0.001      0.097     0.01   0.991       -0.189       0.191
         irl#1  |      0.036      0.095     0.38   0.705       -0.150       0.222
         irl#3  |      0.165      0.095     1.73   0.083       -0.022       0.352
                |
          _cons |      0.348      0.063     5.55   0.000        0.225       0.471
---------------------------------------------------------------------------------
(sum of wgt is 2,011.1671752376)

Linear regression                               Number of obs     =      2,009
                                                F(2, 2006)        =       2.00
                                                Prob > F          =     0.1352
                                                R-squared         =     0.0041
                                                Root MSE          =     .49869

------------------------------------------------------------------------------
             |               Robust
         lib |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.038      0.038    -1.01   0.315       -0.112       0.036
        irl  |      0.042      0.039     1.08   0.280       -0.035       0.119
             |
       _cons |      0.525      0.026    20.14   0.000        0.474       0.576
------------------------------------------------------------------------------
(sum of wgt is 2,003.3306699975)

Linear regression                               Number of obs     =      2,002
                                                F(3, 1998)        =       8.18
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0223
                                                Root MSE          =     .49419

------------------------------------------------------------------------------
             |               Robust
         lib |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.038      0.038    -1.01   0.314       -0.113       0.036
        irl  |      0.041      0.038     1.09   0.278       -0.033       0.116
             |
    partyid7 |     -0.034      0.008    -4.41   0.000       -0.050      -0.019
       _cons |      0.659      0.039    16.79   0.000        0.582       0.736
------------------------------------------------------------------------------
(sum of wgt is 2,003.3306699975)

Linear regression                               Number of obs     =      2,002
                                                F(5, 1996)        =       6.42
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0265
                                                Root MSE          =     .49338

----------------------------------------------------------------------------------
                 |               Robust
             lib |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           treat |
             ic  |     -0.081      0.084    -0.97   0.334       -0.245       0.083
            irl  |      0.155      0.077     2.01   0.044        0.004       0.306
                 |
        partyid7 |     -0.028      0.013    -2.20   0.028       -0.053      -0.003
                 |
treat#c.partyid7 |
             ic  |      0.011      0.019     0.56   0.575       -0.027       0.048
            irl  |     -0.030      0.018    -1.66   0.098       -0.065       0.005
                 |
           _cons |      0.634      0.054    11.70   0.000        0.527       0.740
----------------------------------------------------------------------------------
(sum of wgt is 2,003.3306699975)

Linear regression                               Number of obs     =      2,002
                                                F(4, 1997)        =       4.31
                                                Prob > F          =     0.0018
                                                R-squared         =     0.0161
                                                Root MSE          =     .49589

------------------------------------------------------------------------------
             |               Robust
         lib |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.043      0.038    -1.13   0.258       -0.118       0.032
        irl  |      0.042      0.039     1.10   0.272       -0.033       0.118
             |
    partyid3 |
          1  |      0.046      0.038     1.20   0.230       -0.029       0.120
          3  |     -0.091      0.039    -2.33   0.020       -0.168      -0.015
             |
       _cons |      0.537      0.034    15.61   0.000        0.470       0.605
------------------------------------------------------------------------------
(sum of wgt is 2,003.3306699975)

Linear regression                               Number of obs     =      2,002
                                                F(8, 1993)        =       2.93
                                                Prob > F          =     0.0029
                                                R-squared         =     0.0212
                                                Root MSE          =     .49509

--------------------------------------------------------------------------------
               |               Robust
           lib |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
         treat |
           ic  |     -0.076      0.063    -1.21   0.225       -0.200       0.047
          irl  |     -0.007      0.067    -0.11   0.916       -0.139       0.125
               |
      partyid3 |
            1  |     -0.004      0.062    -0.06   0.950       -0.126       0.119
            3  |     -0.123      0.067    -1.84   0.066       -0.254       0.008
               |
treat#partyid3 |
         ic#1  |      0.017      0.091     0.18   0.855       -0.162       0.196
         ic#3  |      0.097      0.094     1.03   0.303       -0.087       0.281
        irl#1  |      0.135      0.091     1.48   0.139       -0.044       0.313
        irl#3  |      0.007      0.097     0.07   0.945       -0.183       0.196
               |
         _cons |      0.565      0.046    12.18   0.000        0.474       0.656
--------------------------------------------------------------------------------
(sum of wgt is 2,003.3306699975)

Linear regression                               Number of obs     =      2,002
                                                F(4, 1997)        =       5.85
                                                Prob > F          =     0.0001
                                                R-squared         =     0.0217
                                                Root MSE          =     .49448

------------------------------------------------------------------------------
             |               Robust
         lib |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.036      0.038    -0.96   0.340       -0.111       0.038
        irl  |      0.042      0.038     1.11   0.267       -0.032       0.117
             |
   partyid3l |
          1  |      0.106      0.045     2.34   0.019        0.017       0.196
          3  |     -0.036      0.046    -0.78   0.437       -0.127       0.055
             |
       _cons |      0.493      0.045    10.93   0.000        0.405       0.581
------------------------------------------------------------------------------
(sum of wgt is 2,003.3306699975)

Linear regression                               Number of obs     =      2,002
                                                F(8, 1993)        =       3.30
                                                Prob > F          =     0.0010
                                                R-squared         =     0.0239
                                                Root MSE          =     .49441

---------------------------------------------------------------------------------
                |               Robust
            lib |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
          treat |
            ic  |     -0.023      0.093    -0.25   0.801       -0.206       0.159
           irl  |      0.047      0.100     0.47   0.638       -0.149       0.244
                |
      partyid3l |
             1  |      0.112      0.079     1.42   0.157       -0.043       0.266
             3  |     -0.025      0.082    -0.31   0.758       -0.186       0.135
                |
treat#partyid3l |
          ic#1  |     -0.044      0.109    -0.40   0.689       -0.258       0.170
          ic#3  |      0.013      0.111     0.11   0.910       -0.205       0.230
         irl#1  |      0.028      0.114     0.25   0.804       -0.195       0.252
         irl#3  |     -0.046      0.118    -0.39   0.693       -0.277       0.184
                |
          _cons |      0.487      0.070     6.95   0.000        0.349       0.624
---------------------------------------------------------------------------------

. 
. estimates dir

-------------------------------------------------------
        name | command      depvar       npar  title 
-------------+-----------------------------------------
      spk_r1 | regress      spk             4  
    spk_r1d1 | margins      no depvar      25  
    spk_r1d2 | margins      no depvar      25  
      spk_r2 | regress      spk             5  
    spk_r2d1 | margins      no depvar      26  
    spk_r2d2 | margins      no depvar      26  
      spk_r3 | regress      spk             8  
    spk_r3d1 | margins      no depvar      26  
    spk_r3d2 | margins      no depvar      26  
      spk_r4 | regress      spk             7  
    spk_r4d1 | margins      no depvar      28  
    spk_r4d2 | margins      no depvar      28  
      spk_r5 | regress      spk            16  
    spk_r5d1 | margins      no depvar      28  
    spk_r5d2 | margins      no depvar      28  
      spk_r6 | regress      spk             7  
    spk_r6d1 | margins      no depvar      28  
    spk_r6d2 | margins      no depvar      28  
      spk_r7 | regress      spk            16  
    spk_r7d1 | margins      no depvar      28  
    spk_r7d2 | margins      no depvar      28  
      col_r1 | regress      col             4  
    col_r1d1 | margins      no depvar      25  
    col_r1d2 | margins      no depvar      25  
      col_r2 | regress      col             5  
    col_r2d1 | margins      no depvar      26  
    col_r2d2 | margins      no depvar      26  
      col_r3 | regress      col             8  
    col_r3d1 | margins      no depvar      26  
    col_r3d2 | margins      no depvar      26  
      col_r4 | regress      col             7  
    col_r4d1 | margins      no depvar      28  
    col_r4d2 | margins      no depvar      28  
      col_r5 | regress      col            16  
    col_r5d1 | margins      no depvar      28  
    col_r5d2 | margins      no depvar      28  
      col_r6 | regress      col             7  
    col_r6d1 | margins      no depvar      28  
    col_r6d2 | margins      no depvar      28  
      col_r7 | regress      col            16  
    col_r7d1 | margins      no depvar      28  
    col_r7d2 | margins      no depvar      28  
      lib_r1 | regress      lib             4  
    lib_r1d1 | margins      no depvar      25  
    lib_r1d2 | margins      no depvar      25  
      lib_r2 | regress      lib             5  
    lib_r2d1 | margins      no depvar      26  
    lib_r2d2 | margins      no depvar      26  
      lib_r3 | regress      lib             8  
    lib_r3d1 | margins      no depvar      26  
    lib_r3d2 | margins      no depvar      26  
      lib_r4 | regress      lib             7  
    lib_r4d1 | margins      no depvar      28  
    lib_r4d2 | margins      no depvar      28  
      lib_r5 | regress      lib            16  
    lib_r5d1 | margins      no depvar      28  
    lib_r5d2 | margins      no depvar      28  
      lib_r6 | regress      lib             7  
    lib_r6d1 | margins      no depvar      28  
    lib_r6d2 | margins      no depvar      28  
      lib_r7 | regress      lib            16  
    lib_r7d1 | margins      no depvar      28  
    lib_r7d2 | margins      no depvar      28  
-------------------------------------------------------

. 
. outreg2 [*] ///
>   using docs/ols-estimates-without-covariates.xls, ///
>   noaster stats(coef se ci pval)  dec(3)  ///
>   paren(se) bracket(ci) ///
>   excel replace
docs/ols-estimates-without-covariates.xls
dir : seeout

.   
. estimates clear

. 
. foreach dom in `domain' {
  2. 
. regress `dom' b1.treat [pweight=weight]
  3.   margins b1.treat, post
  4.   estimates store `dom'_r1
  5.     quietly regress `dom' b1.treat [pweight=weight]
  6.     margins, dydx(*) post
  7.     estimates store `dom'_r1d1
  8.     quietly regress `dom' b2.treat [pweight=weight]
  9.     margins, dydx(*) post
 10.     estimates store `dom'_r1d2
 11. 
. regress `dom' b1.treat c.partyid7 [pweight=weight]
 12.   margins b1.treat, post
 13.   estimates store `dom'_r2
 14.     quietly regress `dom' b1.treat c.partyid7 [pweight=weight]
 15.     margins, dydx(*) post
 16.     estimates store `dom'_r2d1
 17.         quietly regress `dom' b2.treat c.partyid7 [pweight=weight]
 18.     margins, dydx(*) post
 19.     estimates store `dom'_r2d2
 20. 
. regress `dom' b1.treat##c.partyid7 [pweight=weight]
 21.   margins b1.treat, post
 22.   estimates store `dom'_r3
 23.     quietly regress `dom' b1.treat##c.partyid7 [pweight=weight]
 24.     margins, dydx(*) post
 25.     estimates store `dom'_r3d1
 26.         quietly regress `dom' b2.treat##c.partyid7 [pweight=weight]
 27.     margins, dydx(*) post
 28.     estimates store `dom'_r3d2
 29. 
. regress `dom' b1.treat b2.partyid3 [pweight=weight]
 30.   margins b1.treat b2.partyid3, post
 31.   estimates store `dom'_r4
 32.     quietly regress `dom' b1.treat b2.partyid3 [pweight=weight]
 33.     margins, dydx(*) post
 34.     estimates store `dom'_r4d1
 35.         quietly regress `dom' b2.treat b2.partyid3 [pweight=weight]
 36.     margins, dydx(*) post
 37.     estimates store `dom'_r4d2
 38. 
. regress `dom' b1.treat##b2.partyid3 [pweight=weight]
 39.   margins b1.treat##b2.partyid3, post
 40.   estimates store `dom'_r5
 41.     quietly regress `dom' b1.treat##b2.partyid3 [pweight=weight]
 42.     margins, dydx(*) post
 43.     estimates store `dom'_r5d1
 44.         quietly regress `dom' b2.treat##b2.partyid3 [pweight=weight]
 45.     margins, dydx(*) post
 46.     estimates store `dom'_r5d2
 47. 
. regress `dom' b1.treat b2.partyid3l [pweight=weight]
 48.   margins b1.treat b2.partyid3l, post
 49.   estimates store `dom'_r6
 50.     quietly regress `dom' b1.treat b2.partyid3l [pweight=weight]
 51.     margins, dydx(*) post
 52.     estimates store `dom'_r6d1
 53.         quietly regress `dom' b2.treat b2.partyid3l [pweight=weight]
 54.     margins, dydx(*) post
 55.     estimates store `dom'_r6d2
 56. 
. regress `dom' b1.treat##b2.partyid3l [pweight=weight]
 57.   margins b1.treat##b2.partyid3l, post
 58.   estimates store `dom'_r7
 59.     quietly regress `dom' b1.treat##b2.partyid3l [pweight=weight]
 60.     margins, dydx(*) post
 61.     estimates store `dom'_r7d1
 62.         quietly regress `dom' b2.treat##b2.partyid3l [pweight=weight]
 63.     margins, dydx(*) post
 64.     estimates store `dom'_r7d2
 65. 
. }
(sum of wgt is 2,015.9584942246)

Linear regression                               Number of obs     =      2,016
                                                F(2, 2013)        =       2.17
                                                Prob > F          =     0.1143
                                                R-squared         =     0.0042
                                                Root MSE          =     .49647

------------------------------------------------------------------------------
             |               Robust
         spk |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.078      0.037    -2.08   0.038       -0.151      -0.004
        irl  |     -0.034      0.039    -0.87   0.383       -0.111       0.043
             |
       _cons |      0.483      0.026    18.61   0.000        0.432       0.534
------------------------------------------------------------------------------

Adjusted predictions                            Number of obs     =      2,016
Model VCE    : Robust

Expression   : Linear prediction, predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.483      0.026    18.61   0.000        0.432       0.534
         ic  |      0.405      0.027    15.14   0.000        0.353       0.458
        irl  |      0.449      0.029    15.32   0.000        0.391       0.506
------------------------------------------------------------------------------

Conditional marginal effects                    Number of obs     =      2,016
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.078      0.037    -2.08   0.038       -0.151      -0.004
        irl  |     -0.034      0.039    -0.87   0.383       -0.111       0.043
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Conditional marginal effects                    Number of obs     =      2,016
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 1.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.078      0.037     2.08   0.038        0.004       0.151
        irl  |      0.043      0.040     1.09   0.274       -0.034       0.121
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.
(sum of wgt is 2,008.1219889845)

Linear regression                               Number of obs     =      2,009
                                                F(3, 2005)        =       2.98
                                                Prob > F          =     0.0302
                                                R-squared         =     0.0083
                                                Root MSE          =     .49558

------------------------------------------------------------------------------
             |               Robust
         spk |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.074      0.037    -1.99   0.046       -0.148      -0.001
        irl  |     -0.031      0.039    -0.80   0.423       -0.108       0.046
             |
    partyid7 |     -0.017      0.008    -2.09   0.036       -0.032      -0.001
       _cons |      0.545      0.040    13.68   0.000        0.467       0.624
------------------------------------------------------------------------------

Predictive margins                              Number of obs     =      2,009
Model VCE    : Robust

Expression   : Linear prediction, predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.481      0.026    18.43   0.000        0.430       0.532
         ic  |      0.407      0.027    15.23   0.000        0.354       0.459
        irl  |      0.450      0.029    15.33   0.000        0.392       0.507
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,009
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.treat 3.treat partyid7

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.074      0.037    -1.99   0.046       -0.148      -0.001
        irl  |     -0.031      0.039    -0.80   0.423       -0.108       0.046
             |
    partyid7 |     -0.017      0.008    -2.09   0.036       -0.032      -0.001
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,009
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 1.treat 3.treat partyid7

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.074      0.037     1.99   0.046        0.001       0.148
        irl  |      0.043      0.040     1.08   0.279       -0.035       0.121
             |
    partyid7 |     -0.017      0.008    -2.09   0.036       -0.032      -0.001
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.
(sum of wgt is 2,008.1219889845)

Linear regression                               Number of obs     =      2,009
                                                F(5, 2003)        =       2.07
                                                Prob > F          =     0.0660
                                                R-squared         =     0.0090
                                                Root MSE          =     .49565

----------------------------------------------------------------------------------
                 |               Robust
             spk |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           treat |
             ic  |     -0.011      0.082    -0.14   0.891       -0.171       0.149
            irl  |      0.006      0.089     0.07   0.943       -0.168       0.181
                 |
        partyid7 |     -0.009      0.012    -0.71   0.479       -0.033       0.016
                 |
treat#c.partyid7 |
             ic  |     -0.016      0.018    -0.89   0.373       -0.052       0.020
            irl  |     -0.010      0.020    -0.50   0.619       -0.049       0.029
                 |
           _cons |      0.515      0.054     9.61   0.000        0.410       0.620
----------------------------------------------------------------------------------

Predictive margins                              Number of obs     =      2,009
Model VCE    : Robust

Expression   : Linear prediction, predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.481      0.026    18.47   0.000        0.430       0.532
         ic  |      0.407      0.027    15.23   0.000        0.355       0.460
        irl  |      0.450      0.029    15.36   0.000        0.392       0.507
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,009
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.treat 3.treat partyid7

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.074      0.037    -1.98   0.047       -0.147      -0.001
        irl  |     -0.032      0.039    -0.81   0.418       -0.109       0.045
             |
    partyid7 |     -0.017      0.008    -2.18   0.029       -0.033      -0.002
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,009
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 1.treat 3.treat partyid7

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.074      0.037     1.98   0.047        0.001       0.147
        irl  |      0.042      0.040     1.07   0.286       -0.035       0.120
             |
    partyid7 |     -0.017      0.008    -2.18   0.029       -0.033      -0.002
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.
(sum of wgt is 2,008.1219889845)

Linear regression                               Number of obs     =      2,009
                                                F(4, 2004)        =       2.34
                                                Prob > F          =     0.0528
                                                R-squared         =     0.0083
                                                Root MSE          =      .4957

------------------------------------------------------------------------------
             |               Robust
         spk |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.082      0.037    -2.18   0.029       -0.155      -0.008
        irl  |     -0.032      0.039    -0.80   0.421       -0.109       0.046
             |
    partyid3 |
          1  |     -0.029      0.038    -0.77   0.441       -0.104       0.046
          3  |     -0.081      0.038    -2.14   0.032       -0.156      -0.007
             |
       _cons |      0.516      0.034    15.12   0.000        0.449       0.583
------------------------------------------------------------------------------

Predictive margins                              Number of obs     =      2,009
Model VCE    : Robust

Expression   : Linear prediction, predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.484      0.026    18.54   0.000        0.432       0.535
         ic  |      0.402      0.027    15.08   0.000        0.350       0.454
        irl  |      0.452      0.030    15.30   0.000        0.394       0.510
             |
    partyid3 |
          1  |      0.450      0.028    15.98   0.000        0.394       0.505
          2  |      0.479      0.026    18.51   0.000        0.428       0.530
          3  |      0.398      0.028    14.28   0.000        0.343       0.452
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,009
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.treat 3.treat 1.partyid3 3.partyid3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.082      0.037    -2.18   0.029       -0.155      -0.008
        irl  |     -0.032      0.039    -0.80   0.421       -0.109       0.046
             |
    partyid3 |
          1  |     -0.029      0.038    -0.77   0.441       -0.104       0.046
          3  |     -0.081      0.038    -2.14   0.032       -0.156      -0.007
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,009
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 1.treat 3.treat 1.partyid3 3.partyid3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.082      0.037     2.18   0.029        0.008       0.155
        irl  |      0.050      0.040     1.25   0.210       -0.028       0.128
             |
    partyid3 |
          1  |     -0.029      0.038    -0.77   0.441       -0.104       0.046
          3  |     -0.081      0.038    -2.14   0.032       -0.156      -0.007
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.
(sum of wgt is 2,008.1219889845)

Linear regression                               Number of obs     =      2,009
                                                F(8, 2000)        =       1.55
                                                Prob > F          =     0.1350
                                                R-squared         =     0.0101
                                                Root MSE          =     .49574

--------------------------------------------------------------------------------
               |               Robust
           spk |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
         treat |
           ic  |     -0.077      0.062    -1.24   0.214       -0.199       0.045
          irl  |     -0.082      0.065    -1.26   0.206       -0.210       0.045
               |
      partyid3 |
            1  |     -0.061      0.062    -0.99   0.322       -0.183       0.060
            3  |     -0.086      0.066    -1.30   0.193       -0.216       0.044
               |
treat#partyid3 |
         ic#1  |      0.014      0.090     0.16   0.875       -0.162       0.191
         ic#3  |     -0.044      0.090    -0.48   0.628       -0.221       0.133
        irl#1  |      0.093      0.095     0.97   0.330       -0.094       0.279
        irl#3  |      0.061      0.095     0.64   0.520       -0.125       0.248
               |
         _cons |      0.529      0.046    11.56   0.000        0.439       0.618
--------------------------------------------------------------------------------

Predictive margins                              Number of obs     =      2,009
Model VCE    : Robust

Expression   : Linear prediction, predict()

--------------------------------------------------------------------------------
               |            Delta-method
               |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
         treat |
           mc  |      0.484      0.026    18.49   0.000        0.433       0.536
           ic  |      0.400      0.027    15.08   0.000        0.348       0.452
          irl  |      0.450      0.029    15.32   0.000        0.393       0.508
               |
      partyid3 |
            1  |      0.450      0.028    15.97   0.000        0.395       0.505
            2  |      0.478      0.026    18.47   0.000        0.427       0.529
            3  |      0.396      0.028    14.37   0.000        0.342       0.450
               |
treat#partyid3 |
         mc#1  |      0.468      0.042    11.20   0.000        0.386       0.549
         mc#2  |      0.529      0.046    11.56   0.000        0.439       0.618
         mc#3  |      0.443      0.048     9.23   0.000        0.349       0.537
         ic#1  |      0.404      0.050     8.09   0.000        0.306       0.502
         ic#2  |      0.451      0.042    10.72   0.000        0.369       0.534
         ic#3  |      0.321      0.045     7.17   0.000        0.234       0.409
        irl#1  |      0.478      0.056     8.61   0.000        0.369       0.587
        irl#2  |      0.447      0.046     9.66   0.000        0.356       0.537
        irl#3  |      0.422      0.050     8.38   0.000        0.323       0.520
--------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,009
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.treat 3.treat 1.partyid3 3.partyid3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.085      0.037    -2.27   0.023       -0.158      -0.011
        irl  |     -0.034      0.039    -0.86   0.388       -0.111       0.043
             |
    partyid3 |
          1  |     -0.028      0.038    -0.73   0.465       -0.103       0.047
          3  |     -0.082      0.038    -2.16   0.031       -0.156      -0.008
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,009
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 1.treat 3.treat 1.partyid3 3.partyid3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.085      0.037     2.27   0.023        0.011       0.158
        irl  |      0.051      0.040     1.28   0.202       -0.027       0.128
             |
    partyid3 |
          1  |     -0.028      0.038    -0.73   0.465       -0.103       0.047
          3  |     -0.082      0.038    -2.16   0.031       -0.156      -0.008
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.
(sum of wgt is 2,008.1219889845)

Linear regression                               Number of obs     =      2,009
                                                F(4, 2004)        =       1.92
                                                Prob > F          =     0.1045
                                                R-squared         =     0.0070
                                                Root MSE          =     .49602

------------------------------------------------------------------------------
             |               Robust
         spk |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.075      0.037    -2.02   0.044       -0.149      -0.002
        irl  |     -0.031      0.039    -0.79   0.431       -0.108       0.046
             |
   partyid3l |
          1  |      0.005      0.045     0.11   0.909       -0.084       0.094
          3  |     -0.053      0.045    -1.16   0.246       -0.142       0.036
             |
       _cons |      0.499      0.045    11.14   0.000        0.411       0.586
------------------------------------------------------------------------------

Predictive margins                              Number of obs     =      2,009
Model VCE    : Robust

Expression   : Linear prediction, predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.481      0.026    18.39   0.000        0.430       0.533
         ic  |      0.406      0.027    15.25   0.000        0.354       0.458
        irl  |      0.450      0.029    15.30   0.000        0.393       0.508
             |
   partyid3l |
          1  |      0.469      0.024    19.31   0.000        0.422       0.517
          2  |      0.464      0.038    12.08   0.000        0.389       0.539
          3  |      0.411      0.024    16.93   0.000        0.364       0.459
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,009
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.treat 3.treat 1.partyid3l 3.partyid3l

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.075      0.037    -2.02   0.044       -0.149      -0.002
        irl  |     -0.031      0.039    -0.79   0.431       -0.108       0.046
             |
   partyid3l |
          1  |      0.005      0.045     0.11   0.909       -0.084       0.094
          3  |     -0.053      0.045    -1.16   0.246       -0.142       0.036
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,009
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 1.treat 3.treat 1.partyid3l 3.partyid3l

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.075      0.037     2.02   0.044        0.002       0.149
        irl  |      0.044      0.040     1.12   0.263       -0.033       0.122
             |
   partyid3l |
          1  |      0.005      0.045     0.11   0.909       -0.084       0.094
          3  |     -0.053      0.045    -1.16   0.246       -0.142       0.036
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.
(sum of wgt is 2,008.1219889845)

Linear regression                               Number of obs     =      2,009
                                                F(8, 2000)        =       1.48
                                                Prob > F          =     0.1600
                                                R-squared         =     0.0098
                                                Root MSE          =     .49583

---------------------------------------------------------------------------------
                |               Robust
            spk |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
          treat |
            ic  |     -0.033      0.093    -0.36   0.722       -0.215       0.149
           irl  |     -0.077      0.097    -0.80   0.426       -0.267       0.113
                |
      partyid3l |
             1  |     -0.012      0.079    -0.16   0.876       -0.167       0.142
             3  |     -0.023      0.081    -0.29   0.773       -0.183       0.136
                |
treat#partyid3l |
          ic#1  |     -0.007      0.109    -0.06   0.950       -0.220       0.206
          ic#3  |     -0.110      0.109    -1.01   0.315       -0.323       0.104
         irl#1  |      0.076      0.114     0.67   0.506       -0.147       0.299
         irl#3  |      0.033      0.115     0.29   0.772       -0.191       0.258
                |
          _cons |      0.496      0.070     7.13   0.000        0.359       0.632
---------------------------------------------------------------------------------

Predictive margins                              Number of obs     =      2,009
Model VCE    : Robust

Expression   : Linear prediction, predict()

---------------------------------------------------------------------------------
                |            Delta-method
                |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
          treat |
            mc  |      0.482      0.026    18.36   0.000        0.430       0.533
            ic  |      0.405      0.026    15.31   0.000        0.353       0.457
           irl  |      0.449      0.029    15.32   0.000        0.392       0.507
                |
      partyid3l |
             1  |      0.470      0.024    19.33   0.000        0.422       0.517
             2  |      0.461      0.038    12.02   0.000        0.386       0.536
             3  |      0.411      0.024    17.02   0.000        0.364       0.459
                |
treat#partyid3l |
          mc#1  |      0.483      0.037    13.11   0.000        0.411       0.556
          mc#2  |      0.496      0.070     7.13   0.000        0.359       0.632
          mc#3  |      0.472      0.042    11.21   0.000        0.390       0.555
          ic#1  |      0.444      0.043    10.27   0.000        0.359       0.528
          ic#2  |      0.463      0.061     7.55   0.000        0.342       0.583
          ic#3  |      0.330      0.039     8.50   0.000        0.254       0.406
         irl#1  |      0.482      0.047    10.27   0.000        0.390       0.574
         irl#2  |      0.419      0.067     6.22   0.000        0.287       0.551
         irl#3  |      0.428      0.045     9.61   0.000        0.341       0.516
---------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,009
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.treat 3.treat 1.partyid3l 3.partyid3l

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.076      0.037    -2.05   0.040       -0.150      -0.003
        irl  |     -0.032      0.039    -0.82   0.413       -0.109       0.045
             |
   partyid3l |
          1  |      0.009      0.045     0.19   0.846       -0.080       0.098
          3  |     -0.050      0.045    -1.09   0.275       -0.138       0.039
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,009
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 1.treat 3.treat 1.partyid3l 3.partyid3l

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.076      0.037     2.05   0.040        0.003       0.150
        irl  |      0.044      0.040     1.12   0.263       -0.033       0.122
             |
   partyid3l |
          1  |      0.009      0.045     0.19   0.846       -0.080       0.098
          3  |     -0.050      0.045    -1.09   0.275       -0.138       0.039
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.
(sum of wgt is 2,011.2303007225)

Linear regression                               Number of obs     =      2,012
                                                F(2, 2009)        =       1.73
                                                Prob > F          =     0.1784
                                                R-squared         =     0.0035
                                                Root MSE          =     .43245

------------------------------------------------------------------------------
             |               Robust
         col |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.054      0.033    -1.63   0.104       -0.120       0.011
        irl  |     -0.053      0.033    -1.62   0.106       -0.117       0.011
             |
       _cons |      0.284      0.024    11.83   0.000        0.237       0.331
------------------------------------------------------------------------------

Adjusted predictions                            Number of obs     =      2,012
Model VCE    : Robust

Expression   : Linear prediction, predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.284      0.024    11.83   0.000        0.237       0.331
         ic  |      0.230      0.023     9.94   0.000        0.185       0.275
        irl  |      0.231      0.022    10.37   0.000        0.187       0.275
------------------------------------------------------------------------------

Conditional marginal effects                    Number of obs     =      2,012
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.054      0.033    -1.63   0.104       -0.120       0.011
        irl  |     -0.053      0.033    -1.62   0.106       -0.117       0.011
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Conditional marginal effects                    Number of obs     =      2,012
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 1.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.054      0.033     1.63   0.104       -0.011       0.120
        irl  |      0.001      0.032     0.04   0.969       -0.062       0.064
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.
(sum of wgt is 2,003.3937954824)

Linear regression                               Number of obs     =      2,005
                                                F(3, 2001)        =       5.66
                                                Prob > F          =     0.0007
                                                R-squared         =     0.0151
                                                Root MSE          =     .42909

------------------------------------------------------------------------------
             |               Robust
         col |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.051      0.033    -1.54   0.123       -0.116       0.014
        irl  |     -0.049      0.033    -1.50   0.134       -0.114       0.015
             |
    partyid7 |     -0.024      0.006    -3.74   0.000       -0.037      -0.012
       _cons |      0.374      0.036    10.35   0.000        0.303       0.444
------------------------------------------------------------------------------

Predictive margins                              Number of obs     =      2,005
Model VCE    : Robust

Expression   : Linear prediction, predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.280      0.024    11.88   0.000        0.234       0.327
         ic  |      0.229      0.023     9.96   0.000        0.184       0.275
        irl  |      0.231      0.023    10.08   0.000        0.186       0.276
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,005
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.treat 3.treat partyid7

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.051      0.033    -1.54   0.123       -0.116       0.014
        irl  |     -0.049      0.033    -1.50   0.134       -0.114       0.015
             |
    partyid7 |     -0.024      0.006    -3.74   0.000       -0.037      -0.012
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,005
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 1.treat 3.treat partyid7

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.051      0.033     1.54   0.123       -0.014       0.116
        irl  |      0.002      0.032     0.05   0.963       -0.062       0.065
             |
    partyid7 |     -0.024      0.006    -3.74   0.000       -0.037      -0.012
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.
(sum of wgt is 2,003.3937954824)

Linear regression                               Number of obs     =      2,005
                                                F(5, 1999)        =       3.96
                                                Prob > F          =     0.0014
                                                R-squared         =     0.0179
                                                Root MSE          =      .4287

----------------------------------------------------------------------------------
                 |               Robust
             col |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           treat |
             ic  |     -0.115      0.073    -1.57   0.117       -0.258       0.029
            irl  |     -0.155      0.072    -2.15   0.031       -0.296      -0.014
                 |
        partyid7 |     -0.038      0.011    -3.53   0.000       -0.059      -0.017
                 |
treat#c.partyid7 |
             ic  |      0.017      0.015     1.10   0.274       -0.013       0.047
            irl  |      0.028      0.016     1.75   0.080       -0.003       0.059
                 |
           _cons |      0.426      0.051     8.39   0.000        0.327       0.526
----------------------------------------------------------------------------------

Predictive margins                              Number of obs     =      2,005
Model VCE    : Robust

Expression   : Linear prediction, predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.280      0.023    11.92   0.000        0.234       0.326
         ic  |      0.229      0.023     9.90   0.000        0.184       0.275
        irl  |      0.231      0.023    10.27   0.000        0.187       0.276
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,005
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.treat 3.treat partyid7

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.051      0.033    -1.54   0.124       -0.116       0.014
        irl  |     -0.049      0.033    -1.49   0.136       -0.112       0.015
             |
    partyid7 |     -0.024      0.006    -3.77   0.000       -0.036      -0.012
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,005
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 1.treat 3.treat partyid7

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.051      0.033     1.54   0.124       -0.014       0.116
        irl  |      0.002      0.032     0.07   0.944       -0.061       0.066
             |
    partyid7 |     -0.024      0.006    -3.77   0.000       -0.036      -0.012
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.
(sum of wgt is 2,003.3937954824)

Linear regression                               Number of obs     =      2,005
                                                F(4, 2000)        =       4.85
                                                Prob > F          =     0.0007
                                                R-squared         =     0.0160
                                                Root MSE          =     .42899

------------------------------------------------------------------------------
             |               Robust
         col |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.059      0.033    -1.79   0.074       -0.124       0.006
        irl  |     -0.049      0.033    -1.49   0.137       -0.113       0.016
             |
    partyid3 |
          1  |     -0.012      0.033    -0.35   0.724       -0.077       0.054
          3  |     -0.114      0.031    -3.68   0.000       -0.176      -0.053
             |
       _cons |      0.318      0.030    10.53   0.000        0.259       0.378
------------------------------------------------------------------------------

Predictive margins                              Number of obs     =      2,005
Model VCE    : Robust

Expression   : Linear prediction, predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.283      0.024    11.87   0.000        0.236       0.330
         ic  |      0.224      0.023     9.80   0.000        0.179       0.269
        irl  |      0.234      0.023    10.29   0.000        0.189       0.279
             |
    partyid3 |
          1  |      0.272      0.025    11.04   0.000        0.224       0.320
          2  |      0.284      0.022    12.66   0.000        0.240       0.328
          3  |      0.169      0.022     7.78   0.000        0.127       0.212
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,005
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.treat 3.treat 1.partyid3 3.partyid3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.059      0.033    -1.79   0.074       -0.124       0.006
        irl  |     -0.049      0.033    -1.49   0.137       -0.113       0.016
             |
    partyid3 |
          1  |     -0.012      0.033    -0.35   0.724       -0.077       0.054
          3  |     -0.114      0.031    -3.68   0.000       -0.176      -0.053
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,005
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 1.treat 3.treat 1.partyid3 3.partyid3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.059      0.033     1.79   0.074       -0.006       0.124
        irl  |      0.010      0.032     0.32   0.752       -0.053       0.073
             |
    partyid3 |
          1  |     -0.012      0.033    -0.35   0.724       -0.077       0.054
          3  |     -0.114      0.031    -3.68   0.000       -0.176      -0.053
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.
(sum of wgt is 2,003.3937954824)

Linear regression                               Number of obs     =      2,005
                                                F(8, 1996)        =       2.91
                                                Prob > F          =     0.0031
                                                R-squared         =     0.0192
                                                Root MSE          =     .42873

--------------------------------------------------------------------------------
               |               Robust
           col |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
         treat |
           ic  |     -0.045      0.055    -0.81   0.418       -0.154       0.064
          irl  |     -0.067      0.056    -1.20   0.231       -0.176       0.042
               |
      partyid3 |
            1  |      0.019      0.059     0.33   0.744       -0.097       0.135
            3  |     -0.151      0.056    -2.69   0.007       -0.261      -0.041
               |
treat#partyid3 |
         ic#1  |     -0.064      0.083    -0.77   0.443       -0.226       0.099
         ic#3  |      0.021      0.075     0.28   0.781       -0.126       0.167
        irl#1  |     -0.032      0.080    -0.40   0.687       -0.189       0.125
        irl#3  |      0.100      0.079     1.27   0.205       -0.055       0.254
               |
         _cons |      0.318      0.041     7.71   0.000        0.237       0.399
--------------------------------------------------------------------------------

Predictive margins                              Number of obs     =      2,005
Model VCE    : Robust

Expression   : Linear prediction, predict()

--------------------------------------------------------------------------------
               |            Delta-method
               |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
         treat |
           mc  |      0.283      0.024    11.85   0.000        0.236       0.330
           ic  |      0.222      0.023     9.80   0.000        0.178       0.267
          irl  |      0.233      0.023    10.34   0.000        0.189       0.277
               |
      partyid3 |
            1  |      0.271      0.024    11.07   0.000        0.223       0.319
            2  |      0.282      0.022    12.59   0.000        0.238       0.326
            3  |      0.169      0.021     7.88   0.000        0.127       0.211
               |
treat#partyid3 |
         mc#1  |      0.337      0.042     7.97   0.000        0.254       0.420
         mc#2  |      0.318      0.041     7.71   0.000        0.237       0.399
         mc#3  |      0.167      0.038     4.37   0.000        0.092       0.242
         ic#1  |      0.229      0.045     5.10   0.000        0.141       0.317
         ic#2  |      0.273      0.037     7.36   0.000        0.200       0.346
         ic#3  |      0.143      0.032     4.44   0.000        0.080       0.206
        irl#1  |      0.238      0.039     6.11   0.000        0.162       0.315
        irl#2  |      0.251      0.037     6.75   0.000        0.178       0.324
        irl#3  |      0.200      0.041     4.92   0.000        0.120       0.280
--------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,005
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.treat 3.treat 1.partyid3 3.partyid3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.061      0.033    -1.84   0.065       -0.125       0.004
        irl  |     -0.050      0.033    -1.52   0.128       -0.114       0.014
             |
    partyid3 |
          1  |     -0.012      0.033    -0.35   0.724       -0.077       0.053
          3  |     -0.113      0.031    -3.65   0.000       -0.174      -0.053
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,005
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 1.treat 3.treat 1.partyid3 3.partyid3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.061      0.033     1.84   0.065       -0.004       0.125
        irl  |      0.011      0.032     0.34   0.736       -0.052       0.073
             |
    partyid3 |
          1  |     -0.012      0.033    -0.35   0.724       -0.077       0.053
          3  |     -0.113      0.031    -3.65   0.000       -0.174      -0.053
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.
(sum of wgt is 2,003.3937954824)

Linear regression                               Number of obs     =      2,005
                                                F(4, 2000)        =       4.75
                                                Prob > F          =     0.0008
                                                R-squared         =     0.0172
                                                Root MSE          =     .42873

------------------------------------------------------------------------------
             |               Robust
         col |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.054      0.033    -1.63   0.103       -0.118       0.011
        irl  |     -0.049      0.033    -1.47   0.140       -0.114       0.016
             |
   partyid3l |
          1  |     -0.022      0.040    -0.54   0.591       -0.100       0.057
          3  |     -0.119      0.039    -3.04   0.002       -0.196      -0.042
             |
       _cons |      0.334      0.040     8.42   0.000        0.256       0.412
------------------------------------------------------------------------------

Predictive margins                              Number of obs     =      2,005
Model VCE    : Robust

Expression   : Linear prediction, predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.281      0.024    11.78   0.000        0.234       0.328
         ic  |      0.227      0.023    10.03   0.000        0.183       0.272
        irl  |      0.232      0.023    10.14   0.000        0.187       0.277
             |
   partyid3l |
          1  |      0.280      0.021    13.31   0.000        0.239       0.321
          2  |      0.301      0.034     8.84   0.000        0.235       0.368
          3  |      0.182      0.019     9.37   0.000        0.144       0.220
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,005
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.treat 3.treat 1.partyid3l 3.partyid3l

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.054      0.033    -1.63   0.103       -0.118       0.011
        irl  |     -0.049      0.033    -1.47   0.140       -0.114       0.016
             |
   partyid3l |
          1  |     -0.022      0.040    -0.54   0.591       -0.100       0.057
          3  |     -0.119      0.039    -3.04   0.002       -0.196      -0.042
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,005
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 1.treat 3.treat 1.partyid3l 3.partyid3l

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.054      0.033     1.63   0.103       -0.011       0.118
        irl  |      0.005      0.032     0.15   0.879       -0.058       0.068
             |
   partyid3l |
          1  |     -0.022      0.040    -0.54   0.591       -0.100       0.057
          3  |     -0.119      0.039    -3.04   0.002       -0.196      -0.042
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.
(sum of wgt is 2,003.3937954824)

Linear regression                               Number of obs     =      2,005
                                                F(8, 1996)        =       3.09
                                                Prob > F          =     0.0018
                                                R-squared         =     0.0225
                                                Root MSE          =       .428

---------------------------------------------------------------------------------
                |               Robust
            col |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
          treat |
            ic  |     -0.031      0.086    -0.36   0.718       -0.199       0.137
           irl  |     -0.126      0.080    -1.56   0.118       -0.284       0.032
                |
      partyid3l |
             1  |     -0.011      0.073    -0.16   0.875       -0.154       0.131
             3  |     -0.168      0.072    -2.34   0.019       -0.308      -0.027
                |
treat#partyid3l |
          ic#1  |     -0.056      0.101    -0.56   0.576       -0.254       0.141
          ic#3  |      0.001      0.097     0.01   0.991       -0.189       0.191
         irl#1  |      0.036      0.095     0.38   0.705       -0.150       0.222
         irl#3  |      0.165      0.095     1.73   0.083       -0.022       0.352
                |
          _cons |      0.348      0.063     5.55   0.000        0.225       0.471
---------------------------------------------------------------------------------

Predictive margins                              Number of obs     =      2,005
Model VCE    : Robust

Expression   : Linear prediction, predict()

---------------------------------------------------------------------------------
                |            Delta-method
                |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
          treat |
            mc  |      0.281      0.024    11.74   0.000        0.234       0.328
            ic  |      0.226      0.022    10.05   0.000        0.182       0.270
           irl  |      0.232      0.022    10.30   0.000        0.187       0.276
                |
      partyid3l |
             1  |      0.280      0.021    13.37   0.000        0.239       0.321
             2  |      0.299      0.034     8.89   0.000        0.233       0.365
             3  |      0.182      0.019     9.38   0.000        0.144       0.220
                |
treat#partyid3l |
          mc#1  |      0.336      0.037     9.15   0.000        0.264       0.408
          mc#2  |      0.348      0.063     5.55   0.000        0.225       0.471
          mc#3  |      0.180      0.035     5.20   0.000        0.112       0.248
          ic#1  |      0.249      0.037     6.66   0.000        0.176       0.322
          ic#2  |      0.317      0.059     5.40   0.000        0.202       0.432
          ic#3  |      0.150      0.028     5.29   0.000        0.094       0.206
         irl#1  |      0.246      0.034     7.30   0.000        0.180       0.313
         irl#2  |      0.222      0.050     4.40   0.000        0.123       0.321
         irl#3  |      0.219      0.037     5.85   0.000        0.146       0.293
---------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,005
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.treat 3.treat 1.partyid3l 3.partyid3l

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.055      0.033    -1.67   0.095       -0.119       0.010
        irl  |     -0.049      0.033    -1.50   0.134       -0.114       0.015
             |
   partyid3l |
          1  |     -0.019      0.040    -0.48   0.630       -0.097       0.059
          3  |     -0.117      0.039    -3.00   0.003       -0.193      -0.040
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,005
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 1.treat 3.treat 1.partyid3l 3.partyid3l

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.055      0.033     1.67   0.095       -0.010       0.119
        irl  |      0.006      0.032     0.17   0.861       -0.057       0.068
             |
   partyid3l |
          1  |     -0.019      0.040    -0.48   0.630       -0.097       0.059
          3  |     -0.117      0.039    -3.00   0.003       -0.193      -0.040
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.
(sum of wgt is 2,011.1671752376)

Linear regression                               Number of obs     =      2,009
                                                F(2, 2006)        =       2.00
                                                Prob > F          =     0.1352
                                                R-squared         =     0.0041
                                                Root MSE          =     .49869

------------------------------------------------------------------------------
             |               Robust
         lib |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.038      0.038    -1.01   0.315       -0.112       0.036
        irl  |      0.042      0.039     1.08   0.280       -0.035       0.119
             |
       _cons |      0.525      0.026    20.14   0.000        0.474       0.576
------------------------------------------------------------------------------

Adjusted predictions                            Number of obs     =      2,009
Model VCE    : Robust

Expression   : Linear prediction, predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.525      0.026    20.14   0.000        0.474       0.576
         ic  |      0.487      0.027    17.72   0.000        0.433       0.541
        irl  |      0.567      0.029    19.34   0.000        0.510       0.625
------------------------------------------------------------------------------

Conditional marginal effects                    Number of obs     =      2,009
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.038      0.038    -1.01   0.315       -0.112       0.036
        irl  |      0.042      0.039     1.08   0.280       -0.035       0.119
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Conditional marginal effects                    Number of obs     =      2,009
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 1.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.038      0.038     1.01   0.315       -0.036       0.112
        irl  |      0.080      0.040     2.00   0.045        0.002       0.159
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.
(sum of wgt is 2,003.3306699975)

Linear regression                               Number of obs     =      2,002
                                                F(3, 1998)        =       8.18
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0223
                                                Root MSE          =     .49419

------------------------------------------------------------------------------
             |               Robust
         lib |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.038      0.038    -1.01   0.314       -0.113       0.036
        irl  |      0.041      0.038     1.09   0.278       -0.033       0.116
             |
    partyid7 |     -0.034      0.008    -4.41   0.000       -0.050      -0.019
       _cons |      0.659      0.039    16.79   0.000        0.582       0.736
------------------------------------------------------------------------------

Predictive margins                              Number of obs     =      2,002
Model VCE    : Robust

Expression   : Linear prediction, predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.526      0.026    20.18   0.000        0.475       0.578
         ic  |      0.488      0.028    17.63   0.000        0.434       0.542
        irl  |      0.568      0.028    20.39   0.000        0.513       0.622
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,002
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.treat 3.treat partyid7

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.038      0.038    -1.01   0.314       -0.113       0.036
        irl  |      0.041      0.038     1.09   0.278       -0.033       0.116
             |
    partyid7 |     -0.034      0.008    -4.41   0.000       -0.050      -0.019
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,002
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 1.treat 3.treat partyid7

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.038      0.038     1.01   0.314       -0.036       0.113
        irl  |      0.080      0.039     2.03   0.043        0.003       0.157
             |
    partyid7 |     -0.034      0.008    -4.41   0.000       -0.050      -0.019
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.
(sum of wgt is 2,003.3306699975)

Linear regression                               Number of obs     =      2,002
                                                F(5, 1996)        =       6.42
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0265
                                                Root MSE          =     .49338

----------------------------------------------------------------------------------
                 |               Robust
             lib |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           treat |
             ic  |     -0.081      0.084    -0.97   0.334       -0.245       0.083
            irl  |      0.155      0.077     2.01   0.044        0.004       0.306
                 |
        partyid7 |     -0.028      0.013    -2.20   0.028       -0.053      -0.003
                 |
treat#c.partyid7 |
             ic  |      0.011      0.019     0.56   0.575       -0.027       0.048
            irl  |     -0.030      0.018    -1.66   0.098       -0.065       0.005
                 |
           _cons |      0.634      0.054    11.70   0.000        0.527       0.740
----------------------------------------------------------------------------------

Predictive margins                              Number of obs     =      2,002
Model VCE    : Robust

Expression   : Linear prediction, predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.527      0.026    20.19   0.000        0.475       0.578
         ic  |      0.487      0.028    17.62   0.000        0.433       0.541
        irl  |      0.567      0.027    20.87   0.000        0.514       0.620
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,002
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.treat 3.treat partyid7

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.040      0.038    -1.04   0.296       -0.114       0.035
        irl  |      0.040      0.038     1.07   0.285       -0.034       0.114
             |
    partyid7 |     -0.034      0.008    -4.36   0.000       -0.049      -0.018
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,002
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 1.treat 3.treat partyid7

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.040      0.038     1.04   0.296       -0.035       0.114
        irl  |      0.080      0.039     2.06   0.039        0.004       0.156
             |
    partyid7 |     -0.034      0.008    -4.36   0.000       -0.049      -0.018
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.
(sum of wgt is 2,003.3306699975)

Linear regression                               Number of obs     =      2,002
                                                F(4, 1997)        =       4.31
                                                Prob > F          =     0.0018
                                                R-squared         =     0.0161
                                                Root MSE          =     .49589

------------------------------------------------------------------------------
             |               Robust
         lib |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.043      0.038    -1.13   0.258       -0.118       0.032
        irl  |      0.042      0.039     1.10   0.272       -0.033       0.118
             |
    partyid3 |
          1  |      0.046      0.038     1.20   0.230       -0.029       0.120
          3  |     -0.091      0.039    -2.33   0.020       -0.168      -0.015
             |
       _cons |      0.537      0.034    15.61   0.000        0.470       0.605
------------------------------------------------------------------------------

Predictive margins                              Number of obs     =      2,002
Model VCE    : Robust

Expression   : Linear prediction, predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.528      0.026    20.18   0.000        0.476       0.579
         ic  |      0.484      0.028    17.45   0.000        0.430       0.539
        irl  |      0.570      0.029    20.01   0.000        0.514       0.626
             |
    partyid3 |
          1  |      0.582      0.027    21.51   0.000        0.529       0.635
          2  |      0.536      0.026    20.27   0.000        0.484       0.588
          3  |      0.445      0.029    15.51   0.000        0.389       0.501
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,002
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.treat 3.treat 1.partyid3 3.partyid3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.043      0.038    -1.13   0.258       -0.118       0.032
        irl  |      0.042      0.039     1.10   0.272       -0.033       0.118
             |
    partyid3 |
          1  |      0.046      0.038     1.20   0.230       -0.029       0.120
          3  |     -0.091      0.039    -2.33   0.020       -0.168      -0.015
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,002
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 1.treat 3.treat 1.partyid3 3.partyid3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.043      0.038     1.13   0.258       -0.032       0.118
        irl  |      0.086      0.040     2.15   0.032        0.008       0.164
             |
    partyid3 |
          1  |      0.046      0.038     1.20   0.230       -0.029       0.120
          3  |     -0.091      0.039    -2.33   0.020       -0.168      -0.015
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.
(sum of wgt is 2,003.3306699975)

Linear regression                               Number of obs     =      2,002
                                                F(8, 1993)        =       2.93
                                                Prob > F          =     0.0029
                                                R-squared         =     0.0212
                                                Root MSE          =     .49509

--------------------------------------------------------------------------------
               |               Robust
           lib |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
         treat |
           ic  |     -0.076      0.063    -1.21   0.225       -0.200       0.047
          irl  |     -0.007      0.067    -0.11   0.916       -0.139       0.125
               |
      partyid3 |
            1  |     -0.004      0.062    -0.06   0.950       -0.126       0.119
            3  |     -0.123      0.067    -1.84   0.066       -0.254       0.008
               |
treat#partyid3 |
         ic#1  |      0.017      0.091     0.18   0.855       -0.162       0.196
         ic#3  |      0.097      0.094     1.03   0.303       -0.087       0.281
        irl#1  |      0.135      0.091     1.48   0.139       -0.044       0.313
        irl#3  |      0.007      0.097     0.07   0.945       -0.183       0.196
               |
         _cons |      0.565      0.046    12.18   0.000        0.474       0.656
--------------------------------------------------------------------------------

Predictive margins                              Number of obs     =      2,002
Model VCE    : Robust

Expression   : Linear prediction, predict()

--------------------------------------------------------------------------------
               |            Delta-method
               |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
         treat |
           mc  |      0.529      0.026    20.07   0.000        0.478       0.581
           ic  |      0.485      0.028    17.59   0.000        0.431       0.539
          irl  |      0.570      0.028    20.48   0.000        0.515       0.624
               |
      partyid3 |
            1  |      0.580      0.027    21.84   0.000        0.528       0.633
            2  |      0.537      0.027    20.27   0.000        0.485       0.589
            3  |      0.448      0.029    15.70   0.000        0.392       0.504
               |
treat#partyid3 |
         mc#1  |      0.561      0.042    13.41   0.000        0.479       0.643
         mc#2  |      0.565      0.046    12.18   0.000        0.474       0.656
         mc#3  |      0.442      0.048     9.20   0.000        0.348       0.536
         ic#1  |      0.501      0.051     9.79   0.000        0.401       0.601
         ic#2  |      0.488      0.043    11.49   0.000        0.405       0.572
         ic#3  |      0.462      0.050     9.18   0.000        0.363       0.561
        irl#1  |      0.688      0.045    15.32   0.000        0.600       0.777
        irl#2  |      0.558      0.049    11.46   0.000        0.462       0.653
        irl#3  |      0.441      0.050     8.83   0.000        0.343       0.539
--------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,002
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.treat 3.treat 1.partyid3 3.partyid3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.044      0.038    -1.16   0.248       -0.119       0.031
        irl  |      0.040      0.038     1.05   0.294       -0.035       0.115
             |
    partyid3 |
          1  |      0.043      0.038     1.15   0.249       -0.030       0.117
          3  |     -0.089      0.039    -2.28   0.023       -0.165      -0.012
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,002
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 1.treat 3.treat 1.partyid3 3.partyid3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.044      0.038     1.16   0.248       -0.031       0.119
        irl  |      0.084      0.039     2.15   0.031        0.008       0.161
             |
    partyid3 |
          1  |      0.043      0.038     1.15   0.249       -0.030       0.117
          3  |     -0.089      0.039    -2.28   0.023       -0.165      -0.012
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.
(sum of wgt is 2,003.3306699975)

Linear regression                               Number of obs     =      2,002
                                                F(4, 1997)        =       5.85
                                                Prob > F          =     0.0001
                                                R-squared         =     0.0217
                                                Root MSE          =     .49448

------------------------------------------------------------------------------
             |               Robust
         lib |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.036      0.038    -0.96   0.340       -0.111       0.038
        irl  |      0.042      0.038     1.11   0.267       -0.032       0.117
             |
   partyid3l |
          1  |      0.106      0.045     2.34   0.019        0.017       0.196
          3  |     -0.036      0.046    -0.78   0.437       -0.127       0.055
             |
       _cons |      0.493      0.045    10.93   0.000        0.405       0.581
------------------------------------------------------------------------------

Predictive margins                              Number of obs     =      2,002
Model VCE    : Robust

Expression   : Linear prediction, predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.525      0.026    20.24   0.000        0.475       0.576
         ic  |      0.489      0.028    17.69   0.000        0.435       0.543
        irl  |      0.568      0.028    20.18   0.000        0.513       0.623
             |
   partyid3l |
          1  |      0.601      0.023    25.76   0.000        0.555       0.646
          2  |      0.494      0.039    12.70   0.000        0.418       0.570
          3  |      0.458      0.025    18.33   0.000        0.409       0.507
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,002
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.treat 3.treat 1.partyid3l 3.partyid3l

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.036      0.038    -0.96   0.340       -0.111       0.038
        irl  |      0.042      0.038     1.11   0.267       -0.032       0.117
             |
   partyid3l |
          1  |      0.106      0.045     2.34   0.019        0.017       0.196
          3  |     -0.036      0.046    -0.78   0.437       -0.127       0.055
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,002
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 1.treat 3.treat 1.partyid3l 3.partyid3l

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.036      0.038     0.96   0.340       -0.038       0.111
        irl  |      0.079      0.040     1.99   0.046        0.001       0.156
             |
   partyid3l |
          1  |      0.106      0.045     2.34   0.019        0.017       0.196
          3  |     -0.036      0.046    -0.78   0.437       -0.127       0.055
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.
(sum of wgt is 2,003.3306699975)

Linear regression                               Number of obs     =      2,002
                                                F(8, 1993)        =       3.30
                                                Prob > F          =     0.0010
                                                R-squared         =     0.0239
                                                Root MSE          =     .49441

---------------------------------------------------------------------------------
                |               Robust
            lib |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
          treat |
            ic  |     -0.023      0.093    -0.25   0.801       -0.206       0.159
           irl  |      0.047      0.100     0.47   0.638       -0.149       0.244
                |
      partyid3l |
             1  |      0.112      0.079     1.42   0.157       -0.043       0.266
             3  |     -0.025      0.082    -0.31   0.758       -0.186       0.135
                |
treat#partyid3l |
          ic#1  |     -0.044      0.109    -0.40   0.689       -0.258       0.170
          ic#3  |      0.013      0.111     0.11   0.910       -0.205       0.230
         irl#1  |      0.028      0.114     0.25   0.804       -0.195       0.252
         irl#3  |     -0.046      0.118    -0.39   0.693       -0.277       0.184
                |
          _cons |      0.487      0.070     6.95   0.000        0.349       0.624
---------------------------------------------------------------------------------

Predictive margins                              Number of obs     =      2,002
Model VCE    : Robust

Expression   : Linear prediction, predict()

---------------------------------------------------------------------------------
                |            Delta-method
                |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
          treat |
            mc  |      0.525      0.026    20.12   0.000        0.474       0.577
            ic  |      0.488      0.028    17.68   0.000        0.434       0.542
           irl  |      0.568      0.028    20.35   0.000        0.513       0.622
                |
      partyid3l |
             1  |      0.599      0.023    25.89   0.000        0.554       0.645
             2  |      0.494      0.039    12.59   0.000        0.417       0.570
             3  |      0.458      0.025    18.35   0.000        0.409       0.507
                |
treat#partyid3l |
          mc#1  |      0.598      0.036    16.56   0.000        0.527       0.669
          mc#2  |      0.487      0.070     6.95   0.000        0.349       0.624
          mc#3  |      0.462      0.042    10.93   0.000        0.379       0.544
          ic#1  |      0.531      0.044    12.03   0.000        0.445       0.618
          ic#2  |      0.463      0.061     7.58   0.000        0.343       0.583
          ic#3  |      0.451      0.043    10.52   0.000        0.367       0.535
         irl#1  |      0.674      0.040    16.81   0.000        0.595       0.752
         irl#2  |      0.534      0.072     7.44   0.000        0.393       0.675
         irl#3  |      0.462      0.045    10.32   0.000        0.375       0.550
---------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,002
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.treat 3.treat 1.partyid3l 3.partyid3l

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.037      0.038    -0.99   0.324       -0.112       0.037
        irl  |      0.042      0.038     1.10   0.270       -0.033       0.117
             |
   partyid3l |
          1  |      0.106      0.046     2.33   0.020        0.017       0.195
          3  |     -0.035      0.046    -0.76   0.447       -0.127       0.056
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,002
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 1.treat 3.treat 1.partyid3l 3.partyid3l

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.037      0.038     0.99   0.324       -0.037       0.112
        irl  |      0.080      0.039     2.03   0.042        0.003       0.157
             |
   partyid3l |
          1  |      0.106      0.046     2.33   0.020        0.017       0.195
          3  |     -0.035      0.046    -0.76   0.447       -0.127       0.056
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

. 
. outreg2 [*] ///
>   using docs/ols-margins-without-covariates.xls, ///
>   noaster stats(coef se ci pval) bdec(1) sdec(1) cdec(3)  ///
>   stnum(replace coef=coef*100, replace se=se*100) ///
>   paren(se) bracket(ci) ///
>   excel replace
docs/ols-margins-without-covariates.xls
dir : seeout

.  
. outreg2 [*] ///
>   using docs/ols-margins-without-covariates-wide.xls, ///
>   noaster stats(coef se ci pval) bdec(1) sdec(1) cdec(3)  ///
>   stnum(replace coef=coef*100, replace se=se*100) ///
>   paren(se) bracket(ci) ///
>   sideway excel replace
docs/ols-margins-without-covariates-wide.xls
dir : seeout

. 
. estimates clear

. 
. *** Logit models, with no additional adjustment
. 
. foreach dom in `domain' {
  2. 
. logit `dom' b1.treat [pweight=weight]
  3. estimates store `dom'_r1
  4. 
. logit `dom' b1.treat c.partyid7 [pweight=weight]
  5. estimates store `dom'_r2
  6. 
. logit `dom' b1.treat##c.partyid7 [pweight=weight]
  7. estimates store `dom'_r3
  8. 
. logit `dom' b1.treat b2.partyid3 [pweight=weight]
  9. estimates store `dom'_r4
 10. 
. logit `dom' b1.treat##b2.partyid3 [pweight=weight]
 11. estimates store `dom'_r5
 12. 
. logit `dom' b1.treat b2.partyid3l [pweight=weight]
 13. estimates store `dom'_r6
 14. 
. logit `dom' b1.treat##b2.partyid3l [pweight=weight]
 15. estimates store `dom'_r7
 16. 
. }

Iteration 0:   log pseudolikelihood = -1385.8683  
Iteration 1:   log pseudolikelihood = -1381.6131  
Iteration 2:   log pseudolikelihood = -1381.6128  
Iteration 3:   log pseudolikelihood = -1381.6128  

Logistic regression                             Number of obs     =      2,016
                                                Wald chi2(2)      =       4.30
                                                Prob > chi2       =     0.1165
Log pseudolikelihood = -1381.6128               Pseudo R2         =     0.0031

------------------------------------------------------------------------------
             |               Robust
         spk |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.315      0.152    -2.07   0.038       -0.613      -0.017
        irl  |     -0.137      0.157    -0.87   0.383       -0.446       0.171
             |
       _cons |     -0.068      0.104    -0.66   0.511       -0.272       0.135
------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -1380.5082  
Iteration 1:   log pseudolikelihood = -1372.1556  
Iteration 2:   log pseudolikelihood = -1372.1544  
Iteration 3:   log pseudolikelihood = -1372.1544  

Logistic regression                             Number of obs     =      2,009
                                                Wald chi2(3)      =       8.76
                                                Prob > chi2       =     0.0326
Log pseudolikelihood = -1372.1544               Pseudo R2         =     0.0061

------------------------------------------------------------------------------
             |               Robust
         spk |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.303      0.153    -1.98   0.047       -0.603      -0.004
        irl  |     -0.127      0.159    -0.80   0.423       -0.438       0.184
             |
    partyid7 |     -0.068      0.033    -2.09   0.037       -0.132      -0.004
       _cons |      0.186      0.161     1.15   0.249       -0.130       0.502
------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -1380.5082  
Iteration 1:   log pseudolikelihood =  -1371.398  
Iteration 2:   log pseudolikelihood =  -1371.393  
Iteration 3:   log pseudolikelihood =  -1371.393  

Logistic regression                             Number of obs     =      2,009
                                                Wald chi2(5)      =       9.89
                                                Prob > chi2       =     0.0783
Log pseudolikelihood =  -1371.393               Pseudo R2         =     0.0066

----------------------------------------------------------------------------------
                 |               Robust
             spk |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           treat |
             ic  |     -0.036      0.331    -0.11   0.914       -0.684       0.613
            irl  |      0.027      0.357     0.08   0.939       -0.673       0.727
                 |
        partyid7 |     -0.035      0.050    -0.71   0.479       -0.134       0.063
                 |
treat#c.partyid7 |
             ic  |     -0.070      0.076    -0.92   0.356       -0.218       0.078
            irl  |     -0.041      0.081    -0.50   0.615       -0.199       0.118
                 |
           _cons |      0.061      0.214     0.29   0.775       -0.359       0.481
----------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -1380.5082  
Iteration 1:   log pseudolikelihood = -1372.1018  
Iteration 2:   log pseudolikelihood = -1372.0999  
Iteration 3:   log pseudolikelihood = -1372.0999  

Logistic regression                             Number of obs     =      2,009
                                                Wald chi2(4)      =       9.11
                                                Prob > chi2       =     0.0584
Log pseudolikelihood = -1372.0999               Pseudo R2         =     0.0061

------------------------------------------------------------------------------
             |               Robust
         spk |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.332      0.153    -2.17   0.030       -0.632      -0.032
        irl  |     -0.128      0.159    -0.80   0.421       -0.440       0.184
             |
    partyid3 |
          1  |     -0.119      0.155    -0.77   0.440       -0.422       0.184
          3  |     -0.333      0.156    -2.13   0.033       -0.639      -0.026
             |
       _cons |      0.066      0.137     0.48   0.633       -0.204       0.335
------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -1380.5082  
Iteration 1:   log pseudolikelihood =   -1370.21  
Iteration 2:   log pseudolikelihood = -1370.1974  
Iteration 3:   log pseudolikelihood = -1370.1974  

Logistic regression                             Number of obs     =      2,009
                                                Wald chi2(8)      =      11.47
                                                Prob > chi2       =     0.1763
Log pseudolikelihood = -1370.1974               Pseudo R2         =     0.0075

--------------------------------------------------------------------------------
               |               Robust
           spk |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
         treat |
           ic  |     -0.310      0.250    -1.24   0.214       -0.799       0.179
          irl  |     -0.330      0.262    -1.26   0.207       -0.842       0.183
               |
      partyid3 |
            1  |     -0.245      0.248    -0.99   0.323       -0.732       0.241
            3  |     -0.346      0.267    -1.30   0.195       -0.869       0.177
               |
treat#partyid3 |
         ic#1  |      0.053      0.365     0.15   0.885       -0.662       0.768
         ic#3  |     -0.206      0.377    -0.55   0.584       -0.945       0.532
        irl#1  |      0.372      0.382     0.97   0.330       -0.376       1.120
        irl#3  |      0.245      0.385     0.63   0.525       -0.510       1.000
               |
         _cons |      0.115      0.183     0.63   0.529       -0.244       0.474
--------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -1380.5082  
Iteration 1:   log pseudolikelihood = -1373.4221  
Iteration 2:   log pseudolikelihood =  -1373.421  
Iteration 3:   log pseudolikelihood =  -1373.421  

Logistic regression                             Number of obs     =      2,009
                                                Wald chi2(4)      =       7.52
                                                Prob > chi2       =     0.1107
Log pseudolikelihood =  -1373.421               Pseudo R2         =     0.0051

------------------------------------------------------------------------------
             |               Robust
         spk |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.307      0.153    -2.01   0.044       -0.607      -0.008
        irl  |     -0.125      0.159    -0.79   0.431       -0.436       0.186
             |
   partyid3l |
          1  |      0.021      0.183     0.11   0.910       -0.339       0.380
          3  |     -0.215      0.185    -1.16   0.244       -0.577       0.147
             |
       _cons |     -0.005      0.180    -0.03   0.980       -0.358       0.349
------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -1380.5082  
Iteration 1:   log pseudolikelihood = -1370.5124  
Iteration 2:   log pseudolikelihood = -1370.4988  
Iteration 3:   log pseudolikelihood = -1370.4988  

Logistic regression                             Number of obs     =      2,009
                                                Wald chi2(8)      =      10.86
                                                Prob > chi2       =     0.2098
Log pseudolikelihood = -1370.4988               Pseudo R2         =     0.0073

---------------------------------------------------------------------------------
                |               Robust
            spk |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
          treat |
            ic  |     -0.132      0.371    -0.36   0.721       -0.859       0.594
           irl  |     -0.311      0.391    -0.79   0.427       -1.078       0.456
                |
      partyid3l |
             1  |     -0.049      0.314    -0.16   0.876       -0.665       0.567
             3  |     -0.094      0.325    -0.29   0.772       -0.731       0.543
                |
treat#partyid3l |
          ic#1  |     -0.028      0.436    -0.06   0.949       -0.881       0.826
          ic#3  |     -0.466      0.443    -1.05   0.293       -1.335       0.403
         irl#1  |      0.305      0.458     0.67   0.505       -0.593       1.204
         irl#3  |      0.134      0.463     0.29   0.772       -0.774       1.042
                |
          _cons |     -0.018      0.278    -0.06   0.949       -0.562       0.526
---------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -1130.5407  
Iteration 1:   log pseudolikelihood = -1127.0235  
Iteration 2:   log pseudolikelihood = -1127.0183  
Iteration 3:   log pseudolikelihood = -1127.0183  

Logistic regression                             Number of obs     =      2,012
                                                Wald chi2(2)      =       3.59
                                                Prob > chi2       =     0.1665
Log pseudolikelihood = -1127.0183               Pseudo R2         =     0.0031

------------------------------------------------------------------------------
             |               Robust
         col |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.285      0.176    -1.62   0.105       -0.630       0.060
        irl  |     -0.278      0.172    -1.62   0.106       -0.615       0.059
             |
       _cons |     -0.924      0.118    -7.83   0.000       -1.155      -0.693
------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -1122.4494  
Iteration 1:   log pseudolikelihood = -1107.3733  
Iteration 2:   log pseudolikelihood = -1107.2952  
Iteration 3:   log pseudolikelihood = -1107.2952  

Logistic regression                             Number of obs     =      2,005
                                                Wald chi2(3)      =      16.80
                                                Prob > chi2       =     0.0008
Log pseudolikelihood = -1107.2952               Pseudo R2         =     0.0135

------------------------------------------------------------------------------
             |               Robust
         col |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.269      0.177    -1.52   0.130       -0.616       0.079
        irl  |     -0.263      0.176    -1.49   0.136       -0.608       0.082
             |
    partyid7 |     -0.132      0.036    -3.70   0.000       -0.202      -0.062
       _cons |     -0.451      0.177    -2.55   0.011       -0.798      -0.104
------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -1122.4494  
Iteration 1:   log pseudolikelihood = -1105.2356  
Iteration 2:   log pseudolikelihood = -1105.0478  
Iteration 3:   log pseudolikelihood = -1105.0477  

Logistic regression                             Number of obs     =      2,005
                                                Wald chi2(5)      =      20.66
                                                Prob > chi2       =     0.0009
Log pseudolikelihood = -1105.0477               Pseudo R2         =     0.0155

----------------------------------------------------------------------------------
                 |               Robust
             col |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           treat |
             ic  |     -0.524      0.359    -1.46   0.144       -1.228       0.179
            irl  |     -0.749      0.358    -2.09   0.036       -1.452      -0.047
                 |
        partyid7 |     -0.195      0.058    -3.38   0.001       -0.308      -0.082
                 |
treat#c.partyid7 |
             ic  |      0.072      0.084     0.85   0.393       -0.093       0.237
            irl  |      0.136      0.087     1.57   0.117       -0.034       0.307
                 |
           _cons |     -0.229      0.232    -0.99   0.322       -0.684       0.225
----------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -1122.4494  
Iteration 1:   log pseudolikelihood = -1105.9046  
Iteration 2:   log pseudolikelihood = -1105.7287  
Iteration 3:   log pseudolikelihood = -1105.7286  

Logistic regression                             Number of obs     =      2,005
                                                Wald chi2(4)      =      16.83
                                                Prob > chi2       =     0.0021
Log pseudolikelihood = -1105.7286               Pseudo R2         =     0.0149

------------------------------------------------------------------------------
             |               Robust
         col |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.317      0.178    -1.79   0.074       -0.666       0.031
        irl  |     -0.261      0.176    -1.48   0.138       -0.606       0.084
             |
    partyid3 |
          1  |     -0.061      0.167    -0.36   0.717       -0.388       0.267
          3  |     -0.666      0.190    -3.51   0.000       -1.038      -0.294
             |
       _cons |     -0.744      0.148    -5.01   0.000       -1.035      -0.453
------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -1122.4494  
Iteration 1:   log pseudolikelihood = -1103.0831  
Iteration 2:   log pseudolikelihood = -1102.7909  
Iteration 3:   log pseudolikelihood = -1102.7906  
Iteration 4:   log pseudolikelihood = -1102.7906  

Logistic regression                             Number of obs     =      2,005
                                                Wald chi2(8)      =      20.60
                                                Prob > chi2       =     0.0083
Log pseudolikelihood = -1102.7906               Pseudo R2         =     0.0175

--------------------------------------------------------------------------------
               |               Robust
           col |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
         treat |
           ic  |     -0.216      0.266    -0.81   0.416       -0.738       0.305
          irl  |     -0.328      0.274    -1.20   0.231       -0.865       0.209
               |
      partyid3 |
            1  |      0.088      0.268     0.33   0.743       -0.437       0.613
            3  |     -0.845      0.333    -2.53   0.011       -1.498      -0.191
               |
treat#partyid3 |
         ic#1  |     -0.324      0.413    -0.78   0.433       -1.134       0.486
         ic#3  |      0.031      0.463     0.07   0.947       -0.877       0.939
        irl#1  |     -0.157      0.396    -0.40   0.691       -0.933       0.618
        irl#3  |      0.551      0.463     1.19   0.234       -0.357       1.459
               |
         _cons |     -0.763      0.190    -4.02   0.000       -1.135      -0.391
--------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -1122.4494  
Iteration 1:   log pseudolikelihood =  -1104.913  
Iteration 2:   log pseudolikelihood = -1104.7729  
Iteration 3:   log pseudolikelihood = -1104.7729  

Logistic regression                             Number of obs     =      2,005
                                                Wald chi2(4)      =      17.53
                                                Prob > chi2       =     0.0015
Log pseudolikelihood = -1104.7729               Pseudo R2         =     0.0157

------------------------------------------------------------------------------
             |               Robust
         col |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.288      0.177    -1.62   0.104       -0.635       0.060
        irl  |     -0.260      0.177    -1.47   0.142       -0.607       0.087
             |
   partyid3l |
          1  |     -0.106      0.193    -0.55   0.584       -0.485       0.273
          3  |     -0.664      0.208    -3.19   0.001       -1.073      -0.256
             |
       _cons |     -0.667      0.191    -3.50   0.000       -1.041      -0.293
------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -1122.4494  
Iteration 1:   log pseudolikelihood = -1100.0291  
Iteration 2:   log pseudolikelihood = -1099.7048  
Iteration 3:   log pseudolikelihood = -1099.7046  
Iteration 4:   log pseudolikelihood = -1099.7046  

Logistic regression                             Number of obs     =      2,005
                                                Wald chi2(8)      =      23.18
                                                Prob > chi2       =     0.0031
Log pseudolikelihood = -1099.7046               Pseudo R2         =     0.0203

---------------------------------------------------------------------------------
                |               Robust
            col |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
          treat |
            ic  |     -0.140      0.386    -0.36   0.717       -0.897       0.617
           irl  |     -0.625      0.401    -1.56   0.119       -1.412       0.162
                |
      partyid3l |
             1  |     -0.051      0.321    -0.16   0.874       -0.680       0.578
             3  |     -0.888      0.362    -2.45   0.014       -1.597      -0.179
                |
treat#partyid3l |
          ic#1  |     -0.284      0.465    -0.61   0.541       -1.195       0.627
          ic#3  |     -0.078      0.503    -0.15   0.877       -1.064       0.909
         irl#1  |      0.187      0.470     0.40   0.691       -0.734       1.109
         irl#3  |      0.872      0.513     1.70   0.089       -0.134       1.879
                |
          _cons |     -0.629      0.276    -2.28   0.023       -1.169      -0.088
---------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -1391.4433  
Iteration 1:   log pseudolikelihood = -1387.2689  
Iteration 2:   log pseudolikelihood = -1387.2688  

Logistic regression                             Number of obs     =      2,009
                                                Wald chi2(2)      =       3.97
                                                Prob > chi2       =     0.1373
Log pseudolikelihood = -1387.2688               Pseudo R2         =     0.0030

------------------------------------------------------------------------------
             |               Robust
         lib |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.152      0.152    -1.00   0.315       -0.450       0.145
        irl  |      0.171      0.159     1.08   0.281       -0.140       0.482
             |
       _cons |      0.100      0.104     0.95   0.340       -0.105       0.304
------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -1385.7829  
Iteration 1:   log pseudolikelihood = -1363.2574  
Iteration 2:   log pseudolikelihood = -1363.2503  
Iteration 3:   log pseudolikelihood = -1363.2503  

Logistic regression                             Number of obs     =      2,002
                                                Wald chi2(3)      =      23.00
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -1363.2503               Pseudo R2         =     0.0163

------------------------------------------------------------------------------
             |               Robust
         lib |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.156      0.155    -1.01   0.314       -0.460       0.148
        irl  |      0.170      0.157     1.08   0.279       -0.138       0.479
             |
    partyid7 |     -0.140      0.032    -4.32   0.000       -0.204      -0.077
       _cons |      0.647      0.163     3.96   0.000        0.327       0.967
------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -1385.7829  
Iteration 1:   log pseudolikelihood = -1358.7639  
Iteration 2:   log pseudolikelihood = -1358.7141  
Iteration 3:   log pseudolikelihood = -1358.7141  

Logistic regression                             Number of obs     =      2,002
                                                Wald chi2(5)      =      27.89
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -1358.7141               Pseudo R2         =     0.0195

----------------------------------------------------------------------------------
                 |               Robust
             lib |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           treat |
             ic  |     -0.329      0.340    -0.97   0.333       -0.995       0.337
            irl  |      0.675      0.339     1.99   0.047        0.010       1.341
                 |
        partyid7 |     -0.112      0.052    -2.17   0.030       -0.214      -0.011
                 |
treat#c.partyid7 |
             ic  |      0.044      0.078     0.56   0.573       -0.108       0.196
            irl  |     -0.130      0.077    -1.68   0.093       -0.281       0.021
                 |
           _cons |      0.540      0.223     2.42   0.015        0.103       0.977
----------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -1385.7829  
Iteration 1:   log pseudolikelihood = -1369.6218  
Iteration 2:   log pseudolikelihood = -1369.6194  
Iteration 3:   log pseudolikelihood = -1369.6194  

Logistic regression                             Number of obs     =      2,002
                                                Wald chi2(4)      =      16.49
                                                Prob > chi2       =     0.0024
Log pseudolikelihood = -1369.6194               Pseudo R2         =     0.0117

------------------------------------------------------------------------------
             |               Robust
         lib |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.175      0.155    -1.13   0.259       -0.478       0.129
        irl  |      0.174      0.158     1.10   0.272       -0.136       0.484
             |
    partyid3 |
          1  |      0.186      0.155     1.20   0.230       -0.118       0.489
          3  |     -0.367      0.158    -2.32   0.020       -0.677      -0.057
             |
       _cons |      0.150      0.139     1.08   0.280       -0.123       0.423
------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -1385.7829  
Iteration 1:   log pseudolikelihood = -1364.2463  
Iteration 2:   log pseudolikelihood = -1364.2143  
Iteration 3:   log pseudolikelihood = -1364.2143  

Logistic regression                             Number of obs     =      2,002
                                                Wald chi2(8)      =      21.09
                                                Prob > chi2       =     0.0069
Log pseudolikelihood = -1364.2143               Pseudo R2         =     0.0156

--------------------------------------------------------------------------------
               |               Robust
           lib |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
         treat |
           ic  |     -0.307      0.253    -1.21   0.226       -0.804       0.190
          irl  |     -0.029      0.272    -0.11   0.916       -0.562       0.505
               |
      partyid3 |
            1  |     -0.016      0.253    -0.06   0.950       -0.512       0.480
            3  |     -0.494      0.271    -1.83   0.068       -1.024       0.036
               |
treat#partyid3 |
         ic#1  |      0.067      0.367     0.18   0.856       -0.653       0.786
         ic#3  |      0.389      0.378     1.03   0.303       -0.352       1.130
        irl#1  |      0.578      0.383     1.51   0.131       -0.173       1.328
        irl#3  |      0.027      0.391     0.07   0.944       -0.739       0.793
               |
         _cons |      0.260      0.188     1.38   0.167       -0.109       0.629
--------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -1385.7829  
Iteration 1:   log pseudolikelihood = -1363.9404  
Iteration 2:   log pseudolikelihood = -1363.9345  
Iteration 3:   log pseudolikelihood = -1363.9345  

Logistic regression                             Number of obs     =      2,002
                                                Wald chi2(4)      =      22.27
                                                Prob > chi2       =     0.0002
Log pseudolikelihood = -1363.9345               Pseudo R2         =     0.0158

------------------------------------------------------------------------------
             |               Robust
         lib |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.148      0.155    -0.95   0.340       -0.451       0.156
        irl  |      0.175      0.157     1.11   0.267       -0.134       0.483
             |
   partyid3l |
          1  |      0.433      0.184     2.35   0.019        0.071       0.794
          3  |     -0.145      0.186    -0.78   0.436       -0.509       0.220
             |
       _cons |     -0.028      0.182    -0.16   0.876       -0.384       0.328
------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -1385.7829  
Iteration 1:   log pseudolikelihood = -1361.5715  
Iteration 2:   log pseudolikelihood = -1361.5463  
Iteration 3:   log pseudolikelihood = -1361.5463  

Logistic regression                             Number of obs     =      2,002
                                                Wald chi2(8)      =      24.28
                                                Prob > chi2       =     0.0021
Log pseudolikelihood = -1361.5463               Pseudo R2         =     0.0175

---------------------------------------------------------------------------------
                |               Robust
            lib |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
          treat |
            ic  |     -0.094      0.372    -0.25   0.801       -0.823       0.635
           irl  |      0.189      0.401     0.47   0.638       -0.598       0.976
                |
      partyid3l |
             1  |      0.452      0.317     1.42   0.155       -0.170       1.074
             3  |     -0.101      0.327    -0.31   0.757       -0.742       0.540
                |
treat#partyid3l |
          ic#1  |     -0.179      0.438    -0.41   0.682       -1.039       0.680
          ic#3  |      0.050      0.444     0.11   0.910       -0.820       0.920
         irl#1  |      0.138      0.466     0.30   0.768       -0.775       1.050
         irl#3  |     -0.186      0.471    -0.39   0.693       -1.110       0.738
                |
          _cons |     -0.053      0.280    -0.19   0.850       -0.601       0.495
---------------------------------------------------------------------------------

. 
. estimates dir

-------------------------------------------------------
        name | command      depvar       npar  title 
-------------+-----------------------------------------
      spk_r1 | logit        spk             4  
      spk_r2 | logit        spk             5  
      spk_r3 | logit        spk             8  
      spk_r4 | logit        spk             7  
      spk_r5 | logit        spk            16  
      spk_r6 | logit        spk             7  
      spk_r7 | logit        spk            16  
      col_r1 | logit        col             4  
      col_r2 | logit        col             5  
      col_r3 | logit        col             8  
      col_r4 | logit        col             7  
      col_r5 | logit        col            16  
      col_r6 | logit        col             7  
      col_r7 | logit        col            16  
      lib_r1 | logit        lib             4  
      lib_r2 | logit        lib             5  
      lib_r3 | logit        lib             8  
      lib_r4 | logit        lib             7  
      lib_r5 | logit        lib            16  
      lib_r6 | logit        lib             7  
      lib_r7 | logit        lib            16  
-------------------------------------------------------

. 
. outreg2 [*] ///
>   using docs/logit-estimates-without-covariates.xls, ///
>   noaster stats(coef se ci pval)  dec(3)  ///
>   paren(se) bracket(ci) ///
>   excel replace
docs/logit-estimates-without-covariates.xls
dir : seeout

. 
. estimates clear

. 
. foreach dom in `domain' {
  2. 
. logit `dom' b1.treat [pweight=weight]
  3.   margins b1.treat, post
  4.   estimates store `dom'_r1
  5.     quietly logit `dom' b1.treat [pweight=weight]
  6.     margins, dydx(*) post
  7.     estimates store `dom'_r1d1
  8.     quietly logit `dom' b2.treat [pweight=weight]
  9.     margins, dydx(*) post
 10.     estimates store `dom'_r1d2
 11. 
. logit `dom' b1.treat c.partyid7 [pweight=weight]
 12.   margins b1.treat, post
 13.   estimates store `dom'_r2
 14.     quietly logit `dom' b1.treat c.partyid7 [pweight=weight]
 15.     margins, dydx(*) post
 16.     estimates store `dom'_r2d1
 17.         quietly logit `dom' b2.treat c.partyid7 [pweight=weight]
 18.     margins, dydx(*) post
 19.     estimates store `dom'_r2d2
 20. 
. logit `dom' b1.treat##c.partyid7 [pweight=weight]
 21.   margins b1.treat, post
 22.   estimates store `dom'_r3
 23.     quietly logit `dom' b1.treat##c.partyid7 [pweight=weight]
 24.     margins, dydx(*) post
 25.     estimates store `dom'_r3d1
 26.         quietly logit `dom' b2.treat##c.partyid7 [pweight=weight]
 27.     margins, dydx(*) post
 28.     estimates store `dom'_r3d2
 29. 
. logit `dom' b1.treat b2.partyid3 [pweight=weight]
 30.   margins b1.treat b2.partyid3, post
 31.   estimates store `dom'_r4
 32.     quietly logit `dom' b1.treat b2.partyid3 [pweight=weight]
 33.     margins, dydx(*) post
 34.     estimates store `dom'_r4d1
 35.         quietly logit `dom' b2.treat b2.partyid3 [pweight=weight]
 36.     margins, dydx(*) post
 37.     estimates store `dom'_r4d2
 38. 
. logit `dom' b1.treat##b2.partyid3 [pweight=weight]
 39.   margins b1.treat##b2.partyid3, post
 40.   estimates store `dom'_r5
 41.     quietly logit `dom' b1.treat##b2.partyid3 [pweight=weight]
 42.     margins, dydx(*) post
 43.     estimates store `dom'_r5d1
 44.         quietly logit `dom' b2.treat##b2.partyid3 [pweight=weight]
 45.     margins, dydx(*) post
 46.     estimates store `dom'_r5d2
 47. 
. logit `dom' b1.treat b2.partyid3l [pweight=weight]
 48.   margins b1.treat b2.partyid3l, post
 49.   estimates store `dom'_r6
 50.     quietly logit `dom' b1.treat b2.partyid3l [pweight=weight]
 51.     margins, dydx(*) post
 52.     estimates store `dom'_r6d1
 53.         quietly logit `dom' b2.treat b2.partyid3l [pweight=weight]
 54.     margins, dydx(*) post
 55.     estimates store `dom'_r6d2
 56. 
. logit `dom' b1.treat##b2.partyid3l [pweight=weight]
 57.   margins b1.treat##b2.partyid3l, post
 58.   estimates store `dom'_r7
 59.     quietly logit `dom' b1.treat##b2.partyid3l [pweight=weight]
 60.     margins, dydx(*) post
 61.     estimates store `dom'_r7d1
 62.         quietly logit `dom' b2.treat##b2.partyid3l [pweight=weight]
 63.     margins, dydx(*) post
 64.     estimates store `dom'_r7d2
 65. 
. }

Iteration 0:   log pseudolikelihood = -1385.8683  
Iteration 1:   log pseudolikelihood = -1381.6131  
Iteration 2:   log pseudolikelihood = -1381.6128  
Iteration 3:   log pseudolikelihood = -1381.6128  

Logistic regression                             Number of obs     =      2,016
                                                Wald chi2(2)      =       4.30
                                                Prob > chi2       =     0.1165
Log pseudolikelihood = -1381.6128               Pseudo R2         =     0.0031

------------------------------------------------------------------------------
             |               Robust
         spk |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.315      0.152    -2.07   0.038       -0.613      -0.017
        irl  |     -0.137      0.157    -0.87   0.383       -0.446       0.171
             |
       _cons |     -0.068      0.104    -0.66   0.511       -0.272       0.135
------------------------------------------------------------------------------

Adjusted predictions                            Number of obs     =      2,016
Model VCE    : Robust

Expression   : Pr(spk), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.483      0.026    18.62   0.000        0.432       0.534
         ic  |      0.405      0.027    15.15   0.000        0.353       0.458
        irl  |      0.449      0.029    15.32   0.000        0.391       0.506
------------------------------------------------------------------------------

Conditional marginal effects                    Number of obs     =      2,016
Model VCE    : Robust

Expression   : Pr(spk), predict()
dy/dx w.r.t. : 2.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.078      0.037    -2.08   0.037       -0.151      -0.005
        irl  |     -0.034      0.039    -0.87   0.382       -0.111       0.042
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Conditional marginal effects                    Number of obs     =      2,016
Model VCE    : Robust

Expression   : Pr(spk), predict()
dy/dx w.r.t. : 1.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.078      0.037     2.08   0.037        0.005       0.151
        irl  |      0.043      0.040     1.09   0.274       -0.034       0.121
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Iteration 0:   log pseudolikelihood = -1380.5082  
Iteration 1:   log pseudolikelihood = -1372.1556  
Iteration 2:   log pseudolikelihood = -1372.1544  
Iteration 3:   log pseudolikelihood = -1372.1544  

Logistic regression                             Number of obs     =      2,009
                                                Wald chi2(3)      =       8.76
                                                Prob > chi2       =     0.0326
Log pseudolikelihood = -1372.1544               Pseudo R2         =     0.0061

------------------------------------------------------------------------------
             |               Robust
         spk |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.303      0.153    -1.98   0.047       -0.603      -0.004
        irl  |     -0.127      0.159    -0.80   0.423       -0.438       0.184
             |
    partyid7 |     -0.068      0.033    -2.09   0.037       -0.132      -0.004
       _cons |      0.186      0.161     1.15   0.249       -0.130       0.502
------------------------------------------------------------------------------

Predictive margins                              Number of obs     =      2,009
Model VCE    : Robust

Expression   : Pr(spk), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.481      0.026    18.44   0.000        0.430       0.532
         ic  |      0.407      0.027    15.24   0.000        0.354       0.459
        irl  |      0.450      0.029    15.35   0.000        0.392       0.507
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,009
Model VCE    : Robust

Expression   : Pr(spk), predict()
dy/dx w.r.t. : 2.treat 3.treat partyid7

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.074      0.037    -1.99   0.046       -0.148      -0.001
        irl  |     -0.031      0.039    -0.80   0.422       -0.108       0.045
             |
    partyid7 |     -0.017      0.008    -2.10   0.036       -0.032      -0.001
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,009
Model VCE    : Robust

Expression   : Pr(spk), predict()
dy/dx w.r.t. : 1.treat 3.treat partyid7

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.074      0.037     1.99   0.046        0.001       0.148
        irl  |      0.043      0.040     1.08   0.279       -0.035       0.121
             |
    partyid7 |     -0.017      0.008    -2.10   0.036       -0.032      -0.001
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Iteration 0:   log pseudolikelihood = -1380.5082  
Iteration 1:   log pseudolikelihood =  -1371.398  
Iteration 2:   log pseudolikelihood =  -1371.393  
Iteration 3:   log pseudolikelihood =  -1371.393  

Logistic regression                             Number of obs     =      2,009
                                                Wald chi2(5)      =       9.89
                                                Prob > chi2       =     0.0783
Log pseudolikelihood =  -1371.393               Pseudo R2         =     0.0066

----------------------------------------------------------------------------------
                 |               Robust
             spk |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           treat |
             ic  |     -0.036      0.331    -0.11   0.914       -0.684       0.613
            irl  |      0.027      0.357     0.08   0.939       -0.673       0.727
                 |
        partyid7 |     -0.035      0.050    -0.71   0.479       -0.134       0.063
                 |
treat#c.partyid7 |
             ic  |     -0.070      0.076    -0.92   0.356       -0.218       0.078
            irl  |     -0.041      0.081    -0.50   0.615       -0.199       0.118
                 |
           _cons |      0.061      0.214     0.29   0.775       -0.359       0.481
----------------------------------------------------------------------------------

Predictive margins                              Number of obs     =      2,009
Model VCE    : Robust

Expression   : Pr(spk), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.481      0.026    18.49   0.000        0.430       0.532
         ic  |      0.407      0.027    15.26   0.000        0.355       0.460
        irl  |      0.450      0.029    15.38   0.000        0.392       0.507
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,009
Model VCE    : Robust

Expression   : Pr(spk), predict()
dy/dx w.r.t. : 2.treat 3.treat partyid7

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.074      0.037    -1.98   0.047       -0.147      -0.001
        irl  |     -0.032      0.039    -0.81   0.417       -0.108       0.045
             |
    partyid7 |     -0.017      0.008    -2.19   0.029       -0.033      -0.002
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,009
Model VCE    : Robust

Expression   : Pr(spk), predict()
dy/dx w.r.t. : 1.treat 3.treat partyid7

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.074      0.037     1.98   0.047        0.001       0.147
        irl  |      0.042      0.040     1.07   0.286       -0.035       0.120
             |
    partyid7 |     -0.017      0.008    -2.19   0.029       -0.033      -0.002
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Iteration 0:   log pseudolikelihood = -1380.5082  
Iteration 1:   log pseudolikelihood = -1372.1018  
Iteration 2:   log pseudolikelihood = -1372.0999  
Iteration 3:   log pseudolikelihood = -1372.0999  

Logistic regression                             Number of obs     =      2,009
                                                Wald chi2(4)      =       9.11
                                                Prob > chi2       =     0.0584
Log pseudolikelihood = -1372.0999               Pseudo R2         =     0.0061

------------------------------------------------------------------------------
             |               Robust
         spk |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.332      0.153    -2.17   0.030       -0.632      -0.032
        irl  |     -0.128      0.159    -0.80   0.421       -0.440       0.184
             |
    partyid3 |
          1  |     -0.119      0.155    -0.77   0.440       -0.422       0.184
          3  |     -0.333      0.156    -2.13   0.033       -0.639      -0.026
             |
       _cons |      0.066      0.137     0.48   0.633       -0.204       0.335
------------------------------------------------------------------------------

Predictive margins                              Number of obs     =      2,009
Model VCE    : Robust

Expression   : Pr(spk), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.484      0.026    18.55   0.000        0.432       0.535
         ic  |      0.402      0.027    15.12   0.000        0.350       0.454
        irl  |      0.452      0.030    15.31   0.000        0.394       0.510
             |
    partyid3 |
          1  |      0.450      0.028    16.01   0.000        0.395       0.505
          2  |      0.479      0.026    18.52   0.000        0.428       0.530
          3  |      0.398      0.028    14.32   0.000        0.343       0.452
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,009
Model VCE    : Robust

Expression   : Pr(spk), predict()
dy/dx w.r.t. : 2.treat 3.treat 1.partyid3 3.partyid3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.081      0.037    -2.18   0.029       -0.155      -0.008
        irl  |     -0.032      0.039    -0.81   0.421       -0.109       0.045
             |
    partyid3 |
          1  |     -0.030      0.038    -0.77   0.440       -0.104       0.045
          3  |     -0.081      0.038    -2.14   0.032       -0.156      -0.007
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,009
Model VCE    : Robust

Expression   : Pr(spk), predict()
dy/dx w.r.t. : 1.treat 3.treat 1.partyid3 3.partyid3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.081      0.037     2.18   0.029        0.008       0.155
        irl  |      0.050      0.040     1.25   0.210       -0.028       0.127
             |
    partyid3 |
          1  |     -0.030      0.038    -0.77   0.440       -0.104       0.045
          3  |     -0.081      0.038    -2.14   0.032       -0.156      -0.007
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Iteration 0:   log pseudolikelihood = -1380.5082  
Iteration 1:   log pseudolikelihood =   -1370.21  
Iteration 2:   log pseudolikelihood = -1370.1974  
Iteration 3:   log pseudolikelihood = -1370.1974  

Logistic regression                             Number of obs     =      2,009
                                                Wald chi2(8)      =      11.47
                                                Prob > chi2       =     0.1763
Log pseudolikelihood = -1370.1974               Pseudo R2         =     0.0075

--------------------------------------------------------------------------------
               |               Robust
           spk |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
         treat |
           ic  |     -0.310      0.250    -1.24   0.214       -0.799       0.179
          irl  |     -0.330      0.262    -1.26   0.207       -0.842       0.183
               |
      partyid3 |
            1  |     -0.245      0.248    -0.99   0.323       -0.732       0.241
            3  |     -0.346      0.267    -1.30   0.195       -0.869       0.177
               |
treat#partyid3 |
         ic#1  |      0.053      0.365     0.15   0.885       -0.662       0.768
         ic#3  |     -0.206      0.377    -0.55   0.584       -0.945       0.532
        irl#1  |      0.372      0.382     0.97   0.330       -0.376       1.120
        irl#3  |      0.245      0.385     0.63   0.525       -0.510       1.000
               |
         _cons |      0.115      0.183     0.63   0.529       -0.244       0.474
--------------------------------------------------------------------------------

Predictive margins                              Number of obs     =      2,009
Model VCE    : Robust

Expression   : Pr(spk), predict()

--------------------------------------------------------------------------------
               |            Delta-method
               |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
         treat |
           mc  |      0.484      0.026    18.53   0.000        0.433       0.536
           ic  |      0.400      0.026    15.11   0.000        0.348       0.452
          irl  |      0.450      0.029    15.36   0.000        0.393       0.508
               |
      partyid3 |
            1  |      0.450      0.028    16.00   0.000        0.395       0.505
            2  |      0.478      0.026    18.51   0.000        0.427       0.528
            3  |      0.396      0.028    14.40   0.000        0.342       0.450
               |
treat#partyid3 |
         mc#1  |      0.468      0.042    11.23   0.000        0.386       0.549
         mc#2  |      0.529      0.046    11.59   0.000        0.439       0.618
         mc#3  |      0.443      0.048     9.25   0.000        0.349       0.536
         ic#1  |      0.404      0.050     8.10   0.000        0.307       0.502
         ic#2  |      0.451      0.042    10.74   0.000        0.369       0.534
         ic#3  |      0.321      0.045     7.19   0.000        0.234       0.409
        irl#1  |      0.478      0.055     8.63   0.000        0.369       0.587
        irl#2  |      0.447      0.046     9.68   0.000        0.356       0.537
        irl#3  |      0.422      0.050     8.40   0.000        0.323       0.520
--------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,009
Model VCE    : Robust

Expression   : Pr(spk), predict()
dy/dx w.r.t. : 2.treat 3.treat 1.partyid3 3.partyid3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.085      0.037    -2.27   0.023       -0.157      -0.012
        irl  |     -0.034      0.039    -0.87   0.387       -0.111       0.043
             |
    partyid3 |
          1  |     -0.028      0.038    -0.73   0.464       -0.103       0.047
          3  |     -0.082      0.038    -2.17   0.030       -0.156      -0.008
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,009
Model VCE    : Robust

Expression   : Pr(spk), predict()
dy/dx w.r.t. : 1.treat 3.treat 1.partyid3 3.partyid3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.085      0.037     2.27   0.023        0.012       0.157
        irl  |      0.051      0.040     1.28   0.201       -0.027       0.128
             |
    partyid3 |
          1  |     -0.028      0.038    -0.73   0.464       -0.103       0.047
          3  |     -0.082      0.038    -2.17   0.030       -0.156      -0.008
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Iteration 0:   log pseudolikelihood = -1380.5082  
Iteration 1:   log pseudolikelihood = -1373.4221  
Iteration 2:   log pseudolikelihood =  -1373.421  
Iteration 3:   log pseudolikelihood =  -1373.421  

Logistic regression                             Number of obs     =      2,009
                                                Wald chi2(4)      =       7.52
                                                Prob > chi2       =     0.1107
Log pseudolikelihood =  -1373.421               Pseudo R2         =     0.0051

------------------------------------------------------------------------------
             |               Robust
         spk |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.307      0.153    -2.01   0.044       -0.607      -0.008
        irl  |     -0.125      0.159    -0.79   0.431       -0.436       0.186
             |
   partyid3l |
          1  |      0.021      0.183     0.11   0.910       -0.339       0.380
          3  |     -0.215      0.185    -1.16   0.244       -0.577       0.147
             |
       _cons |     -0.005      0.180    -0.03   0.980       -0.358       0.349
------------------------------------------------------------------------------

Predictive margins                              Number of obs     =      2,009
Model VCE    : Robust

Expression   : Pr(spk), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.481      0.026    18.41   0.000        0.430       0.533
         ic  |      0.406      0.027    15.26   0.000        0.354       0.458
        irl  |      0.450      0.029    15.31   0.000        0.393       0.508
             |
   partyid3l |
          1  |      0.469      0.024    19.34   0.000        0.422       0.517
          2  |      0.464      0.038    12.08   0.000        0.389       0.539
          3  |      0.411      0.024    16.94   0.000        0.364       0.459
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,009
Model VCE    : Robust

Expression   : Pr(spk), predict()
dy/dx w.r.t. : 2.treat 3.treat 1.partyid3l 3.partyid3l

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.075      0.037    -2.02   0.044       -0.149      -0.002
        irl  |     -0.031      0.039    -0.79   0.431       -0.108       0.046
             |
   partyid3l |
          1  |      0.005      0.045     0.11   0.910       -0.084       0.094
          3  |     -0.053      0.045    -1.16   0.246       -0.142       0.036
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,009
Model VCE    : Robust

Expression   : Pr(spk), predict()
dy/dx w.r.t. : 1.treat 3.treat 1.partyid3l 3.partyid3l

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.075      0.037     2.02   0.044        0.002       0.149
        irl  |      0.044      0.040     1.12   0.262       -0.033       0.122
             |
   partyid3l |
          1  |      0.005      0.045     0.11   0.910       -0.084       0.094
          3  |     -0.053      0.045    -1.16   0.246       -0.142       0.036
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Iteration 0:   log pseudolikelihood = -1380.5082  
Iteration 1:   log pseudolikelihood = -1370.5124  
Iteration 2:   log pseudolikelihood = -1370.4988  
Iteration 3:   log pseudolikelihood = -1370.4988  

Logistic regression                             Number of obs     =      2,009
                                                Wald chi2(8)      =      10.86
                                                Prob > chi2       =     0.2098
Log pseudolikelihood = -1370.4988               Pseudo R2         =     0.0073

---------------------------------------------------------------------------------
                |               Robust
            spk |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
          treat |
            ic  |     -0.132      0.371    -0.36   0.721       -0.859       0.594
           irl  |     -0.311      0.391    -0.79   0.427       -1.078       0.456
                |
      partyid3l |
             1  |     -0.049      0.314    -0.16   0.876       -0.665       0.567
             3  |     -0.094      0.325    -0.29   0.772       -0.731       0.543
                |
treat#partyid3l |
          ic#1  |     -0.028      0.436    -0.06   0.949       -0.881       0.826
          ic#3  |     -0.466      0.443    -1.05   0.293       -1.335       0.403
         irl#1  |      0.305      0.458     0.67   0.505       -0.593       1.204
         irl#3  |      0.134      0.463     0.29   0.772       -0.774       1.042
                |
          _cons |     -0.018      0.278    -0.06   0.949       -0.562       0.526
---------------------------------------------------------------------------------

Predictive margins                              Number of obs     =      2,009
Model VCE    : Robust

Expression   : Pr(spk), predict()

---------------------------------------------------------------------------------
                |            Delta-method
                |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
          treat |
            mc  |      0.482      0.026    18.40   0.000        0.430       0.533
            ic  |      0.405      0.026    15.34   0.000        0.353       0.457
           irl  |      0.449      0.029    15.35   0.000        0.392       0.507
                |
      partyid3l |
             1  |      0.470      0.024    19.37   0.000        0.422       0.517
             2  |      0.461      0.038    12.04   0.000        0.386       0.536
             3  |      0.411      0.024    17.05   0.000        0.364       0.459
                |
treat#partyid3l |
          mc#1  |      0.483      0.037    13.14   0.000        0.411       0.555
          mc#2  |      0.496      0.069     7.14   0.000        0.360       0.632
          mc#3  |      0.472      0.042    11.23   0.000        0.390       0.555
          ic#1  |      0.444      0.043    10.29   0.000        0.359       0.528
          ic#2  |      0.463      0.061     7.57   0.000        0.343       0.582
          ic#3  |      0.330      0.039     8.52   0.000        0.254       0.405
         irl#1  |      0.482      0.047    10.29   0.000        0.390       0.574
         irl#2  |      0.419      0.067     6.23   0.000        0.287       0.550
         irl#3  |      0.428      0.045     9.63   0.000        0.341       0.516
---------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,009
Model VCE    : Robust

Expression   : Pr(spk), predict()
dy/dx w.r.t. : 2.treat 3.treat 1.partyid3l 3.partyid3l

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.076      0.037    -2.06   0.040       -0.149      -0.004
        irl  |     -0.032      0.039    -0.82   0.412       -0.109       0.045
             |
   partyid3l |
          1  |      0.009      0.045     0.19   0.846       -0.080       0.098
          3  |     -0.050      0.045    -1.09   0.274       -0.138       0.039
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,009
Model VCE    : Robust

Expression   : Pr(spk), predict()
dy/dx w.r.t. : 1.treat 3.treat 1.partyid3l 3.partyid3l

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.076      0.037     2.06   0.040        0.004       0.149
        irl  |      0.044      0.039     1.12   0.262       -0.033       0.122
             |
   partyid3l |
          1  |      0.009      0.045     0.19   0.846       -0.080       0.098
          3  |     -0.050      0.045    -1.09   0.274       -0.138       0.039
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Iteration 0:   log pseudolikelihood = -1130.5407  
Iteration 1:   log pseudolikelihood = -1127.0235  
Iteration 2:   log pseudolikelihood = -1127.0183  
Iteration 3:   log pseudolikelihood = -1127.0183  

Logistic regression                             Number of obs     =      2,012
                                                Wald chi2(2)      =       3.59
                                                Prob > chi2       =     0.1665
Log pseudolikelihood = -1127.0183               Pseudo R2         =     0.0031

------------------------------------------------------------------------------
             |               Robust
         col |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.285      0.176    -1.62   0.105       -0.630       0.060
        irl  |     -0.278      0.172    -1.62   0.106       -0.615       0.059
             |
       _cons |     -0.924      0.118    -7.83   0.000       -1.155      -0.693
------------------------------------------------------------------------------

Adjusted predictions                            Number of obs     =      2,012
Model VCE    : Robust

Expression   : Pr(col), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.284      0.024    11.84   0.000        0.237       0.331
         ic  |      0.230      0.023     9.95   0.000        0.185       0.275
        irl  |      0.231      0.022    10.38   0.000        0.187       0.275
------------------------------------------------------------------------------

Conditional marginal effects                    Number of obs     =      2,012
Model VCE    : Robust

Expression   : Pr(col), predict()
dy/dx w.r.t. : 2.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.054      0.033    -1.63   0.103       -0.120       0.011
        irl  |     -0.053      0.033    -1.62   0.105       -0.117       0.011
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Conditional marginal effects                    Number of obs     =      2,012
Model VCE    : Robust

Expression   : Pr(col), predict()
dy/dx w.r.t. : 1.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.054      0.033     1.63   0.103       -0.011       0.120
        irl  |      0.001      0.032     0.04   0.969       -0.062       0.064
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Iteration 0:   log pseudolikelihood = -1122.4494  
Iteration 1:   log pseudolikelihood = -1107.3733  
Iteration 2:   log pseudolikelihood = -1107.2952  
Iteration 3:   log pseudolikelihood = -1107.2952  

Logistic regression                             Number of obs     =      2,005
                                                Wald chi2(3)      =      16.80
                                                Prob > chi2       =     0.0008
Log pseudolikelihood = -1107.2952               Pseudo R2         =     0.0135

------------------------------------------------------------------------------
             |               Robust
         col |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.269      0.177    -1.52   0.130       -0.616       0.079
        irl  |     -0.263      0.176    -1.49   0.136       -0.608       0.082
             |
    partyid7 |     -0.132      0.036    -3.70   0.000       -0.202      -0.062
       _cons |     -0.451      0.177    -2.55   0.011       -0.798      -0.104
------------------------------------------------------------------------------

Predictive margins                              Number of obs     =      2,005
Model VCE    : Robust

Expression   : Pr(col), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.280      0.024    11.88   0.000        0.234       0.326
         ic  |      0.230      0.023     9.95   0.000        0.184       0.275
        irl  |      0.231      0.023    10.10   0.000        0.186       0.276
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,005
Model VCE    : Robust

Expression   : Pr(col), predict()
dy/dx w.r.t. : 2.treat 3.treat partyid7

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.050      0.033    -1.52   0.128       -0.115       0.014
        irl  |     -0.049      0.033    -1.50   0.134       -0.114       0.015
             |
    partyid7 |     -0.024      0.007    -3.73   0.000       -0.037      -0.012
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,005
Model VCE    : Robust

Expression   : Pr(col), predict()
dy/dx w.r.t. : 1.treat 3.treat partyid7

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.050      0.033     1.52   0.128       -0.014       0.115
        irl  |      0.001      0.033     0.03   0.974       -0.063       0.065
             |
    partyid7 |     -0.024      0.007    -3.73   0.000       -0.037      -0.012
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Iteration 0:   log pseudolikelihood = -1122.4494  
Iteration 1:   log pseudolikelihood = -1105.2356  
Iteration 2:   log pseudolikelihood = -1105.0478  
Iteration 3:   log pseudolikelihood = -1105.0477  

Logistic regression                             Number of obs     =      2,005
                                                Wald chi2(5)      =      20.66
                                                Prob > chi2       =     0.0009
Log pseudolikelihood = -1105.0477               Pseudo R2         =     0.0155

----------------------------------------------------------------------------------
                 |               Robust
             col |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           treat |
             ic  |     -0.524      0.359    -1.46   0.144       -1.228       0.179
            irl  |     -0.749      0.358    -2.09   0.036       -1.452      -0.047
                 |
        partyid7 |     -0.195      0.058    -3.38   0.001       -0.308      -0.082
                 |
treat#c.partyid7 |
             ic  |      0.072      0.084     0.85   0.393       -0.093       0.237
            irl  |      0.136      0.087     1.57   0.117       -0.034       0.307
                 |
           _cons |     -0.229      0.232    -0.99   0.322       -0.684       0.225
----------------------------------------------------------------------------------

Predictive margins                              Number of obs     =      2,005
Model VCE    : Robust

Expression   : Pr(col), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.279      0.024    11.89   0.000        0.233       0.326
         ic  |      0.230      0.023     9.90   0.000        0.184       0.275
        irl  |      0.231      0.023    10.28   0.000        0.187       0.276
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,005
Model VCE    : Robust

Expression   : Pr(col), predict()
dy/dx w.r.t. : 2.treat 3.treat partyid7

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.050      0.033    -1.51   0.130       -0.115       0.015
        irl  |     -0.048      0.033    -1.48   0.140       -0.112       0.016
             |
    partyid7 |     -0.024      0.006    -3.77   0.000       -0.037      -0.012
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,005
Model VCE    : Robust

Expression   : Pr(col), predict()
dy/dx w.r.t. : 1.treat 3.treat partyid7

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.050      0.033     1.51   0.130       -0.015       0.115
        irl  |      0.002      0.032     0.06   0.953       -0.061       0.065
             |
    partyid7 |     -0.024      0.006    -3.77   0.000       -0.037      -0.012
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Iteration 0:   log pseudolikelihood = -1122.4494  
Iteration 1:   log pseudolikelihood = -1105.9046  
Iteration 2:   log pseudolikelihood = -1105.7287  
Iteration 3:   log pseudolikelihood = -1105.7286  

Logistic regression                             Number of obs     =      2,005
                                                Wald chi2(4)      =      16.83
                                                Prob > chi2       =     0.0021
Log pseudolikelihood = -1105.7286               Pseudo R2         =     0.0149

------------------------------------------------------------------------------
             |               Robust
         col |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.317      0.178    -1.79   0.074       -0.666       0.031
        irl  |     -0.261      0.176    -1.48   0.138       -0.606       0.084
             |
    partyid3 |
          1  |     -0.061      0.167    -0.36   0.717       -0.388       0.267
          3  |     -0.666      0.190    -3.51   0.000       -1.038      -0.294
             |
       _cons |     -0.744      0.148    -5.01   0.000       -1.035      -0.453
------------------------------------------------------------------------------

Predictive margins                              Number of obs     =      2,005
Model VCE    : Robust

Expression   : Pr(col), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.283      0.024    11.85   0.000        0.236       0.330
         ic  |      0.224      0.023     9.90   0.000        0.180       0.268
        irl  |      0.234      0.023    10.26   0.000        0.189       0.278
             |
    partyid3 |
          1  |      0.272      0.025    11.08   0.000        0.224       0.320
          2  |      0.284      0.022    12.64   0.000        0.240       0.328
          3  |      0.170      0.022     7.83   0.000        0.127       0.212
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,005
Model VCE    : Robust

Expression   : Pr(col), predict()
dy/dx w.r.t. : 2.treat 3.treat 1.partyid3 3.partyid3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.059      0.033    -1.80   0.073       -0.124       0.005
        irl  |     -0.049      0.033    -1.49   0.136       -0.114       0.015
             |
    partyid3 |
          1  |     -0.012      0.033    -0.36   0.717       -0.077       0.053
          3  |     -0.114      0.031    -3.67   0.000       -0.175      -0.053
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,005
Model VCE    : Robust

Expression   : Pr(col), predict()
dy/dx w.r.t. : 1.treat 3.treat 1.partyid3 3.partyid3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.059      0.033     1.80   0.073       -0.005       0.124
        irl  |      0.010      0.032     0.31   0.760       -0.053       0.073
             |
    partyid3 |
          1  |     -0.012      0.033    -0.36   0.717       -0.077       0.053
          3  |     -0.114      0.031    -3.67   0.000       -0.175      -0.053
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Iteration 0:   log pseudolikelihood = -1122.4494  
Iteration 1:   log pseudolikelihood = -1103.0831  
Iteration 2:   log pseudolikelihood = -1102.7909  
Iteration 3:   log pseudolikelihood = -1102.7906  
Iteration 4:   log pseudolikelihood = -1102.7906  

Logistic regression                             Number of obs     =      2,005
                                                Wald chi2(8)      =      20.60
                                                Prob > chi2       =     0.0083
Log pseudolikelihood = -1102.7906               Pseudo R2         =     0.0175

--------------------------------------------------------------------------------
               |               Robust
           col |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
         treat |
           ic  |     -0.216      0.266    -0.81   0.416       -0.738       0.305
          irl  |     -0.328      0.274    -1.20   0.231       -0.865       0.209
               |
      partyid3 |
            1  |      0.088      0.268     0.33   0.743       -0.437       0.613
            3  |     -0.845      0.333    -2.53   0.011       -1.498      -0.191
               |
treat#partyid3 |
         ic#1  |     -0.324      0.413    -0.78   0.433       -1.134       0.486
         ic#3  |      0.031      0.463     0.07   0.947       -0.877       0.939
        irl#1  |     -0.157      0.396    -0.40   0.691       -0.933       0.618
        irl#3  |      0.551      0.463     1.19   0.234       -0.357       1.459
               |
         _cons |     -0.763      0.190    -4.02   0.000       -1.135      -0.391
--------------------------------------------------------------------------------

Predictive margins                              Number of obs     =      2,005
Model VCE    : Robust

Expression   : Pr(col), predict()

--------------------------------------------------------------------------------
               |            Delta-method
               |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
         treat |
           mc  |      0.283      0.024    11.88   0.000        0.236       0.329
           ic  |      0.222      0.023     9.82   0.000        0.178       0.266
          irl  |      0.233      0.022    10.37   0.000        0.189       0.277
               |
      partyid3 |
            1  |      0.271      0.024    11.09   0.000        0.223       0.319
            2  |      0.282      0.022    12.62   0.000        0.239       0.326
            3  |      0.169      0.021     7.90   0.000        0.127       0.211
               |
treat#partyid3 |
         mc#1  |      0.337      0.042     7.99   0.000        0.255       0.420
         mc#2  |      0.318      0.041     7.73   0.000        0.237       0.399
         mc#3  |      0.167      0.038     4.38   0.000        0.092       0.242
         ic#1  |      0.229      0.045     5.11   0.000        0.141       0.316
         ic#2  |      0.273      0.037     7.38   0.000        0.200       0.345
         ic#3  |      0.143      0.032     4.45   0.000        0.080       0.205
        irl#1  |      0.238      0.039     6.12   0.000        0.162       0.315
        irl#2  |      0.251      0.037     6.77   0.000        0.179       0.324
        irl#3  |      0.200      0.041     4.93   0.000        0.121       0.280
--------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,005
Model VCE    : Robust

Expression   : Pr(col), predict()
dy/dx w.r.t. : 2.treat 3.treat 1.partyid3 3.partyid3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.061      0.033    -1.85   0.065       -0.125       0.004
        irl  |     -0.050      0.033    -1.52   0.127       -0.114       0.014
             |
    partyid3 |
          1  |     -0.012      0.033    -0.35   0.723       -0.077       0.053
          3  |     -0.113      0.031    -3.66   0.000       -0.174      -0.053
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,005
Model VCE    : Robust

Expression   : Pr(col), predict()
dy/dx w.r.t. : 1.treat 3.treat 1.partyid3 3.partyid3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.061      0.033     1.85   0.065       -0.004       0.125
        irl  |      0.011      0.032     0.34   0.735       -0.052       0.073
             |
    partyid3 |
          1  |     -0.012      0.033    -0.35   0.723       -0.077       0.053
          3  |     -0.113      0.031    -3.66   0.000       -0.174      -0.053
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Iteration 0:   log pseudolikelihood = -1122.4494  
Iteration 1:   log pseudolikelihood =  -1104.913  
Iteration 2:   log pseudolikelihood = -1104.7729  
Iteration 3:   log pseudolikelihood = -1104.7729  

Logistic regression                             Number of obs     =      2,005
                                                Wald chi2(4)      =      17.53
                                                Prob > chi2       =     0.0015
Log pseudolikelihood = -1104.7729               Pseudo R2         =     0.0157

------------------------------------------------------------------------------
             |               Robust
         col |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.288      0.177    -1.62   0.104       -0.635       0.060
        irl  |     -0.260      0.177    -1.47   0.142       -0.607       0.087
             |
   partyid3l |
          1  |     -0.106      0.193    -0.55   0.584       -0.485       0.273
          3  |     -0.664      0.208    -3.19   0.001       -1.073      -0.256
             |
       _cons |     -0.667      0.191    -3.50   0.000       -1.041      -0.293
------------------------------------------------------------------------------

Predictive margins                              Number of obs     =      2,005
Model VCE    : Robust

Expression   : Pr(col), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.281      0.024    11.79   0.000        0.234       0.328
         ic  |      0.227      0.023    10.04   0.000        0.183       0.272
        irl  |      0.232      0.023    10.16   0.000        0.187       0.277
             |
   partyid3l |
          1  |      0.280      0.021    13.34   0.000        0.239       0.321
          2  |      0.302      0.034     8.83   0.000        0.235       0.369
          3  |      0.182      0.019     9.38   0.000        0.144       0.220
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,005
Model VCE    : Robust

Expression   : Pr(col), predict()
dy/dx w.r.t. : 2.treat 3.treat 1.partyid3l 3.partyid3l

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.054      0.033    -1.63   0.103       -0.118       0.011
        irl  |     -0.049      0.033    -1.48   0.140       -0.113       0.016
             |
   partyid3l |
          1  |     -0.022      0.040    -0.54   0.587       -0.100       0.057
          3  |     -0.119      0.039    -3.04   0.002       -0.196      -0.043
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,005
Model VCE    : Robust

Expression   : Pr(col), predict()
dy/dx w.r.t. : 1.treat 3.treat 1.partyid3l 3.partyid3l

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.054      0.033     1.63   0.103       -0.011       0.118
        irl  |      0.005      0.032     0.15   0.880       -0.058       0.068
             |
   partyid3l |
          1  |     -0.022      0.040    -0.54   0.587       -0.100       0.057
          3  |     -0.119      0.039    -3.04   0.002       -0.196      -0.043
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Iteration 0:   log pseudolikelihood = -1122.4494  
Iteration 1:   log pseudolikelihood = -1100.0291  
Iteration 2:   log pseudolikelihood = -1099.7048  
Iteration 3:   log pseudolikelihood = -1099.7046  
Iteration 4:   log pseudolikelihood = -1099.7046  

Logistic regression                             Number of obs     =      2,005
                                                Wald chi2(8)      =      23.18
                                                Prob > chi2       =     0.0031
Log pseudolikelihood = -1099.7046               Pseudo R2         =     0.0203

---------------------------------------------------------------------------------
                |               Robust
            col |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
          treat |
            ic  |     -0.140      0.386    -0.36   0.717       -0.897       0.617
           irl  |     -0.625      0.401    -1.56   0.119       -1.412       0.162
                |
      partyid3l |
             1  |     -0.051      0.321    -0.16   0.874       -0.680       0.578
             3  |     -0.888      0.362    -2.45   0.014       -1.597      -0.179
                |
treat#partyid3l |
          ic#1  |     -0.284      0.465    -0.61   0.541       -1.195       0.627
          ic#3  |     -0.078      0.503    -0.15   0.877       -1.064       0.909
         irl#1  |      0.187      0.470     0.40   0.691       -0.734       1.109
         irl#3  |      0.872      0.513     1.70   0.089       -0.134       1.879
                |
          _cons |     -0.629      0.276    -2.28   0.023       -1.169      -0.088
---------------------------------------------------------------------------------

Predictive margins                              Number of obs     =      2,005
Model VCE    : Robust

Expression   : Pr(col), predict()

---------------------------------------------------------------------------------
                |            Delta-method
                |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
          treat |
            mc  |      0.281      0.024    11.77   0.000        0.234       0.328
            ic  |      0.226      0.022    10.07   0.000        0.182       0.270
           irl  |      0.232      0.022    10.32   0.000        0.188       0.276
                |
      partyid3l |
             1  |      0.280      0.021    13.40   0.000        0.239       0.321
             2  |      0.299      0.034     8.91   0.000        0.233       0.364
             3  |      0.182      0.019     9.40   0.000        0.144       0.220
                |
treat#partyid3l |
          mc#1  |      0.336      0.037     9.16   0.000        0.264       0.408
          mc#2  |      0.348      0.063     5.56   0.000        0.225       0.470
          mc#3  |      0.180      0.035     5.21   0.000        0.112       0.248
          ic#1  |      0.249      0.037     6.68   0.000        0.176       0.322
          ic#2  |      0.317      0.059     5.41   0.000        0.202       0.431
          ic#3  |      0.150      0.028     5.30   0.000        0.095       0.206
         irl#1  |      0.246      0.034     7.31   0.000        0.180       0.313
         irl#2  |      0.222      0.050     4.41   0.000        0.123       0.321
         irl#3  |      0.219      0.037     5.87   0.000        0.146       0.293
---------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,005
Model VCE    : Robust

Expression   : Pr(col), predict()
dy/dx w.r.t. : 2.treat 3.treat 1.partyid3l 3.partyid3l

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.055      0.033    -1.67   0.095       -0.119       0.009
        irl  |     -0.049      0.033    -1.50   0.133       -0.113       0.015
             |
   partyid3l |
          1  |     -0.019      0.040    -0.48   0.629       -0.097       0.058
          3  |     -0.117      0.039    -3.01   0.003       -0.192      -0.041
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,005
Model VCE    : Robust

Expression   : Pr(col), predict()
dy/dx w.r.t. : 1.treat 3.treat 1.partyid3l 3.partyid3l

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.055      0.033     1.67   0.095       -0.009       0.119
        irl  |      0.006      0.032     0.17   0.861       -0.057       0.068
             |
   partyid3l |
          1  |     -0.019      0.040    -0.48   0.629       -0.097       0.058
          3  |     -0.117      0.039    -3.01   0.003       -0.192      -0.041
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Iteration 0:   log pseudolikelihood = -1391.4433  
Iteration 1:   log pseudolikelihood = -1387.2689  
Iteration 2:   log pseudolikelihood = -1387.2688  

Logistic regression                             Number of obs     =      2,009
                                                Wald chi2(2)      =       3.97
                                                Prob > chi2       =     0.1373
Log pseudolikelihood = -1387.2688               Pseudo R2         =     0.0030

------------------------------------------------------------------------------
             |               Robust
         lib |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.152      0.152    -1.00   0.315       -0.450       0.145
        irl  |      0.171      0.159     1.08   0.281       -0.140       0.482
             |
       _cons |      0.100      0.104     0.95   0.340       -0.105       0.304
------------------------------------------------------------------------------

Adjusted predictions                            Number of obs     =      2,009
Model VCE    : Robust

Expression   : Pr(lib), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.525      0.026    20.15   0.000        0.474       0.576
         ic  |      0.487      0.027    17.73   0.000        0.433       0.541
        irl  |      0.567      0.029    19.35   0.000        0.510       0.625
------------------------------------------------------------------------------

Conditional marginal effects                    Number of obs     =      2,009
Model VCE    : Robust

Expression   : Pr(lib), predict()
dy/dx w.r.t. : 2.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.038      0.038    -1.01   0.315       -0.112       0.036
        irl  |      0.042      0.039     1.08   0.280       -0.034       0.119
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Conditional marginal effects                    Number of obs     =      2,009
Model VCE    : Robust

Expression   : Pr(lib), predict()
dy/dx w.r.t. : 1.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.038      0.038     1.01   0.315       -0.036       0.112
        irl  |      0.080      0.040     2.00   0.045        0.002       0.159
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Iteration 0:   log pseudolikelihood = -1385.7829  
Iteration 1:   log pseudolikelihood = -1363.2574  
Iteration 2:   log pseudolikelihood = -1363.2503  
Iteration 3:   log pseudolikelihood = -1363.2503  

Logistic regression                             Number of obs     =      2,002
                                                Wald chi2(3)      =      23.00
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -1363.2503               Pseudo R2         =     0.0163

------------------------------------------------------------------------------
             |               Robust
         lib |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.156      0.155    -1.01   0.314       -0.460       0.148
        irl  |      0.170      0.157     1.08   0.279       -0.138       0.479
             |
    partyid7 |     -0.140      0.032    -4.32   0.000       -0.204      -0.077
       _cons |      0.647      0.163     3.96   0.000        0.327       0.967
------------------------------------------------------------------------------

Predictive margins                              Number of obs     =      2,002
Model VCE    : Robust

Expression   : Pr(lib), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.526      0.026    20.17   0.000        0.475       0.578
         ic  |      0.488      0.028    17.68   0.000        0.434       0.542
        irl  |      0.568      0.028    20.36   0.000        0.513       0.623
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,002
Model VCE    : Robust

Expression   : Pr(lib), predict()
dy/dx w.r.t. : 2.treat 3.treat partyid7

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.038      0.038    -1.01   0.314       -0.113       0.036
        irl  |      0.041      0.038     1.09   0.278       -0.033       0.116
             |
    partyid7 |     -0.034      0.008    -4.48   0.000       -0.049      -0.019
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,002
Model VCE    : Robust

Expression   : Pr(lib), predict()
dy/dx w.r.t. : 1.treat 3.treat partyid7

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.038      0.038     1.01   0.314       -0.036       0.113
        irl  |      0.080      0.039     2.03   0.042        0.003       0.157
             |
    partyid7 |     -0.034      0.008    -4.48   0.000       -0.049      -0.019
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Iteration 0:   log pseudolikelihood = -1385.7829  
Iteration 1:   log pseudolikelihood = -1358.7639  
Iteration 2:   log pseudolikelihood = -1358.7141  
Iteration 3:   log pseudolikelihood = -1358.7141  

Logistic regression                             Number of obs     =      2,002
                                                Wald chi2(5)      =      27.89
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -1358.7141               Pseudo R2         =     0.0195

----------------------------------------------------------------------------------
                 |               Robust
             lib |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           treat |
             ic  |     -0.329      0.340    -0.97   0.333       -0.995       0.337
            irl  |      0.675      0.339     1.99   0.047        0.010       1.341
                 |
        partyid7 |     -0.112      0.052    -2.17   0.030       -0.214      -0.011
                 |
treat#c.partyid7 |
             ic  |      0.044      0.078     0.56   0.573       -0.108       0.196
            irl  |     -0.130      0.077    -1.68   0.093       -0.281       0.021
                 |
           _cons |      0.540      0.223     2.42   0.015        0.103       0.977
----------------------------------------------------------------------------------

Predictive margins                              Number of obs     =      2,002
Model VCE    : Robust

Expression   : Pr(lib), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.527      0.026    20.20   0.000        0.476       0.578
         ic  |      0.487      0.028    17.65   0.000        0.433       0.541
        irl  |      0.567      0.027    20.80   0.000        0.514       0.621
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,002
Model VCE    : Robust

Expression   : Pr(lib), predict()
dy/dx w.r.t. : 2.treat 3.treat partyid7

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.040      0.038    -1.05   0.295       -0.114       0.035
        irl  |      0.041      0.038     1.07   0.283       -0.033       0.114
             |
    partyid7 |     -0.033      0.007    -4.41   0.000       -0.048      -0.018
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,002
Model VCE    : Robust

Expression   : Pr(lib), predict()
dy/dx w.r.t. : 1.treat 3.treat partyid7

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.040      0.038     1.05   0.295       -0.035       0.114
        irl  |      0.080      0.039     2.07   0.039        0.004       0.156
             |
    partyid7 |     -0.033      0.007    -4.41   0.000       -0.048      -0.018
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Iteration 0:   log pseudolikelihood = -1385.7829  
Iteration 1:   log pseudolikelihood = -1369.6218  
Iteration 2:   log pseudolikelihood = -1369.6194  
Iteration 3:   log pseudolikelihood = -1369.6194  

Logistic regression                             Number of obs     =      2,002
                                                Wald chi2(4)      =      16.49
                                                Prob > chi2       =     0.0024
Log pseudolikelihood = -1369.6194               Pseudo R2         =     0.0117

------------------------------------------------------------------------------
             |               Robust
         lib |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.175      0.155    -1.13   0.259       -0.478       0.129
        irl  |      0.174      0.158     1.10   0.272       -0.136       0.484
             |
    partyid3 |
          1  |      0.186      0.155     1.20   0.230       -0.118       0.489
          3  |     -0.367      0.158    -2.32   0.020       -0.677      -0.057
             |
       _cons |      0.150      0.139     1.08   0.280       -0.123       0.423
------------------------------------------------------------------------------

Predictive margins                              Number of obs     =      2,002
Model VCE    : Robust

Expression   : Pr(lib), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.528      0.026    20.19   0.000        0.476       0.579
         ic  |      0.485      0.028    17.49   0.000        0.430       0.539
        irl  |      0.570      0.028    20.02   0.000        0.514       0.626
             |
    partyid3 |
          1  |      0.582      0.027    21.51   0.000        0.529       0.635
          2  |      0.536      0.026    20.30   0.000        0.484       0.588
          3  |      0.445      0.029    15.54   0.000        0.389       0.501
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,002
Model VCE    : Robust

Expression   : Pr(lib), predict()
dy/dx w.r.t. : 2.treat 3.treat 1.partyid3 3.partyid3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.043      0.038    -1.13   0.258       -0.118       0.032
        irl  |      0.042      0.039     1.10   0.271       -0.033       0.118
             |
    partyid3 |
          1  |      0.046      0.038     1.20   0.230       -0.029       0.120
          3  |     -0.091      0.039    -2.34   0.019       -0.168      -0.015
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,002
Model VCE    : Robust

Expression   : Pr(lib), predict()
dy/dx w.r.t. : 1.treat 3.treat 1.partyid3 3.partyid3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.043      0.038     1.13   0.258       -0.032       0.118
        irl  |      0.086      0.040     2.15   0.031        0.008       0.164
             |
    partyid3 |
          1  |      0.046      0.038     1.20   0.230       -0.029       0.120
          3  |     -0.091      0.039    -2.34   0.019       -0.168      -0.015
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Iteration 0:   log pseudolikelihood = -1385.7829  
Iteration 1:   log pseudolikelihood = -1364.2463  
Iteration 2:   log pseudolikelihood = -1364.2143  
Iteration 3:   log pseudolikelihood = -1364.2143  

Logistic regression                             Number of obs     =      2,002
                                                Wald chi2(8)      =      21.09
                                                Prob > chi2       =     0.0069
Log pseudolikelihood = -1364.2143               Pseudo R2         =     0.0156

--------------------------------------------------------------------------------
               |               Robust
           lib |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
         treat |
           ic  |     -0.307      0.253    -1.21   0.226       -0.804       0.190
          irl  |     -0.029      0.272    -0.11   0.916       -0.562       0.505
               |
      partyid3 |
            1  |     -0.016      0.253    -0.06   0.950       -0.512       0.480
            3  |     -0.494      0.271    -1.83   0.068       -1.024       0.036
               |
treat#partyid3 |
         ic#1  |      0.067      0.367     0.18   0.856       -0.653       0.786
         ic#3  |      0.389      0.378     1.03   0.303       -0.352       1.130
        irl#1  |      0.578      0.383     1.51   0.131       -0.173       1.328
        irl#3  |      0.027      0.391     0.07   0.944       -0.739       0.793
               |
         _cons |      0.260      0.188     1.38   0.167       -0.109       0.629
--------------------------------------------------------------------------------

Predictive margins                              Number of obs     =      2,002
Model VCE    : Robust

Expression   : Pr(lib), predict()

--------------------------------------------------------------------------------
               |            Delta-method
               |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
         treat |
           mc  |      0.529      0.026    20.11   0.000        0.478       0.581
           ic  |      0.485      0.028    17.63   0.000        0.431       0.539
          irl  |      0.570      0.028    20.52   0.000        0.515       0.624
               |
      partyid3 |
            1  |      0.580      0.027    21.88   0.000        0.528       0.632
            2  |      0.537      0.026    20.31   0.000        0.485       0.589
            3  |      0.448      0.028    15.74   0.000        0.393       0.504
               |
treat#partyid3 |
         mc#1  |      0.561      0.042    13.43   0.000        0.479       0.643
         mc#2  |      0.565      0.046    12.21   0.000        0.474       0.655
         mc#3  |      0.442      0.048     9.22   0.000        0.348       0.536
         ic#1  |      0.501      0.051     9.81   0.000        0.401       0.601
         ic#2  |      0.488      0.042    11.51   0.000        0.405       0.571
         ic#3  |      0.462      0.050     9.20   0.000        0.364       0.561
        irl#1  |      0.688      0.045    15.35   0.000        0.601       0.776
        irl#2  |      0.558      0.049    11.49   0.000        0.462       0.653
        irl#3  |      0.441      0.050     8.85   0.000        0.344       0.539
--------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,002
Model VCE    : Robust

Expression   : Pr(lib), predict()
dy/dx w.r.t. : 2.treat 3.treat 1.partyid3 3.partyid3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.044      0.038    -1.16   0.247       -0.119       0.031
        irl  |      0.040      0.038     1.05   0.293       -0.035       0.115
             |
    partyid3 |
          1  |      0.043      0.037     1.16   0.248       -0.030       0.117
          3  |     -0.089      0.039    -2.28   0.022       -0.165      -0.013
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,002
Model VCE    : Robust

Expression   : Pr(lib), predict()
dy/dx w.r.t. : 1.treat 3.treat 1.partyid3 3.partyid3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.044      0.038     1.16   0.247       -0.031       0.119
        irl  |      0.084      0.039     2.16   0.031        0.008       0.161
             |
    partyid3 |
          1  |      0.043      0.037     1.16   0.248       -0.030       0.117
          3  |     -0.089      0.039    -2.28   0.022       -0.165      -0.013
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Iteration 0:   log pseudolikelihood = -1385.7829  
Iteration 1:   log pseudolikelihood = -1363.9404  
Iteration 2:   log pseudolikelihood = -1363.9345  
Iteration 3:   log pseudolikelihood = -1363.9345  

Logistic regression                             Number of obs     =      2,002
                                                Wald chi2(4)      =      22.27
                                                Prob > chi2       =     0.0002
Log pseudolikelihood = -1363.9345               Pseudo R2         =     0.0158

------------------------------------------------------------------------------
             |               Robust
         lib |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.148      0.155    -0.95   0.340       -0.451       0.156
        irl  |      0.175      0.157     1.11   0.267       -0.134       0.483
             |
   partyid3l |
          1  |      0.433      0.184     2.35   0.019        0.071       0.794
          3  |     -0.145      0.186    -0.78   0.436       -0.509       0.220
             |
       _cons |     -0.028      0.182    -0.16   0.876       -0.384       0.328
------------------------------------------------------------------------------

Predictive margins                              Number of obs     =      2,002
Model VCE    : Robust

Expression   : Pr(lib), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.525      0.026    20.26   0.000        0.475       0.576
         ic  |      0.489      0.028    17.71   0.000        0.435       0.543
        irl  |      0.568      0.028    20.18   0.000        0.513       0.623
             |
   partyid3l |
          1  |      0.601      0.023    25.76   0.000        0.555       0.646
          2  |      0.494      0.039    12.71   0.000        0.418       0.570
          3  |      0.458      0.025    18.35   0.000        0.409       0.507
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,002
Model VCE    : Robust

Expression   : Pr(lib), predict()
dy/dx w.r.t. : 2.treat 3.treat 1.partyid3l 3.partyid3l

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.036      0.038    -0.95   0.340       -0.111       0.038
        irl  |      0.042      0.038     1.11   0.266       -0.032       0.117
             |
   partyid3l |
          1  |      0.106      0.045     2.34   0.019        0.017       0.195
          3  |     -0.036      0.046    -0.78   0.436       -0.127       0.055
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,002
Model VCE    : Robust

Expression   : Pr(lib), predict()
dy/dx w.r.t. : 1.treat 3.treat 1.partyid3l 3.partyid3l

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.036      0.038     0.95   0.340       -0.038       0.111
        irl  |      0.079      0.039     2.00   0.046        0.001       0.156
             |
   partyid3l |
          1  |      0.106      0.045     2.34   0.019        0.017       0.195
          3  |     -0.036      0.046    -0.78   0.436       -0.127       0.055
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Iteration 0:   log pseudolikelihood = -1385.7829  
Iteration 1:   log pseudolikelihood = -1361.5715  
Iteration 2:   log pseudolikelihood = -1361.5463  
Iteration 3:   log pseudolikelihood = -1361.5463  

Logistic regression                             Number of obs     =      2,002
                                                Wald chi2(8)      =      24.28
                                                Prob > chi2       =     0.0021
Log pseudolikelihood = -1361.5463               Pseudo R2         =     0.0175

---------------------------------------------------------------------------------
                |               Robust
            lib |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
          treat |
            ic  |     -0.094      0.372    -0.25   0.801       -0.823       0.635
           irl  |      0.189      0.401     0.47   0.638       -0.598       0.976
                |
      partyid3l |
             1  |      0.452      0.317     1.42   0.155       -0.170       1.074
             3  |     -0.101      0.327    -0.31   0.757       -0.742       0.540
                |
treat#partyid3l |
          ic#1  |     -0.179      0.438    -0.41   0.682       -1.039       0.680
          ic#3  |      0.050      0.444     0.11   0.910       -0.820       0.920
         irl#1  |      0.138      0.466     0.30   0.768       -0.775       1.050
         irl#3  |     -0.186      0.471    -0.39   0.693       -1.110       0.738
                |
          _cons |     -0.053      0.280    -0.19   0.850       -0.601       0.495
---------------------------------------------------------------------------------

Predictive margins                              Number of obs     =      2,002
Model VCE    : Robust

Expression   : Pr(lib), predict()

---------------------------------------------------------------------------------
                |            Delta-method
                |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
          treat |
            mc  |      0.525      0.026    20.16   0.000        0.474       0.576
            ic  |      0.488      0.028    17.72   0.000        0.434       0.542
           irl  |      0.568      0.028    20.39   0.000        0.513       0.622
                |
      partyid3l |
             1  |      0.599      0.023    25.94   0.000        0.554       0.645
             2  |      0.494      0.039    12.62   0.000        0.417       0.570
             3  |      0.458      0.025    18.39   0.000        0.409       0.507
                |
treat#partyid3l |
          mc#1  |      0.598      0.036    16.59   0.000        0.528       0.669
          mc#2  |      0.487      0.070     6.97   0.000        0.350       0.624
          mc#3  |      0.462      0.042    10.96   0.000        0.379       0.544
          ic#1  |      0.531      0.044    12.06   0.000        0.445       0.618
          ic#2  |      0.463      0.061     7.59   0.000        0.344       0.583
          ic#3  |      0.451      0.043    10.54   0.000        0.367       0.535
         irl#1  |      0.674      0.040    16.85   0.000        0.595       0.752
         irl#2  |      0.534      0.072     7.45   0.000        0.394       0.674
         irl#3  |      0.462      0.045    10.34   0.000        0.375       0.550
---------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,002
Model VCE    : Robust

Expression   : Pr(lib), predict()
dy/dx w.r.t. : 2.treat 3.treat 1.partyid3l 3.partyid3l

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.037      0.038    -0.99   0.323       -0.112       0.037
        irl  |      0.042      0.038     1.11   0.269       -0.033       0.117
             |
   partyid3l |
          1  |      0.106      0.045     2.33   0.020        0.017       0.195
          3  |     -0.035      0.046    -0.76   0.446       -0.126       0.056
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,002
Model VCE    : Robust

Expression   : Pr(lib), predict()
dy/dx w.r.t. : 1.treat 3.treat 1.partyid3l 3.partyid3l

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.037      0.038     0.99   0.323       -0.037       0.112
        irl  |      0.080      0.039     2.03   0.042        0.003       0.156
             |
   partyid3l |
          1  |      0.106      0.045     2.33   0.020        0.017       0.195
          3  |     -0.035      0.046    -0.76   0.446       -0.126       0.056
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

. 
. outreg2 [*] ///
>   using docs/logit-margins-without-covariates.xls, ///
>   noaster stats(coef se ci pval) bdec(1) sdec(1) cdec(3)  ///
>   stnum(replace coef=coef*100, replace se=se*100) ///
>   paren(se) bracket(ci) ///
>   excel replace
docs/logit-margins-without-covariates.xls
dir : seeout

. 
. outreg2 [*] ///
>   using docs/logit-margins-without-covariates-wide.xls, ///
>   noaster stats(coef se ci pval) bdec(1) sdec(1) cdec(3)  ///
>   stnum(replace coef=coef*100, replace se=se*100) ///
>   paren(se) bracket(ci) ///
>   sideway excel replace
docs/logit-margins-without-covariates-wide.xls
dir : seeout

. 
. log close
      name:  <unnamed>
       log:  /Users/smorgan/Documents/GitHub/tess-civil-liberties/log/analyze-experimental-results-without-covariates.lo
> g
  log type:  text
 closed on:  12 Mar 2019, 14:45:22
------------------------------------------------------------------------------------------------------------------------
