-------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/stephenmorgan/GitHub/tess-civil-liberties/log/analyze-experimental-results-with-covariates.log
  log type:  text
 opened on:  16 Mar 2019, 14:46:42

. 
. use data/tess-civ-lib.dta

. 
. ********************************************************************************
. *** Set up for analysis
. ********************************************************************************
. 
. *** Set macros
. 
. local domain spk col lib 

. 
. #delimit ;
delimiter now ;
. local covariates i.region4 i.metro i.female i.age4 i.race4 i.hhsize i.marital
>  i.relig i.educ4 i.income i.housing i.home_type 
>  i.internet i.phoneservice i.device i.durint ;

.  #delimit cr
delimiter now cr
.                  
. *** Create additional regressors
. 
. recode partyid7 1/2 = 1 2/5 = 2 6/7 = 3, gen(partyid3)
(1703 differences between partyid7 and partyid3)

. recode partyid7 1/3 = 1 4 = 2 5/7 = 3, gen(partyid3l)
(1703 differences between partyid7 and partyid3l)

. order partyid7 partyid3 partyid3l, after(treat)

. tab partyid7 partyid3, miss

DATA-ONLY: |
  Computed |
   7-level |
 political |
     party |   RECODE of partyid7 (DATA-ONLY: Computed
identifica |   7-level political party identification)
      tion |         1          2          3          . |     Total
-----------+--------------------------------------------+----------
         1 |       309          0          0          0 |       309 
         2 |       424          0          0          0 |       424 
         3 |         0        220          0          0 |       220 
         4 |         0        338          0          0 |       338 
         5 |         0        191          0          0 |       191 
         6 |         0          0        347          0 |       347 
         7 |         0          0        183          0 |       183 
         . |         0          0          0          7 |         7 
-----------+--------------------------------------------+----------
     Total |       733        749        530          7 |     2,019 

. tab partyid7 partyid3l, miss

DATA-ONLY: |
  Computed |
   7-level |
 political |
     party |   RECODE of partyid7 (DATA-ONLY: Computed
identifica |   7-level political party identification)
      tion |         1          2          3          . |     Total
-----------+--------------------------------------------+----------
         1 |       309          0          0          0 |       309 
         2 |       424          0          0          0 |       424 
         3 |       220          0          0          0 |       220 
         4 |         0        338          0          0 |       338 
         5 |         0          0        191          0 |       191 
         6 |         0          0        347          0 |       347 
         7 |         0          0        183          0 |       183 
         . |         0          0          0          7 |         7 
-----------+--------------------------------------------+----------
     Total |       953        338        721          7 |     2,019 

. 
. recode racethnicity 3 5 6 = 3 , gen(race4)
(112 differences between racethnicity and race4)

. recode relig . = 15
(relig: 21 changes made)

. recode attend . = 10
(attend: 22 changes made)

. 
. summ `covariates'

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     region4 |
          2  |      2,019    .2704309    .4442925          0          1
          3  |      2,019    .3249133    .4684585          0          1
          4  |      2,019    .2456662    .4305881          0          1
-------------+---------------------------------------------------------
             |
     1.metro |      2,019    .8925211    .3097979          0          1
    1.female |      2,019    .5487865    .4977375          0          1
             |
        age4 |
          2  |      2,019    .2867756    .4523679          0          1
-------------+---------------------------------------------------------
          3  |      2,019    .2590391    .4382157          0          1
          4  |      2,019    .3105498    .4628334          0          1
             |
       race4 |
          2  |      2,019    .1099554    .3129117          0          1
          3  |      2,019    .0703318    .2557688          0          1
-------------+---------------------------------------------------------
          4  |      2,019    .1485884    .3557704          0          1
             |
      hhsize |
          2  |      2,019    .3184745        .466          0          1
          3  |      2,019    .1773155    .3820301          0          1
          4  |      2,019    .1297672    .3361304          0          1
-------------+---------------------------------------------------------
          5  |      2,019    .0950966     .293421          0          1
          6  |      2,019    .1263001    .3322696          0          1
             |
     marital |
          2  |      2,019    .0440812    .2053265          0          1
          3  |      2,019    .1347202     .341509          0          1
-------------+---------------------------------------------------------
          4  |      2,019    .0148588    .1210178          0          1
          5  |      2,019    .2065379    .4049212          0          1
          6  |      2,019    .0851907    .2792344          0          1
             |
       relig |
          2  |      2,019    .1946508    .3960297          0          1
-------------+---------------------------------------------------------
          3  |      2,019    .0118871    .1084048          0          1
          4  |      2,019    .0044577    .0666332          0          1
          5  |      2,019    .0203071    .1410835          0          1
          6  |      2,019    .0059435    .0768839          0          1
          7  |      2,019    .0118871    .1084048          0          1
-------------+---------------------------------------------------------
          8  |      2,019    .0054482    .0736291          0          1
          9  |      2,019    .0490342    .2159929          0          1
         10  |      2,019    .0510154    .2200836          0          1
         11  |      2,019    .1258049    .3317115          0          1
         12  |      2,019    .2020802    .4016512          0          1
-------------+---------------------------------------------------------
         13  |      2,019    .0113918    .1061489          0          1
         14  |      2,019    .0183259    .1341603          0          1
         15  |      2,019    .0104012    .1014796          0          1
             |
       educ4 |
          2  |      2,019    .1738484     .379073          0          1
-------------+---------------------------------------------------------
          3  |      2,019    .4502229    .4976393          0          1
          4  |      2,019    .3363051    .4725617          0          1
             |
      income |
          2  |      2,019    .0262506    .1599193          0          1
          3  |      2,019    .0331847    .1791631          0          1
-------------+---------------------------------------------------------
          4  |      2,019    .0406142    .1974436          0          1
          5  |      2,019     .055473    .2289579          0          1
          6  |      2,019    .0609212    .2392451          0          1
          7  |      2,019    .0589401    .2355708          0          1
          8  |      2,019     .047053    .2118047          0          1
-------------+---------------------------------------------------------
          9  |      2,019     .094106    .2920485          0          1
         10  |      2,019    .0985636    .2981491          0          1
         11  |      2,019    .1005448    .3007996          0          1
         12  |      2,019    .0435859    .2042226          0          1
         13  |      2,019    .0866766    .2814302          0          1
-------------+---------------------------------------------------------
         14  |      2,019     .094106    .2920485          0          1
         15  |      2,019    .0574542    .2327661          0          1
         16  |      2,019    .0356612      .18549          0          1
         17  |      2,019    .0163447    .1268288          0          1
         18  |      2,019    .0356612      .18549          0          1
             |
     housing |
          2  |      2,019    .3184745        .466          0          1
          3  |      2,019    .0267459    .1613799          0          1
             |
   home_type |
          2  |      2,019    .0926201    .2899712          0          1
-------------+---------------------------------------------------------
          3  |      2,019    .2258544    .4182473          0          1
          4  |      2,019    .0371471     .189169          0          1
          5  |      2,019    .0034671    .0587942          0          1
             |
  1.internet |      2,019    .9103517    .2857481          0          1
             |
phoneservice |
          2  |      2,019    .2585438    .4379428          0          1
          3  |      2,019    .1317484    .3383008          0          1
          4  |      2,019    .5631501    .4961189          0          1
          5  |      2,019    .0064388    .0800034          0          1
             |
      device |
 Smartphone  |      2,019    .5220406    .4996377          0          1
     Tablet  |      2,019    .0624071    .2419535          0          1
             |
      durint |
   1-3 mins  |      2,019    .6250619    .4842269          0          1
-------------+---------------------------------------------------------
   4-6 mins  |      2,019    .2313026    .4217699          0          1
   7-9 mins  |      2,019    .0465577    .2107417          0          1
10 or mor..  |      2,019    .0861813    .2807011          0          1

. 
. ********************************************************************************
. *** Summary of outcomes
. ********************************************************************************
. 
. summ `domain' [aweight = weight]

    Variable |     Obs      Weight        Mean   Std. Dev.       Min        Max
-------------+-----------------------------------------------------------------
         spk |   2,016  2015.95849    .4466732   .4972715          0          1
         col |   2,012   2011.2303    .2497988   .4330041          0          1
         lib |   2,009  2011.16718    .5253773   .4994799          0          1

. corr `domain' [aweight = weight]
(sum of wgt is 2,006.2353708017)
(obs=2,005)

             |      spk      col      lib
-------------+---------------------------
         spk |   1.0000
         col |   0.4948   1.0000
         lib |   0.4078   0.2767   1.0000


. bys treat: corr `domain' [aweight = weight]

-------------------------------------------------------------------------------------------------------------------
-> treat = mc
(sum of wgt is 721.2025177945)
(obs=700)

             |      spk      col      lib
-------------+---------------------------
         spk |   1.0000
         col |   0.4333   1.0000
         lib |   0.3924   0.2744   1.0000


-------------------------------------------------------------------------------------------------------------------
-> treat = ic
(sum of wgt is 665.2614538197)
(obs=656)

             |      spk      col      lib
-------------+---------------------------
         spk |   1.0000
         col |   0.5871   1.0000
         lib |   0.4005   0.2773   1.0000


-------------------------------------------------------------------------------------------------------------------
-> treat = irl
(sum of wgt is 619.7713991875)
(obs=649)

             |      spk      col      lib
-------------+---------------------------
         spk |   1.0000
         col |   0.4702   1.0000
         lib |   0.4327   0.2826   1.0000



. bys partyid3: corr `domain' [aweight = weight]

-------------------------------------------------------------------------------------------------------------------
-> partyid3 = 1
(sum of wgt is 673.5352909395)
(obs=730)

             |      spk      col      lib
-------------+---------------------------
         spk |   1.0000
         col |   0.4307   1.0000
         lib |   0.4276   0.2980   1.0000


-------------------------------------------------------------------------------------------------------------------
-> partyid3 = 2
(sum of wgt is 773.0350914344)
(obs=739)

             |      spk      col      lib
-------------+---------------------------
         spk |   1.0000
         col |   0.5275   1.0000
         lib |   0.3634   0.2834   1.0000


-------------------------------------------------------------------------------------------------------------------
-> partyid3 = 3
(sum of wgt is 551.8284831877)
(obs=529)

             |      spk      col      lib
-------------+---------------------------
         spk |   1.0000
         col |   0.5297   1.0000
         lib |   0.4484   0.2201   1.0000


-------------------------------------------------------------------------------------------------------------------
-> partyid3 = .
(sum of wgt is 7.8365052401)
(obs=7)

             |      spk      col      lib
-------------+---------------------------
         spk |   1.0000
         col |   0.6022   1.0000
         lib |  -0.0632   0.3809   1.0000



. 
. ********************************************************************************
. *** Basic treatment effect analysis
. ********************************************************************************
. 
. *** OLS regression models, with no additional adjustment
. 
. foreach dom in `domain' {
  2. 
. regress `dom' `covariates' b1.treat [pweight=weight]
  3. estimates store `dom'_r1
  4. 
. regress `dom' `covariates' c.partyid7 [pweight=weight]
  5. estimates store `dom'_r2
  6. 
. regress `dom' `covariates' b1.treat##c.partyid7 [pweight=weight]
  7. estimates store `dom'_r3
  8. 
. }
(sum of wgt is 2,015.9584942246)

Linear regression                               Number of obs     =      2,016
                                                F(74, 1941)       =       4.57
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1612
                                                Root MSE          =     .46403

----------------------------------------------------------------------------------
                 |               Robust
             spk |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
         region4 |
              2  |      0.024      0.046     0.52   0.605       -0.067       0.115
              3  |     -0.009      0.045    -0.20   0.842       -0.097       0.079
              4  |      0.036      0.049     0.74   0.461       -0.060       0.132
                 |
         1.metro |      0.026      0.049     0.54   0.592       -0.069       0.121
        1.female |     -0.119      0.028    -4.20   0.000       -0.175      -0.064
                 |
            age4 |
              2  |     -0.107      0.050    -2.14   0.032       -0.205      -0.009
              3  |     -0.170      0.053    -3.21   0.001       -0.274      -0.066
              4  |     -0.174      0.061    -2.84   0.005       -0.294      -0.054
                 |
           race4 |
              2  |     -0.001      0.049    -0.02   0.987       -0.096       0.095
              3  |     -0.044      0.061    -0.72   0.469       -0.164       0.076
              4  |      0.047      0.046     1.04   0.299       -0.042       0.137
                 |
          hhsize |
              2  |     -0.071      0.050    -1.42   0.156       -0.169       0.027
              3  |     -0.102      0.055    -1.84   0.066       -0.210       0.007
              4  |      0.008      0.062     0.14   0.891       -0.112       0.129
              5  |     -0.018      0.068    -0.27   0.787       -0.152       0.115
              6  |     -0.036      0.068    -0.53   0.597       -0.169       0.097
                 |
         marital |
              2  |     -0.047      0.082    -0.58   0.563       -0.208       0.113
              3  |      0.016      0.048     0.32   0.746       -0.079       0.110
              4  |      0.234      0.099     2.37   0.018        0.041       0.427
              5  |      0.020      0.049     0.42   0.675       -0.075       0.116
              6  |      0.079      0.056     1.40   0.163       -0.032       0.190
                 |
           relig |
              2  |     -0.074      0.045    -1.65   0.099       -0.162       0.014
              3  |     -0.158      0.154    -1.03   0.305       -0.461       0.144
              4  |      0.373      0.120     3.11   0.002        0.138       0.608
              5  |      0.110      0.104     1.06   0.288       -0.093       0.314
              6  |     -0.164      0.188    -0.88   0.382       -0.532       0.204
              7  |      0.149      0.120     1.24   0.215       -0.087       0.385
              8  |     -0.355      0.155    -2.28   0.023       -0.659      -0.050
              9  |      0.186      0.068     2.74   0.006        0.053       0.320
             10  |      0.075      0.072     1.04   0.297       -0.066       0.217
             11  |      0.098      0.049     2.00   0.046        0.002       0.195
             12  |     -0.036      0.040    -0.90   0.370       -0.116       0.043
             13  |      0.113      0.108     1.04   0.298       -0.100       0.325
             14  |      0.101      0.108     0.94   0.350       -0.111       0.313
             15  |      0.076      0.138     0.55   0.581       -0.195       0.348
                 |
           educ4 |
              2  |      0.071      0.066     1.07   0.285       -0.059       0.201
              3  |      0.180      0.064     2.81   0.005        0.054       0.305
              4  |      0.261      0.068     3.83   0.000        0.128       0.395
                 |
          income |
              2  |      0.095      0.140     0.68   0.498       -0.179       0.368
              3  |     -0.026      0.136    -0.19   0.849       -0.293       0.241
              4  |     -0.079      0.120    -0.66   0.511       -0.315       0.157
              5  |      0.028      0.119     0.23   0.817       -0.207       0.262
              6  |     -0.071      0.119    -0.60   0.551       -0.304       0.162
              7  |     -0.049      0.120    -0.40   0.687       -0.285       0.188
              8  |     -0.059      0.127    -0.46   0.644       -0.308       0.191
              9  |     -0.054      0.119    -0.45   0.652       -0.287       0.180
             10  |     -0.003      0.119    -0.02   0.982       -0.237       0.231
             11  |     -0.056      0.117    -0.48   0.631       -0.286       0.174
             12  |     -0.037      0.126    -0.29   0.772       -0.284       0.211
             13  |      0.058      0.118     0.49   0.622       -0.174       0.291
             14  |     -0.017      0.119    -0.15   0.883       -0.251       0.216
             15  |     -0.070      0.126    -0.56   0.576       -0.317       0.176
             16  |     -0.045      0.130    -0.34   0.731       -0.300       0.210
             17  |      0.215      0.141     1.53   0.127       -0.061       0.491
             18  |      0.049      0.132     0.37   0.712       -0.209       0.307
                 |
         housing |
              2  |      0.067      0.041     1.62   0.105       -0.014       0.149
              3  |     -0.015      0.106    -0.14   0.889       -0.223       0.193
                 |
       home_type |
              2  |     -0.097      0.048    -2.03   0.042       -0.190      -0.003
              3  |     -0.097      0.046    -2.12   0.035       -0.187      -0.007
              4  |      0.177      0.078     2.27   0.023        0.024       0.329
              5  |     -0.204      0.180    -1.13   0.258       -0.557       0.149
                 |
      1.internet |      0.016      0.050     0.32   0.748       -0.081       0.113
                 |
    phoneservice |
              2  |     -0.041      0.075    -0.54   0.588       -0.188       0.107
              3  |      0.003      0.079     0.03   0.973       -0.153       0.158
              4  |     -0.038      0.074    -0.51   0.607       -0.184       0.108
              5  |      0.092      0.175     0.53   0.599       -0.251       0.435
                 |
          device |
     Smartphone  |     -0.116      0.032    -3.60   0.000       -0.180      -0.053
         Tablet  |     -0.023      0.061    -0.39   0.700       -0.142       0.095
                 |
          durint |
       1-3 mins  |     -0.245      0.131    -1.87   0.061       -0.501       0.011
       4-6 mins  |     -0.271      0.133    -2.03   0.042       -0.532      -0.009
       7-9 mins  |     -0.234      0.144    -1.62   0.105       -0.517       0.049
10 or more mins  |     -0.307      0.138    -2.22   0.027       -0.579      -0.036
                 |
           treat |
             ic  |     -0.087      0.034    -2.58   0.010       -0.154      -0.021
            irl  |     -0.057      0.034    -1.67   0.095       -0.124       0.010
                 |
           _cons |      0.864      0.199     4.35   0.000        0.474       1.253
----------------------------------------------------------------------------------
(sum of wgt is 2,008.1219889845)

Linear regression                               Number of obs     =      2,009
                                                F(73, 1935)       =       4.72
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1607
                                                Root MSE          =      .4641

----------------------------------------------------------------------------------
                 |               Robust
             spk |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
         region4 |
              2  |      0.023      0.047     0.50   0.620       -0.069       0.115
              3  |     -0.003      0.045    -0.06   0.954       -0.091       0.086
              4  |      0.038      0.050     0.77   0.440       -0.059       0.136
                 |
         1.metro |      0.027      0.048     0.56   0.578       -0.067       0.121
        1.female |     -0.123      0.029    -4.31   0.000       -0.180      -0.067
                 |
            age4 |
              2  |     -0.114      0.050    -2.27   0.023       -0.213      -0.016
              3  |     -0.170      0.054    -3.17   0.002       -0.275      -0.065
              4  |     -0.176      0.062    -2.83   0.005       -0.298      -0.054
                 |
           race4 |
              2  |     -0.030      0.052    -0.58   0.563       -0.131       0.071
              3  |     -0.055      0.060    -0.90   0.366       -0.173       0.064
              4  |      0.025      0.047     0.53   0.599       -0.067       0.116
                 |
          hhsize |
              2  |     -0.073      0.050    -1.46   0.144       -0.172       0.025
              3  |     -0.101      0.055    -1.83   0.067       -0.209       0.007
              4  |      0.018      0.062     0.29   0.769       -0.104       0.140
              5  |     -0.020      0.067    -0.30   0.768       -0.151       0.112
              6  |     -0.028      0.067    -0.42   0.672       -0.160       0.103
                 |
         marital |
              2  |     -0.060      0.080    -0.75   0.453       -0.218       0.097
              3  |      0.008      0.049     0.17   0.865       -0.087       0.104
              4  |      0.258      0.095     2.70   0.007        0.071       0.445
              5  |      0.014      0.049     0.28   0.776       -0.083       0.111
              6  |      0.069      0.056     1.23   0.221       -0.041       0.180
                 |
           relig |
              2  |     -0.076      0.045    -1.69   0.091       -0.163       0.012
              3  |     -0.166      0.151    -1.10   0.272       -0.461       0.130
              4  |      0.359      0.119     3.01   0.003        0.125       0.593
              5  |      0.102      0.104     0.98   0.326       -0.102       0.306
              6  |     -0.172      0.201    -0.85   0.394       -0.567       0.223
              7  |      0.130      0.124     1.04   0.296       -0.114       0.373
              8  |     -0.353      0.156    -2.26   0.024       -0.659      -0.046
              9  |      0.158      0.071     2.23   0.026        0.019       0.298
             10  |      0.053      0.074     0.71   0.478       -0.093       0.198
             11  |      0.091      0.050     1.81   0.071       -0.008       0.189
             12  |     -0.036      0.041    -0.88   0.382       -0.117       0.045
             13  |      0.099      0.108     0.91   0.362       -0.114       0.311
             14  |      0.079      0.105     0.75   0.452       -0.127       0.284
             15  |      0.066      0.151     0.44   0.664       -0.230       0.361
                 |
           educ4 |
              2  |      0.074      0.068     1.09   0.276       -0.059       0.207
              3  |      0.182      0.065     2.79   0.005        0.054       0.309
              4  |      0.261      0.070     3.73   0.000        0.124       0.398
                 |
          income |
              2  |      0.105      0.140     0.75   0.453       -0.170       0.381
              3  |     -0.013      0.138    -0.10   0.922       -0.283       0.256
              4  |     -0.073      0.124    -0.59   0.553       -0.316       0.169
              5  |      0.043      0.122     0.35   0.727       -0.196       0.281
              6  |     -0.060      0.122    -0.49   0.625       -0.299       0.180
              7  |     -0.032      0.124    -0.26   0.794       -0.275       0.210
              8  |     -0.060      0.128    -0.46   0.642       -0.311       0.192
              9  |     -0.043      0.123    -0.35   0.727       -0.284       0.198
             10  |      0.021      0.122     0.17   0.862       -0.219       0.261
             11  |     -0.052      0.121    -0.43   0.669       -0.289       0.185
             12  |     -0.020      0.129    -0.15   0.879       -0.273       0.233
             13  |      0.077      0.121     0.64   0.525       -0.160       0.314
             14  |      0.004      0.122     0.03   0.973       -0.235       0.244
             15  |     -0.045      0.128    -0.35   0.727       -0.297       0.207
             16  |     -0.027      0.132    -0.20   0.841       -0.286       0.233
             17  |      0.233      0.145     1.60   0.109       -0.052       0.518
             18  |      0.079      0.135     0.58   0.559       -0.186       0.344
                 |
         housing |
              2  |      0.067      0.042     1.61   0.107       -0.015       0.150
              3  |     -0.011      0.104    -0.10   0.917       -0.215       0.193
                 |
       home_type |
              2  |     -0.091      0.048    -1.90   0.057       -0.185       0.003
              3  |     -0.100      0.046    -2.15   0.031       -0.191      -0.009
              4  |      0.178      0.076     2.33   0.020        0.028       0.327
              5  |     -0.234      0.182    -1.29   0.197       -0.591       0.122
                 |
      1.internet |      0.008      0.050     0.17   0.866       -0.090       0.106
                 |
    phoneservice |
              2  |     -0.049      0.077    -0.63   0.526       -0.201       0.103
              3  |      0.001      0.082     0.01   0.995       -0.160       0.161
              4  |     -0.037      0.077    -0.49   0.627       -0.188       0.113
              5  |      0.081      0.175     0.47   0.642       -0.262       0.424
                 |
          device |
     Smartphone  |     -0.114      0.033    -3.50   0.000       -0.178      -0.050
         Tablet  |     -0.020      0.060    -0.32   0.746       -0.138       0.099
                 |
          durint |
       1-3 mins  |     -0.271      0.126    -2.16   0.031       -0.518      -0.025
       4-6 mins  |     -0.294      0.128    -2.30   0.021       -0.545      -0.044
       7-9 mins  |     -0.266      0.140    -1.90   0.057       -0.540       0.008
10 or more mins  |     -0.324      0.133    -2.43   0.015       -0.586      -0.062
                 |
        partyid7 |     -0.012      0.008    -1.49   0.136       -0.028       0.004
           _cons |      0.896      0.207     4.33   0.000        0.490       1.302
----------------------------------------------------------------------------------
(sum of wgt is 2,008.1219889845)

Linear regression                               Number of obs     =      2,009
                                                F(77, 1931)       =       4.84
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1672
                                                Root MSE          =     .46278

----------------------------------------------------------------------------------
                 |               Robust
             spk |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
         region4 |
              2  |      0.026      0.046     0.56   0.575       -0.065       0.117
              3  |     -0.001      0.045    -0.02   0.985       -0.089       0.087
              4  |      0.040      0.049     0.82   0.411       -0.056       0.136
                 |
         1.metro |      0.032      0.049     0.66   0.512       -0.063       0.127
        1.female |     -0.126      0.028    -4.45   0.000       -0.182      -0.071
                 |
            age4 |
              2  |     -0.117      0.050    -2.35   0.019       -0.215      -0.020
              3  |     -0.173      0.053    -3.26   0.001       -0.277      -0.069
              4  |     -0.178      0.062    -2.88   0.004       -0.298      -0.057
                 |
           race4 |
              2  |     -0.032      0.051    -0.63   0.529       -0.132       0.068
              3  |     -0.049      0.061    -0.82   0.414       -0.168       0.069
              4  |      0.029      0.046     0.62   0.534       -0.062       0.119
                 |
          hhsize |
              2  |     -0.076      0.050    -1.52   0.130       -0.175       0.022
              3  |     -0.103      0.055    -1.86   0.063       -0.211       0.006
              4  |      0.012      0.062     0.19   0.851       -0.109       0.132
              5  |     -0.013      0.068    -0.19   0.850       -0.145       0.120
              6  |     -0.033      0.068    -0.48   0.632       -0.166       0.101
                 |
         marital |
              2  |     -0.053      0.081    -0.65   0.515       -0.213       0.107
              3  |      0.017      0.048     0.36   0.721       -0.077       0.112
              4  |      0.269      0.092     2.92   0.004        0.088       0.449
              5  |      0.011      0.049     0.23   0.817       -0.085       0.107
              6  |      0.078      0.056     1.39   0.165       -0.032       0.188
                 |
           relig |
              2  |     -0.079      0.045    -1.77   0.078       -0.167       0.009
              3  |     -0.163      0.157    -1.04   0.299       -0.470       0.144
              4  |      0.366      0.116     3.16   0.002        0.139       0.593
              5  |      0.095      0.102     0.93   0.352       -0.106       0.296
              6  |     -0.168      0.190    -0.88   0.379       -0.541       0.206
              7  |      0.125      0.120     1.04   0.300       -0.111       0.361
              8  |     -0.365      0.157    -2.33   0.020       -0.673      -0.058
              9  |      0.160      0.071     2.23   0.026        0.020       0.300
             10  |      0.054      0.075     0.72   0.470       -0.093       0.201
             11  |      0.089      0.050     1.76   0.078       -0.010       0.188
             12  |     -0.037      0.040    -0.91   0.363       -0.116       0.042
             13  |      0.090      0.108     0.83   0.404       -0.121       0.301
             14  |      0.088      0.109     0.81   0.420       -0.125       0.301
             15  |      0.093      0.150     0.62   0.533       -0.200       0.387
                 |
           educ4 |
              2  |      0.076      0.067     1.13   0.258       -0.056       0.207
              3  |      0.188      0.064     2.93   0.003        0.062       0.315
              4  |      0.264      0.069     3.83   0.000        0.129       0.399
                 |
          income |
              2  |      0.099      0.140     0.71   0.480       -0.176       0.374
              3  |     -0.017      0.136    -0.12   0.902       -0.283       0.250
              4  |     -0.078      0.120    -0.65   0.516       -0.314       0.157
              5  |      0.027      0.120     0.22   0.823       -0.209       0.263
              6  |     -0.065      0.119    -0.54   0.587       -0.298       0.169
              7  |     -0.046      0.121    -0.38   0.707       -0.283       0.192
              8  |     -0.071      0.126    -0.56   0.573       -0.317       0.176
              9  |     -0.054      0.119    -0.46   0.649       -0.288       0.180
             10  |      0.007      0.120     0.06   0.953       -0.228       0.242
             11  |     -0.051      0.118    -0.43   0.667       -0.282       0.181
             12  |     -0.034      0.126    -0.27   0.788       -0.282       0.214
             13  |      0.070      0.119     0.59   0.558       -0.163       0.303
             14  |     -0.011      0.119    -0.09   0.925       -0.246       0.223
             15  |     -0.062      0.127    -0.49   0.624       -0.311       0.186
             16  |     -0.035      0.130    -0.27   0.790       -0.290       0.220
             17  |      0.224      0.140     1.60   0.110       -0.051       0.499
             18  |      0.069      0.132     0.52   0.602       -0.190       0.328
                 |
         housing |
              2  |      0.061      0.041     1.49   0.137       -0.020       0.143
              3  |     -0.009      0.106    -0.08   0.933       -0.216       0.198
                 |
       home_type |
              2  |     -0.091      0.048    -1.91   0.056       -0.184       0.002
              3  |     -0.095      0.046    -2.09   0.037       -0.185      -0.006
              4  |      0.185      0.077     2.41   0.016        0.035       0.336
              5  |     -0.215      0.187    -1.15   0.249       -0.581       0.151
                 |
      1.internet |      0.013      0.050     0.26   0.793       -0.084       0.110
                 |
    phoneservice |
              2  |     -0.048      0.076    -0.63   0.528       -0.196       0.100
              3  |     -0.006      0.080    -0.08   0.938       -0.163       0.150
              4  |     -0.039      0.075    -0.52   0.602       -0.187       0.108
              5  |      0.099      0.170     0.58   0.559       -0.234       0.433
                 |
          device |
     Smartphone  |     -0.112      0.032    -3.48   0.001       -0.175      -0.049
         Tablet  |     -0.021      0.060    -0.35   0.728       -0.139       0.097
                 |
          durint |
       1-3 mins  |     -0.255      0.126    -2.01   0.044       -0.502      -0.007
       4-6 mins  |     -0.278      0.128    -2.16   0.031       -0.530      -0.026
       7-9 mins  |     -0.235      0.140    -1.68   0.094       -0.509       0.040
10 or more mins  |     -0.315      0.135    -2.34   0.019       -0.579      -0.051
                 |
           treat |
             ic  |      0.024      0.072     0.33   0.740       -0.118       0.166
            irl  |     -0.022      0.075    -0.30   0.766       -0.169       0.124
                 |
        partyid7 |     -0.001      0.012    -0.11   0.916       -0.025       0.022
                 |
treat#c.partyid7 |
             ic  |     -0.028      0.017    -1.68   0.093       -0.060       0.005
            irl  |     -0.008      0.017    -0.45   0.650       -0.041       0.026
                 |
           _cons |      0.881      0.203     4.35   0.000        0.484       1.279
----------------------------------------------------------------------------------
(sum of wgt is 2,011.2303007225)

Linear regression                               Number of obs     =      2,012
                                                F(74, 1937)       =       3.12
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1265
                                                Root MSE          =     .41235

----------------------------------------------------------------------------------
                 |               Robust
             col |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
         region4 |
              2  |      0.046      0.042     1.11   0.269       -0.036       0.127
              3  |      0.019      0.038     0.49   0.621       -0.056       0.093
              4  |      0.068      0.042     1.62   0.105       -0.014       0.151
                 |
         1.metro |      0.045      0.043     1.05   0.295       -0.039       0.128
        1.female |     -0.033      0.026    -1.30   0.195       -0.083       0.017
                 |
            age4 |
              2  |     -0.067      0.047    -1.41   0.157       -0.160       0.026
              3  |     -0.126      0.050    -2.50   0.012       -0.225      -0.027
              4  |     -0.166      0.056    -2.95   0.003       -0.277      -0.056
                 |
           race4 |
              2  |      0.018      0.043     0.42   0.678       -0.066       0.101
              3  |      0.001      0.056     0.02   0.986       -0.108       0.110
              4  |     -0.047      0.039    -1.18   0.236       -0.124       0.031
                 |
          hhsize |
              2  |     -0.037      0.045    -0.82   0.415       -0.125       0.052
              3  |     -0.070      0.048    -1.46   0.144       -0.164       0.024
              4  |     -0.023      0.057    -0.41   0.685       -0.136       0.089
              5  |     -0.044      0.062    -0.72   0.472       -0.165       0.077
              6  |      0.024      0.059     0.40   0.691       -0.093       0.140
                 |
         marital |
              2  |      0.064      0.071     0.90   0.366       -0.075       0.203
              3  |     -0.009      0.038    -0.25   0.805       -0.084       0.065
              4  |      0.230      0.116     1.97   0.049        0.001       0.458
              5  |      0.038      0.046     0.83   0.406       -0.052       0.129
              6  |      0.094      0.053     1.79   0.073       -0.009       0.198
                 |
           relig |
              2  |     -0.022      0.039    -0.58   0.560       -0.098       0.053
              3  |     -0.114      0.092    -1.24   0.216       -0.294       0.066
              4  |      0.363      0.140     2.58   0.010        0.088       0.638
              5  |      0.071      0.099     0.71   0.476       -0.124       0.266
              6  |     -0.030      0.207    -0.15   0.883       -0.437       0.376
              7  |     -0.029      0.110    -0.27   0.790       -0.245       0.187
              8  |     -0.278      0.092    -3.02   0.003       -0.458      -0.097
              9  |      0.106      0.064     1.65   0.098       -0.020       0.233
             10  |      0.032      0.064     0.50   0.621       -0.093       0.156
             11  |      0.097      0.045     2.18   0.029        0.010       0.184
             12  |      0.009      0.037     0.26   0.798       -0.062       0.081
             13  |      0.208      0.115     1.82   0.070       -0.017       0.434
             14  |      0.112      0.094     1.19   0.233       -0.072       0.296
             15  |      0.256      0.137     1.88   0.061       -0.012       0.524
                 |
           educ4 |
              2  |     -0.073      0.062    -1.18   0.239       -0.194       0.048
              3  |     -0.025      0.060    -0.43   0.670       -0.142       0.092
              4  |      0.107      0.063     1.68   0.092       -0.017       0.231
                 |
          income |
              2  |      0.018      0.131     0.14   0.889       -0.238       0.275
              3  |     -0.022      0.118    -0.18   0.854       -0.254       0.211
              4  |     -0.114      0.098    -1.16   0.245       -0.308       0.079
              5  |     -0.068      0.098    -0.69   0.489       -0.260       0.124
              6  |     -0.055      0.098    -0.56   0.573       -0.247       0.137
              7  |     -0.020      0.105    -0.19   0.852       -0.226       0.187
              8  |     -0.040      0.102    -0.40   0.690       -0.240       0.159
              9  |     -0.097      0.094    -1.03   0.304       -0.282       0.088
             10  |      0.031      0.096     0.32   0.750       -0.158       0.219
             11  |     -0.106      0.093    -1.14   0.255       -0.289       0.077
             12  |     -0.021      0.109    -0.19   0.851       -0.235       0.194
             13  |      0.009      0.096     0.09   0.926       -0.180       0.197
             14  |     -0.045      0.096    -0.47   0.641       -0.234       0.144
             15  |     -0.077      0.100    -0.77   0.443       -0.272       0.119
             16  |     -0.076      0.105    -0.72   0.469       -0.282       0.130
             17  |      0.182      0.140     1.30   0.193       -0.092       0.455
             18  |     -0.036      0.110    -0.33   0.743       -0.253       0.180
                 |
         housing |
              2  |      0.052      0.038     1.36   0.174       -0.023       0.128
              3  |     -0.026      0.096    -0.27   0.787       -0.215       0.163
                 |
       home_type |
              2  |     -0.043      0.041    -1.05   0.294       -0.123       0.037
              3  |     -0.094      0.041    -2.30   0.022       -0.175      -0.014
              4  |      0.076      0.074     1.02   0.309       -0.070       0.221
              5  |     -0.182      0.116    -1.58   0.115       -0.409       0.044
                 |
      1.internet |     -0.019      0.048    -0.40   0.689       -0.113       0.074
                 |
    phoneservice |
              2  |     -0.097      0.066    -1.46   0.144       -0.227       0.033
              3  |     -0.070      0.069    -1.00   0.316       -0.206       0.067
              4  |     -0.088      0.068    -1.30   0.193       -0.220       0.044
              5  |     -0.279      0.113    -2.47   0.014       -0.500      -0.057
                 |
          device |
     Smartphone  |     -0.032      0.029    -1.12   0.262       -0.088       0.024
         Tablet  |      0.034      0.050     0.68   0.497       -0.064       0.131
                 |
          durint |
       1-3 mins  |     -0.246      0.159    -1.55   0.122       -0.559       0.066
       4-6 mins  |     -0.230      0.161    -1.43   0.154       -0.546       0.086
       7-9 mins  |     -0.296      0.165    -1.79   0.074       -0.620       0.028
10 or more mins  |     -0.342      0.164    -2.09   0.036       -0.663      -0.022
                 |
           treat |
             ic  |     -0.052      0.030    -1.72   0.086       -0.110       0.007
            irl  |     -0.055      0.031    -1.78   0.075       -0.115       0.006
                 |
           _cons |      0.723      0.199     3.64   0.000        0.334       1.113
----------------------------------------------------------------------------------
(sum of wgt is 2,003.3937954824)

Linear regression                               Number of obs     =      2,005
                                                F(73, 1931)       =       3.46
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1320
                                                Root MSE          =     .41005

----------------------------------------------------------------------------------
                 |               Robust
             col |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
         region4 |
              2  |      0.052      0.042     1.22   0.223       -0.031       0.135
              3  |      0.033      0.039     0.85   0.395       -0.043       0.110
              4  |      0.077      0.043     1.80   0.072       -0.007       0.162
                 |
         1.metro |      0.046      0.042     1.08   0.278       -0.037       0.128
        1.female |     -0.040      0.026    -1.58   0.114       -0.091       0.010
                 |
            age4 |
              2  |     -0.071      0.047    -1.51   0.132       -0.164       0.021
              3  |     -0.122      0.050    -2.42   0.016       -0.220      -0.023
              4  |     -0.166      0.056    -2.95   0.003       -0.276      -0.056
                 |
           race4 |
              2  |     -0.024      0.046    -0.52   0.602       -0.114       0.066
              3  |     -0.019      0.055    -0.34   0.734       -0.126       0.089
              4  |     -0.071      0.040    -1.78   0.076       -0.150       0.007
                 |
          hhsize |
              2  |     -0.045      0.046    -0.98   0.328       -0.134       0.045
              3  |     -0.073      0.048    -1.51   0.131       -0.167       0.022
              4  |     -0.021      0.058    -0.36   0.718       -0.135       0.093
              5  |     -0.054      0.061    -0.88   0.377       -0.173       0.066
              6  |      0.025      0.060     0.41   0.680       -0.093       0.142
                 |
         marital |
              2  |      0.049      0.072     0.68   0.499       -0.093       0.190
              3  |     -0.020      0.038    -0.54   0.588       -0.095       0.054
              4  |      0.252      0.109     2.32   0.021        0.039       0.466
              5  |      0.016      0.047     0.33   0.738       -0.077       0.108
              6  |      0.084      0.053     1.60   0.111       -0.019       0.188
                 |
           relig |
              2  |     -0.031      0.039    -0.80   0.426       -0.107       0.045
              3  |     -0.131      0.094    -1.38   0.166       -0.316       0.054
              4  |      0.353      0.142     2.49   0.013        0.074       0.632
              5  |      0.060      0.099     0.61   0.542       -0.133       0.254
              6  |     -0.042      0.219    -0.19   0.847       -0.472       0.387
              7  |     -0.045      0.105    -0.43   0.671       -0.251       0.162
              8  |     -0.284      0.094    -3.01   0.003       -0.469      -0.099
              9  |      0.064      0.066     0.97   0.334       -0.065       0.193
             10  |      0.001      0.065     0.01   0.993       -0.128       0.129
             11  |      0.078      0.045     1.73   0.084       -0.010       0.167
             12  |      0.009      0.037     0.25   0.802       -0.062       0.081
             13  |      0.176      0.114     1.55   0.122       -0.047       0.400
             14  |      0.084      0.092     0.91   0.362       -0.097       0.265
             15  |      0.189      0.142     1.33   0.183       -0.089       0.468
                 |
           educ4 |
              2  |     -0.065      0.061    -1.06   0.289       -0.186       0.055
              3  |     -0.024      0.059    -0.40   0.689       -0.140       0.092
              4  |      0.108      0.064     1.70   0.090       -0.017       0.233
                 |
          income |
              2  |      0.028      0.131     0.21   0.831       -0.229       0.285
              3  |     -0.006      0.120    -0.05   0.960       -0.240       0.228
              4  |     -0.110      0.101    -1.09   0.276       -0.307       0.088
              5  |     -0.063      0.099    -0.64   0.521       -0.257       0.130
              6  |     -0.049      0.100    -0.49   0.622       -0.246       0.147
              7  |     -0.014      0.106    -0.13   0.895       -0.223       0.195
              8  |     -0.044      0.102    -0.43   0.666       -0.244       0.156
              9  |     -0.091      0.097    -0.94   0.348       -0.281       0.099
             10  |      0.051      0.097     0.53   0.597       -0.140       0.243
             11  |     -0.103      0.095    -1.08   0.281       -0.290       0.084
             12  |     -0.006      0.111    -0.05   0.960       -0.223       0.212
             13  |      0.025      0.097     0.26   0.795       -0.166       0.216
             14  |     -0.035      0.098    -0.36   0.719       -0.227       0.157
             15  |     -0.055      0.101    -0.55   0.584       -0.253       0.143
             16  |     -0.061      0.105    -0.57   0.565       -0.267       0.146
             17  |      0.194      0.141     1.38   0.168       -0.082       0.471
             18  |     -0.029      0.112    -0.26   0.794       -0.249       0.190
                 |
         housing |
              2  |      0.050      0.038     1.32   0.187       -0.024       0.125
              3  |     -0.008      0.094    -0.09   0.930       -0.194       0.177
                 |
       home_type |
              2  |     -0.033      0.041    -0.79   0.428       -0.114       0.048
              3  |     -0.094      0.041    -2.28   0.023       -0.176      -0.013
              4  |      0.079      0.072     1.10   0.274       -0.063       0.221
              5  |     -0.216      0.122    -1.77   0.077       -0.455       0.023
                 |
      1.internet |     -0.030      0.047    -0.62   0.534       -0.123       0.064
                 |
    phoneservice |
              2  |     -0.103      0.067    -1.54   0.123       -0.235       0.028
              3  |     -0.072      0.070    -1.03   0.304       -0.209       0.065
              4  |     -0.087      0.068    -1.27   0.206       -0.221       0.048
              5  |     -0.269      0.116    -2.33   0.020       -0.496      -0.042
                 |
          device |
     Smartphone  |     -0.030      0.029    -1.04   0.300       -0.086       0.027
         Tablet  |      0.035      0.049     0.71   0.479       -0.062       0.132
                 |
          durint |
       1-3 mins  |     -0.292      0.152    -1.92   0.055       -0.589       0.006
       4-6 mins  |     -0.277      0.153    -1.81   0.071       -0.577       0.024
       7-9 mins  |     -0.350      0.158    -2.22   0.027       -0.660      -0.040
10 or more mins  |     -0.389      0.156    -2.49   0.013       -0.696      -0.082
                 |
        partyid7 |     -0.021      0.007    -2.88   0.004       -0.035      -0.007
           _cons |      0.835      0.203     4.12   0.000        0.438       1.233
----------------------------------------------------------------------------------
(sum of wgt is 2,003.3937954824)

Linear regression                               Number of obs     =      2,005
                                                F(77, 1927)       =       3.41
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1363
                                                Root MSE          =     .40945

----------------------------------------------------------------------------------
                 |               Robust
             col |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
         region4 |
              2  |      0.051      0.042     1.22   0.222       -0.031       0.132
              3  |      0.034      0.039     0.89   0.374       -0.041       0.110
              4  |      0.081      0.042     1.91   0.056       -0.002       0.164
                 |
         1.metro |      0.049      0.042     1.17   0.242       -0.033       0.131
        1.female |     -0.040      0.026    -1.58   0.115       -0.090       0.010
                 |
            age4 |
              2  |     -0.071      0.047    -1.53   0.126       -0.163       0.020
              3  |     -0.123      0.050    -2.49   0.013       -0.221      -0.026
              4  |     -0.169      0.055    -3.04   0.002       -0.277      -0.060
                 |
           race4 |
              2  |     -0.018      0.046    -0.40   0.690       -0.108       0.071
              3  |     -0.013      0.055    -0.24   0.811       -0.121       0.095
              4  |     -0.067      0.040    -1.71   0.088       -0.145       0.010
                 |
          hhsize |
              2  |     -0.048      0.045    -1.07   0.286       -0.136       0.040
              3  |     -0.077      0.048    -1.62   0.106       -0.171       0.016
              4  |     -0.027      0.058    -0.48   0.634       -0.140       0.086
              5  |     -0.056      0.061    -0.92   0.357       -0.175       0.063
              6  |      0.012      0.059     0.20   0.838       -0.104       0.128
                 |
         marital |
              2  |      0.050      0.071     0.70   0.483       -0.089       0.188
              3  |     -0.017      0.038    -0.46   0.646       -0.091       0.057
              4  |      0.250      0.111     2.25   0.024        0.032       0.467
              5  |      0.013      0.047     0.29   0.775       -0.078       0.105
              6  |      0.087      0.053     1.64   0.101       -0.017       0.192
                 |
           relig |
              2  |     -0.027      0.039    -0.69   0.488       -0.103       0.049
              3  |     -0.134      0.096    -1.39   0.163       -0.323       0.055
              4  |      0.340      0.147     2.32   0.021        0.052       0.627
              5  |      0.056      0.096     0.58   0.561       -0.132       0.243
              6  |     -0.048      0.209    -0.23   0.819       -0.457       0.362
              7  |     -0.038      0.105    -0.36   0.716       -0.245       0.168
              8  |     -0.297      0.095    -3.13   0.002       -0.483      -0.111
              9  |      0.070      0.065     1.07   0.285       -0.058       0.198
             10  |      0.008      0.064     0.13   0.900       -0.118       0.135
             11  |      0.079      0.045     1.75   0.081       -0.010       0.168
             12  |      0.008      0.036     0.22   0.823       -0.063       0.080
             13  |      0.165      0.114     1.45   0.148       -0.059       0.389
             14  |      0.088      0.093     0.95   0.340       -0.093       0.270
             15  |      0.202      0.142     1.43   0.154       -0.076       0.480
                 |
           educ4 |
              2  |     -0.068      0.061    -1.12   0.262       -0.187       0.051
              3  |     -0.027      0.059    -0.47   0.640       -0.142       0.087
              4  |      0.102      0.063     1.62   0.105       -0.021       0.225
                 |
          income |
              2  |      0.022      0.131     0.17   0.865       -0.235       0.279
              3  |     -0.017      0.120    -0.14   0.886       -0.252       0.217
              4  |     -0.116      0.101    -1.15   0.249       -0.313       0.081
              5  |     -0.071      0.099    -0.72   0.474       -0.266       0.124
              6  |     -0.062      0.101    -0.62   0.535       -0.260       0.135
              7  |     -0.030      0.105    -0.28   0.776       -0.235       0.176
              8  |     -0.058      0.103    -0.57   0.570       -0.260       0.143
              9  |     -0.102      0.097    -1.05   0.292       -0.292       0.088
             10  |      0.037      0.098     0.38   0.704       -0.155       0.230
             11  |     -0.107      0.095    -1.12   0.263       -0.294       0.080
             12  |     -0.020      0.110    -0.18   0.859       -0.235       0.196
             13  |      0.013      0.097     0.13   0.895       -0.178       0.204
             14  |     -0.045      0.098    -0.46   0.649       -0.238       0.148
             15  |     -0.068      0.102    -0.67   0.505       -0.267       0.131
             16  |     -0.069      0.106    -0.65   0.514       -0.277       0.139
             17  |      0.184      0.140     1.31   0.189       -0.090       0.458
             18  |     -0.041      0.112    -0.37   0.714       -0.261       0.179
                 |
         housing |
              2  |      0.050      0.038     1.32   0.186       -0.024       0.125
              3  |     -0.005      0.094    -0.06   0.954       -0.189       0.178
                 |
       home_type |
              2  |     -0.038      0.041    -0.92   0.359       -0.119       0.043
              3  |     -0.094      0.041    -2.30   0.022       -0.175      -0.014
              4  |      0.075      0.072     1.04   0.299       -0.067       0.217
              5  |     -0.185      0.125    -1.47   0.141       -0.431       0.061
                 |
      1.internet |     -0.026      0.048    -0.54   0.588       -0.120       0.068
                 |
    phoneservice |
              2  |     -0.101      0.065    -1.56   0.119       -0.229       0.026
              3  |     -0.075      0.068    -1.10   0.273       -0.208       0.059
              4  |     -0.086      0.066    -1.30   0.192       -0.216       0.043
              5  |     -0.271      0.112    -2.42   0.016       -0.490      -0.051
                 |
          device |
     Smartphone  |     -0.035      0.028    -1.23   0.219       -0.091       0.021
         Tablet  |      0.032      0.049     0.66   0.508       -0.063       0.127
                 |
          durint |
       1-3 mins  |     -0.292      0.152    -1.92   0.055       -0.590       0.006
       4-6 mins  |     -0.279      0.153    -1.82   0.068       -0.580       0.021
       7-9 mins  |     -0.349      0.158    -2.20   0.028       -0.660      -0.038
10 or more mins  |     -0.392      0.157    -2.51   0.012       -0.700      -0.085
                 |
           treat |
             ic  |     -0.096      0.064    -1.50   0.135       -0.221       0.030
            irl  |     -0.137      0.065    -2.11   0.035       -0.264      -0.010
                 |
        partyid7 |     -0.032      0.011    -2.96   0.003       -0.053      -0.011
                 |
treat#c.partyid7 |
             ic  |      0.013      0.014     0.92   0.358       -0.014       0.040
            irl  |      0.023      0.015     1.58   0.114       -0.006       0.052
                 |
           _cons |      0.921      0.204     4.52   0.000        0.521       1.320
----------------------------------------------------------------------------------
(sum of wgt is 2,011.1671752376)

Linear regression                               Number of obs     =      2,009
                                                F(74, 1934)       =       5.26
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1812
                                                Root MSE          =     .46054

----------------------------------------------------------------------------------
                 |               Robust
             lib |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
         region4 |
              2  |     -0.003      0.044    -0.08   0.938       -0.090       0.083
              3  |     -0.089      0.042    -2.14   0.032       -0.171      -0.007
              4  |      0.027      0.045     0.59   0.556       -0.062       0.115
                 |
         1.metro |      0.053      0.048     1.10   0.271       -0.042       0.148
        1.female |      0.001      0.029     0.05   0.960       -0.056       0.059
                 |
            age4 |
              2  |     -0.108      0.049    -2.19   0.028       -0.205      -0.011
              3  |     -0.200      0.053    -3.79   0.000       -0.304      -0.096
              4  |     -0.164      0.061    -2.67   0.008       -0.285      -0.044
                 |
           race4 |
              2  |      0.004      0.051     0.08   0.938       -0.097       0.105
              3  |      0.013      0.052     0.25   0.802       -0.090       0.116
              4  |     -0.082      0.044    -1.88   0.061       -0.167       0.004
                 |
          hhsize |
              2  |     -0.098      0.046    -2.13   0.033       -0.189      -0.008
              3  |     -0.172      0.053    -3.27   0.001       -0.275      -0.069
              4  |     -0.139      0.058    -2.39   0.017       -0.252      -0.025
              5  |     -0.028      0.063    -0.44   0.660       -0.151       0.096
              6  |     -0.123      0.062    -1.99   0.046       -0.244      -0.002
                 |
         marital |
              2  |     -0.061      0.067    -0.91   0.360       -0.193       0.070
              3  |     -0.023      0.046    -0.50   0.620       -0.114       0.068
              4  |     -0.084      0.129    -0.65   0.518       -0.338       0.170
              5  |     -0.025      0.049    -0.51   0.612       -0.120       0.071
              6  |     -0.010      0.058    -0.17   0.866       -0.123       0.103
                 |
           relig |
              2  |      0.046      0.044     1.04   0.300       -0.041       0.132
              3  |     -0.070      0.150    -0.46   0.642       -0.364       0.224
              4  |      0.133      0.151     0.88   0.377       -0.162       0.429
              5  |      0.101      0.097     1.04   0.299       -0.089       0.291
              6  |      0.055      0.183     0.30   0.766       -0.305       0.414
              7  |     -0.151      0.127    -1.19   0.236       -0.400       0.099
              8  |     -0.162      0.171    -0.94   0.346       -0.497       0.174
              9  |      0.255      0.060     4.23   0.000        0.137       0.373
             10  |      0.132      0.070     1.89   0.059       -0.005       0.268
             11  |      0.199      0.049     4.04   0.000        0.102       0.295
             12  |     -0.022      0.041    -0.52   0.601       -0.102       0.059
             13  |      0.087      0.118     0.74   0.458       -0.143       0.318
             14  |      0.086      0.105     0.82   0.411       -0.119       0.292
             15  |     -0.157      0.109    -1.44   0.151       -0.371       0.057
                 |
           educ4 |
              2  |     -0.064      0.062    -1.04   0.299       -0.186       0.057
              3  |      0.050      0.059     0.85   0.394       -0.066       0.166
              4  |      0.197      0.063     3.14   0.002        0.074       0.319
                 |
          income |
              2  |     -0.194      0.138    -1.41   0.160       -0.464       0.076
              3  |     -0.198      0.133    -1.49   0.136       -0.459       0.063
              4  |     -0.127      0.126    -1.00   0.316       -0.374       0.121
              5  |     -0.094      0.118    -0.79   0.429       -0.326       0.139
              6  |     -0.176      0.122    -1.44   0.150       -0.415       0.064
              7  |     -0.073      0.124    -0.59   0.556       -0.316       0.170
              8  |     -0.159      0.129    -1.24   0.216       -0.411       0.093
              9  |     -0.248      0.117    -2.13   0.033       -0.477      -0.019
             10  |     -0.125      0.115    -1.08   0.279       -0.351       0.101
             11  |     -0.117      0.119    -0.99   0.323       -0.351       0.116
             12  |     -0.149      0.126    -1.18   0.240       -0.396       0.099
             13  |     -0.085      0.118    -0.72   0.471       -0.316       0.146
             14  |     -0.152      0.121    -1.26   0.209       -0.389       0.085
             15  |     -0.168      0.122    -1.38   0.169       -0.407       0.071
             16  |     -0.145      0.133    -1.09   0.275       -0.406       0.116
             17  |     -0.151      0.152    -1.00   0.320       -0.449       0.147
             18  |     -0.022      0.128    -0.17   0.863       -0.273       0.229
                 |
         housing |
              2  |     -0.013      0.041    -0.33   0.742       -0.094       0.067
              3  |      0.135      0.092     1.47   0.141       -0.045       0.315
                 |
       home_type |
              2  |     -0.064      0.051    -1.26   0.209       -0.164       0.036
              3  |      0.007      0.044     0.17   0.869       -0.079       0.093
              4  |      0.037      0.076     0.49   0.626       -0.112       0.186
              5  |      0.143      0.256     0.56   0.579       -0.361       0.646
                 |
      1.internet |      0.030      0.052     0.58   0.563       -0.071       0.131
                 |
    phoneservice |
              2  |      0.076      0.071     1.07   0.284       -0.063       0.215
              3  |      0.037      0.076     0.49   0.624       -0.112       0.187
              4  |      0.102      0.070     1.45   0.147       -0.036       0.240
              5  |     -0.022      0.192    -0.12   0.908       -0.399       0.354
                 |
          device |
     Smartphone  |     -0.115      0.031    -3.67   0.000       -0.177      -0.054
         Tablet  |      0.038      0.058     0.66   0.511       -0.075       0.151
                 |
          durint |
       1-3 mins  |      0.200      0.148     1.35   0.178       -0.091       0.491
       4-6 mins  |      0.224      0.151     1.48   0.138       -0.072       0.520
       7-9 mins  |      0.149      0.160     0.93   0.352       -0.165       0.464
10 or more mins  |      0.182      0.157     1.16   0.245       -0.125       0.490
                 |
           treat |
             ic  |     -0.035      0.034    -1.03   0.303       -0.101       0.031
            irl  |      0.009      0.034     0.27   0.790       -0.058       0.076
                 |
           _cons |      0.554      0.222     2.49   0.013        0.118       0.990
----------------------------------------------------------------------------------
(sum of wgt is 2,003.3306699975)

Linear regression                               Number of obs     =      2,002
                                                F(73, 1928)       =       5.62
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1842
                                                Root MSE          =     .45953

----------------------------------------------------------------------------------
                 |               Robust
             lib |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
         region4 |
              2  |     -0.003      0.044    -0.06   0.951       -0.089       0.084
              3  |     -0.081      0.042    -1.92   0.055       -0.164       0.002
              4  |      0.031      0.045     0.68   0.496       -0.058       0.120
                 |
         1.metro |      0.057      0.048     1.17   0.241       -0.038       0.151
        1.female |     -0.007      0.029    -0.24   0.814       -0.064       0.050
                 |
            age4 |
              2  |     -0.109      0.050    -2.20   0.028       -0.206      -0.012
              3  |     -0.200      0.052    -3.81   0.000       -0.303      -0.097
              4  |     -0.171      0.061    -2.80   0.005       -0.291      -0.051
                 |
           race4 |
              2  |     -0.038      0.054    -0.70   0.483       -0.143       0.068
              3  |      0.004      0.052     0.08   0.934       -0.097       0.105
              4  |     -0.097      0.044    -2.21   0.027       -0.184      -0.011
                 |
          hhsize |
              2  |     -0.105      0.046    -2.26   0.024       -0.196      -0.014
              3  |     -0.176      0.053    -3.34   0.001       -0.280      -0.073
              4  |     -0.137      0.059    -2.33   0.020       -0.252      -0.022
              5  |     -0.046      0.063    -0.74   0.461       -0.170       0.077
              6  |     -0.132      0.062    -2.12   0.034       -0.254      -0.010
                 |
         marital |
              2  |     -0.079      0.065    -1.22   0.224       -0.206       0.048
              3  |     -0.030      0.046    -0.66   0.512       -0.120       0.060
              4  |     -0.087      0.136    -0.64   0.524       -0.354       0.180
              5  |     -0.042      0.049    -0.85   0.393       -0.139       0.055
              6  |     -0.018      0.057    -0.32   0.749       -0.130       0.094
                 |
           relig |
              2  |      0.038      0.044     0.85   0.393       -0.049       0.124
              3  |     -0.075      0.144    -0.53   0.599       -0.357       0.206
              4  |      0.126      0.130     0.97   0.331       -0.128       0.380
              5  |      0.076      0.094     0.81   0.419       -0.109       0.262
              6  |      0.032      0.181     0.18   0.858       -0.322       0.387
              7  |     -0.181      0.120    -1.52   0.130       -0.416       0.053
              8  |     -0.183      0.176    -1.04   0.297       -0.528       0.161
              9  |      0.205      0.063     3.23   0.001        0.081       0.329
             10  |      0.099      0.071     1.40   0.163       -0.040       0.237
             11  |      0.176      0.050     3.52   0.000        0.078       0.274
             12  |     -0.025      0.041    -0.60   0.546       -0.105       0.056
             13  |      0.039      0.115     0.34   0.735       -0.187       0.265
             14  |      0.058      0.106     0.55   0.584       -0.149       0.265
             15  |     -0.133      0.149    -0.90   0.370       -0.424       0.158
                 |
           educ4 |
              2  |     -0.054      0.061    -0.88   0.377       -0.173       0.065
              3  |      0.054      0.058     0.94   0.345       -0.059       0.167
              4  |      0.195      0.061     3.19   0.001        0.075       0.315
                 |
          income |
              2  |     -0.184      0.143    -1.28   0.201       -0.465       0.098
              3  |     -0.194      0.136    -1.42   0.156       -0.461       0.074
              4  |     -0.127      0.131    -0.97   0.332       -0.384       0.130
              5  |     -0.100      0.123    -0.81   0.419       -0.341       0.142
              6  |     -0.174      0.127    -1.37   0.171       -0.423       0.075
              7  |     -0.078      0.129    -0.60   0.546       -0.330       0.175
              8  |     -0.153      0.134    -1.14   0.255       -0.415       0.110
              9  |     -0.255      0.122    -2.08   0.038       -0.495      -0.015
             10  |     -0.122      0.121    -1.01   0.314       -0.359       0.115
             11  |     -0.121      0.124    -0.98   0.328       -0.364       0.122
             12  |     -0.151      0.131    -1.16   0.248       -0.408       0.106
             13  |     -0.076      0.123    -0.62   0.535       -0.317       0.164
             14  |     -0.143      0.126    -1.14   0.255       -0.389       0.103
             15  |     -0.158      0.127    -1.24   0.215       -0.407       0.092
             16  |     -0.132      0.137    -0.97   0.334       -0.400       0.136
             17  |     -0.150      0.153    -0.98   0.326       -0.451       0.150
             18  |     -0.024      0.133    -0.18   0.857       -0.286       0.238
                 |
         housing |
              2  |     -0.019      0.041    -0.47   0.639       -0.100       0.061
              3  |      0.143      0.091     1.57   0.116       -0.035       0.322
                 |
       home_type |
              2  |     -0.057      0.050    -1.13   0.260       -0.156       0.042
              3  |      0.006      0.044     0.14   0.889       -0.081       0.093
              4  |      0.038      0.076     0.51   0.612       -0.110       0.187
              5  |      0.127      0.252     0.50   0.614       -0.367       0.621
                 |
      1.internet |      0.027      0.052     0.53   0.596       -0.074       0.129
                 |
    phoneservice |
              2  |      0.074      0.073     1.01   0.312       -0.069       0.217
              3  |      0.034      0.079     0.43   0.669       -0.120       0.188
              4  |      0.101      0.072     1.40   0.162       -0.041       0.243
              5  |     -0.015      0.193    -0.08   0.937       -0.395       0.364
                 |
          device |
     Smartphone  |     -0.116      0.031    -3.69   0.000       -0.178      -0.055
         Tablet  |      0.040      0.057     0.70   0.486       -0.072       0.152
                 |
          durint |
       1-3 mins  |      0.158      0.156     1.01   0.311       -0.148       0.464
       4-6 mins  |      0.176      0.158     1.11   0.265       -0.134       0.486
       7-9 mins  |      0.097      0.168     0.58   0.561       -0.232       0.426
10 or more mins  |      0.146      0.164     0.89   0.373       -0.175       0.467
                 |
        partyid7 |     -0.023      0.008    -2.99   0.003       -0.038      -0.008
           _cons |      0.707      0.232     3.05   0.002        0.253       1.162
----------------------------------------------------------------------------------
(sum of wgt is 2,003.3306699975)

Linear regression                               Number of obs     =      2,002
                                                F(77, 1924)       =       5.60
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1874
                                                Root MSE          =     .45912

----------------------------------------------------------------------------------
                 |               Robust
             lib |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
         region4 |
              2  |      0.002      0.044     0.04   0.970       -0.084       0.087
              3  |     -0.082      0.042    -1.95   0.052       -0.164       0.001
              4  |      0.030      0.045     0.66   0.509       -0.058       0.117
                 |
         1.metro |      0.051      0.048     1.07   0.286       -0.043       0.146
        1.female |     -0.006      0.029    -0.19   0.847       -0.063       0.051
                 |
            age4 |
              2  |     -0.110      0.049    -2.22   0.026       -0.207      -0.013
              3  |     -0.198      0.052    -3.79   0.000       -0.301      -0.096
              4  |     -0.169      0.061    -2.78   0.005       -0.289      -0.050
                 |
           race4 |
              2  |     -0.034      0.054    -0.64   0.521       -0.140       0.071
              3  |      0.004      0.052     0.08   0.935       -0.098       0.107
              4  |     -0.094      0.044    -2.15   0.032       -0.180      -0.008
                 |
          hhsize |
              2  |     -0.107      0.046    -2.31   0.021       -0.197      -0.016
              3  |     -0.176      0.053    -3.33   0.001       -0.280      -0.073
              4  |     -0.141      0.058    -2.43   0.015       -0.256      -0.027
              5  |     -0.049      0.062    -0.78   0.436       -0.171       0.074
              6  |     -0.131      0.062    -2.12   0.034       -0.253      -0.010
                 |
         marital |
              2  |     -0.070      0.066    -1.07   0.287       -0.200       0.059
              3  |     -0.030      0.046    -0.65   0.518       -0.119       0.060
              4  |     -0.082      0.136    -0.60   0.548       -0.349       0.185
              5  |     -0.044      0.049    -0.90   0.370       -0.140       0.052
              6  |     -0.016      0.057    -0.29   0.773       -0.128       0.096
                 |
           relig |
              2  |      0.035      0.044     0.80   0.422       -0.051       0.122
              3  |     -0.080      0.143    -0.56   0.575       -0.361       0.201
              4  |      0.147      0.128     1.15   0.250       -0.103       0.398
              5  |      0.085      0.094     0.90   0.367       -0.100       0.270
              6  |      0.027      0.187     0.15   0.885       -0.340       0.394
              7  |     -0.164      0.125    -1.32   0.188       -0.409       0.080
              8  |     -0.188      0.175    -1.08   0.282       -0.531       0.154
              9  |      0.201      0.062     3.23   0.001        0.079       0.323
             10  |      0.099      0.070     1.42   0.155       -0.037       0.235
             11  |      0.173      0.050     3.47   0.001        0.075       0.270
             12  |     -0.023      0.041    -0.57   0.570       -0.103       0.057
             13  |      0.047      0.116     0.41   0.681       -0.179       0.274
             14  |      0.061      0.106     0.58   0.563       -0.146       0.268
             15  |     -0.131      0.144    -0.91   0.364       -0.415       0.152
                 |
           educ4 |
              2  |     -0.053      0.060    -0.89   0.373       -0.171       0.064
              3  |      0.058      0.057     1.02   0.309       -0.054       0.169
              4  |      0.198      0.060     3.30   0.001        0.081       0.316
                 |
          income |
              2  |     -0.183      0.140    -1.31   0.191       -0.457       0.092
              3  |     -0.186      0.132    -1.41   0.158       -0.444       0.072
              4  |     -0.121      0.126    -0.96   0.337       -0.367       0.126
              5  |     -0.105      0.117    -0.90   0.369       -0.336       0.125
              6  |     -0.168      0.122    -1.38   0.167       -0.407       0.071
              7  |     -0.080      0.123    -0.65   0.518       -0.322       0.162
              8  |     -0.148      0.129    -1.14   0.255       -0.401       0.106
              9  |     -0.246      0.117    -2.10   0.036       -0.475      -0.016
             10  |     -0.118      0.116    -1.02   0.310       -0.344       0.109
             11  |     -0.118      0.119    -1.00   0.319       -0.351       0.114
             12  |     -0.143      0.126    -1.14   0.255       -0.390       0.104
             13  |     -0.074      0.118    -0.63   0.531       -0.304       0.157
             14  |     -0.140      0.121    -1.16   0.246       -0.377       0.097
             15  |     -0.157      0.123    -1.28   0.201       -0.399       0.084
             16  |     -0.130      0.133    -0.98   0.327       -0.390       0.130
             17  |     -0.151      0.149    -1.01   0.312       -0.443       0.142
             18  |     -0.017      0.129    -0.13   0.898       -0.270       0.237
                 |
         housing |
              2  |     -0.019      0.041    -0.46   0.644       -0.099       0.061
              3  |      0.146      0.091     1.60   0.110       -0.033       0.325
                 |
       home_type |
              2  |     -0.052      0.050    -1.04   0.297       -0.151       0.046
              3  |      0.008      0.044     0.19   0.852       -0.078       0.094
              4  |      0.041      0.076     0.54   0.590       -0.108       0.191
              5  |      0.098      0.253     0.39   0.697       -0.397       0.594
                 |
      1.internet |      0.025      0.051     0.49   0.626       -0.076       0.126
                 |
    phoneservice |
              2  |      0.078      0.072     1.09   0.277       -0.063       0.219
              3  |      0.038      0.077     0.49   0.622       -0.113       0.189
              4  |      0.103      0.071     1.45   0.146       -0.036       0.243
              5  |      0.004      0.193     0.02   0.984       -0.375       0.383
                 |
          device |
     Smartphone  |     -0.112      0.031    -3.58   0.000       -0.174      -0.051
         Tablet  |      0.039      0.056     0.68   0.493       -0.072       0.149
                 |
          durint |
       1-3 mins  |      0.153      0.151     1.01   0.314       -0.144       0.449
       4-6 mins  |      0.175      0.153     1.14   0.256       -0.126       0.476
       7-9 mins  |      0.086      0.163     0.53   0.599       -0.234       0.405
10 or more mins  |      0.138      0.159     0.87   0.387       -0.175       0.450
                 |
           treat |
             ic  |     -0.058      0.074    -0.79   0.430       -0.202       0.086
            irl  |      0.093      0.069     1.34   0.180       -0.043       0.229
                 |
        partyid7 |     -0.018      0.012    -1.51   0.132       -0.041       0.005
                 |
treat#c.partyid7 |
             ic  |      0.006      0.017     0.35   0.724       -0.028       0.040
            irl  |     -0.021      0.016    -1.30   0.193       -0.053       0.011
                 |
           _cons |      0.692      0.228     3.04   0.002        0.245       1.140
----------------------------------------------------------------------------------

. 
. estimates dir

-------------------------------------------------------
        name | command      depvar       npar  title 
-------------+-----------------------------------------
      spk_r1 | regress      spk            92  
    spk_r1d1 | margins      no depvar       3  
    spk_r1d2 | margins      no depvar       3  
      spk_r2 | regress      spk            90  
      spk_r3 | regress      spk            96  
    spk_r3d1 | margins      no depvar       3  
    spk_r3d2 | margins      no depvar       3  
      spk_r4 | margins      no depvar       1  
      spk_r5 | margins      no depvar       3  
      spk_r6 | margins      no depvar      21  
      col_r1 | regress      col            92  
    col_r1d1 | margins      no depvar       3  
    col_r1d2 | margins      no depvar       3  
      col_r2 | regress      col            90  
      col_r3 | regress      col            96  
    col_r3d1 | margins      no depvar       3  
    col_r3d2 | margins      no depvar       3  
      col_r4 | margins      no depvar       1  
      col_r5 | margins      no depvar       3  
      col_r6 | margins      no depvar      21  
      lib_r1 | regress      lib            92  
    lib_r1d1 | margins      no depvar       3  
    lib_r1d2 | margins      no depvar       3  
      lib_r2 | regress      lib            90  
      lib_r3 | regress      lib            96  
    lib_r3d1 | margins      no depvar       3  
    lib_r3d2 | margins      no depvar       3  
      lib_r4 | margins      no depvar       1  
      lib_r5 | margins      no depvar       3  
      lib_r6 | margins      no depvar      21  
-------------------------------------------------------

. 
. outreg2 [*] ///
>   using docs/ols-estimates-with-covariates.xls, ///
>   noaster stats(coef se ci pval)  dec(3)  ///
>   paren(se) bracket(ci) ///
>   excel replace
docs/ols-estimates-with-covariates.xls
dir : seeout

.   
. estimates clear

. 
. foreach dom in `domain' {
  2. 
. regress `dom' `covariates' b1.treat [pweight=weight]
  3.   margins b1.treat, post
  4.   estimates store `dom'_r1
  5.     quietly regress `dom' `covariates' b1.treat [pweight=weight]
  6.     margins, dydx(b1.treat) post
  7.     estimates store `dom'_r1d1
  8.     quietly regress `dom' `covariates' b2.treat [pweight=weight]
  9.     margins, dydx(b2.treat) post
 10.     estimates store `dom'_r1d2
 11. 
. regress `dom' `covariates' c.partyid7 [pweight=weight]
 12.   margins, dydx(c.partyid7) post
 13.   estimates store `dom'_r2
 14.    
. regress `dom' `covariates' b1.treat##c.partyid7 [pweight=weight]
 15.   margins b1.treat, post
 16.   estimates store `dom'_r3
 17.     quietly regress `dom' `covariates' b1.treat##c.partyid7 [pweight=weight]
 18.     margins, dydx(b1.treat) post
 19.     estimates store `dom'_r3d1
 20.     quietly regress `dom' `covariates' b2.treat##c.partyid7 [pweight=weight]
 21.     margins, dydx(b2.treat) post
 22.     estimates store `dom'_r3d2
 23.   quietly regress `dom' `covariates' b1.treat##c.partyid7 [pweight=weight]
 24.     margins, dydx(c.partyid7) post
 25.     estimates store `dom'_r4
 26.   quietly regress `dom' `covariates' b1.treat##c.partyid7 [pweight=weight]
 27.     margins, dydx(partyid7) at(treat = (1(1)3)) post
 28.     estimates store `dom'_r5
 29.   quietly regress `dom' `covariates' b1.treat##c.partyid7 [pweight=weight] 
 30.     margins, dydx(b1.treat) at(partyid = (1(1)7)) post
 31.     estimates store `dom'_r6
 32. 
. }
(sum of wgt is 2,015.9584942246)

Linear regression                               Number of obs     =      2,016
                                                F(74, 1941)       =       4.57
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1612
                                                Root MSE          =     .46403

----------------------------------------------------------------------------------
                 |               Robust
             spk |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
         region4 |
              2  |      0.024      0.046     0.52   0.605       -0.067       0.115
              3  |     -0.009      0.045    -0.20   0.842       -0.097       0.079
              4  |      0.036      0.049     0.74   0.461       -0.060       0.132
                 |
         1.metro |      0.026      0.049     0.54   0.592       -0.069       0.121
        1.female |     -0.119      0.028    -4.20   0.000       -0.175      -0.064
                 |
            age4 |
              2  |     -0.107      0.050    -2.14   0.032       -0.205      -0.009
              3  |     -0.170      0.053    -3.21   0.001       -0.274      -0.066
              4  |     -0.174      0.061    -2.84   0.005       -0.294      -0.054
                 |
           race4 |
              2  |     -0.001      0.049    -0.02   0.987       -0.096       0.095
              3  |     -0.044      0.061    -0.72   0.469       -0.164       0.076
              4  |      0.047      0.046     1.04   0.299       -0.042       0.137
                 |
          hhsize |
              2  |     -0.071      0.050    -1.42   0.156       -0.169       0.027
              3  |     -0.102      0.055    -1.84   0.066       -0.210       0.007
              4  |      0.008      0.062     0.14   0.891       -0.112       0.129
              5  |     -0.018      0.068    -0.27   0.787       -0.152       0.115
              6  |     -0.036      0.068    -0.53   0.597       -0.169       0.097
                 |
         marital |
              2  |     -0.047      0.082    -0.58   0.563       -0.208       0.113
              3  |      0.016      0.048     0.32   0.746       -0.079       0.110
              4  |      0.234      0.099     2.37   0.018        0.041       0.427
              5  |      0.020      0.049     0.42   0.675       -0.075       0.116
              6  |      0.079      0.056     1.40   0.163       -0.032       0.190
                 |
           relig |
              2  |     -0.074      0.045    -1.65   0.099       -0.162       0.014
              3  |     -0.158      0.154    -1.03   0.305       -0.461       0.144
              4  |      0.373      0.120     3.11   0.002        0.138       0.608
              5  |      0.110      0.104     1.06   0.288       -0.093       0.314
              6  |     -0.164      0.188    -0.88   0.382       -0.532       0.204
              7  |      0.149      0.120     1.24   0.215       -0.087       0.385
              8  |     -0.355      0.155    -2.28   0.023       -0.659      -0.050
              9  |      0.186      0.068     2.74   0.006        0.053       0.320
             10  |      0.075      0.072     1.04   0.297       -0.066       0.217
             11  |      0.098      0.049     2.00   0.046        0.002       0.195
             12  |     -0.036      0.040    -0.90   0.370       -0.116       0.043
             13  |      0.113      0.108     1.04   0.298       -0.100       0.325
             14  |      0.101      0.108     0.94   0.350       -0.111       0.313
             15  |      0.076      0.138     0.55   0.581       -0.195       0.348
                 |
           educ4 |
              2  |      0.071      0.066     1.07   0.285       -0.059       0.201
              3  |      0.180      0.064     2.81   0.005        0.054       0.305
              4  |      0.261      0.068     3.83   0.000        0.128       0.395
                 |
          income |
              2  |      0.095      0.140     0.68   0.498       -0.179       0.368
              3  |     -0.026      0.136    -0.19   0.849       -0.293       0.241
              4  |     -0.079      0.120    -0.66   0.511       -0.315       0.157
              5  |      0.028      0.119     0.23   0.817       -0.207       0.262
              6  |     -0.071      0.119    -0.60   0.551       -0.304       0.162
              7  |     -0.049      0.120    -0.40   0.687       -0.285       0.188
              8  |     -0.059      0.127    -0.46   0.644       -0.308       0.191
              9  |     -0.054      0.119    -0.45   0.652       -0.287       0.180
             10  |     -0.003      0.119    -0.02   0.982       -0.237       0.231
             11  |     -0.056      0.117    -0.48   0.631       -0.286       0.174
             12  |     -0.037      0.126    -0.29   0.772       -0.284       0.211
             13  |      0.058      0.118     0.49   0.622       -0.174       0.291
             14  |     -0.017      0.119    -0.15   0.883       -0.251       0.216
             15  |     -0.070      0.126    -0.56   0.576       -0.317       0.176
             16  |     -0.045      0.130    -0.34   0.731       -0.300       0.210
             17  |      0.215      0.141     1.53   0.127       -0.061       0.491
             18  |      0.049      0.132     0.37   0.712       -0.209       0.307
                 |
         housing |
              2  |      0.067      0.041     1.62   0.105       -0.014       0.149
              3  |     -0.015      0.106    -0.14   0.889       -0.223       0.193
                 |
       home_type |
              2  |     -0.097      0.048    -2.03   0.042       -0.190      -0.003
              3  |     -0.097      0.046    -2.12   0.035       -0.187      -0.007
              4  |      0.177      0.078     2.27   0.023        0.024       0.329
              5  |     -0.204      0.180    -1.13   0.258       -0.557       0.149
                 |
      1.internet |      0.016      0.050     0.32   0.748       -0.081       0.113
                 |
    phoneservice |
              2  |     -0.041      0.075    -0.54   0.588       -0.188       0.107
              3  |      0.003      0.079     0.03   0.973       -0.153       0.158
              4  |     -0.038      0.074    -0.51   0.607       -0.184       0.108
              5  |      0.092      0.175     0.53   0.599       -0.251       0.435
                 |
          device |
     Smartphone  |     -0.116      0.032    -3.60   0.000       -0.180      -0.053
         Tablet  |     -0.023      0.061    -0.39   0.700       -0.142       0.095
                 |
          durint |
       1-3 mins  |     -0.245      0.131    -1.87   0.061       -0.501       0.011
       4-6 mins  |     -0.271      0.133    -2.03   0.042       -0.532      -0.009
       7-9 mins  |     -0.234      0.144    -1.62   0.105       -0.517       0.049
10 or more mins  |     -0.307      0.138    -2.22   0.027       -0.579      -0.036
                 |
           treat |
             ic  |     -0.087      0.034    -2.58   0.010       -0.154      -0.021
            irl  |     -0.057      0.034    -1.67   0.095       -0.124       0.010
                 |
           _cons |      0.864      0.199     4.35   0.000        0.474       1.253
----------------------------------------------------------------------------------

Predictive margins                              Number of obs     =      2,016
Model VCE    : Robust

Expression   : Linear prediction, predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.493      0.023    21.15   0.000        0.448       0.539
         ic  |      0.406      0.024    16.74   0.000        0.358       0.453
        irl  |      0.436      0.025    17.34   0.000        0.387       0.485
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,016
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.087      0.034    -2.58   0.010       -0.154      -0.021
        irl  |     -0.057      0.034    -1.67   0.095       -0.124       0.010
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,016
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 1.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.087      0.034     2.58   0.010        0.021       0.154
        irl  |      0.030      0.035     0.86   0.387       -0.038       0.099
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.
(sum of wgt is 2,008.1219889845)

Linear regression                               Number of obs     =      2,009
                                                F(73, 1935)       =       4.72
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1607
                                                Root MSE          =      .4641

----------------------------------------------------------------------------------
                 |               Robust
             spk |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
         region4 |
              2  |      0.023      0.047     0.50   0.620       -0.069       0.115
              3  |     -0.003      0.045    -0.06   0.954       -0.091       0.086
              4  |      0.038      0.050     0.77   0.440       -0.059       0.136
                 |
         1.metro |      0.027      0.048     0.56   0.578       -0.067       0.121
        1.female |     -0.123      0.029    -4.31   0.000       -0.180      -0.067
                 |
            age4 |
              2  |     -0.114      0.050    -2.27   0.023       -0.213      -0.016
              3  |     -0.170      0.054    -3.17   0.002       -0.275      -0.065
              4  |     -0.176      0.062    -2.83   0.005       -0.298      -0.054
                 |
           race4 |
              2  |     -0.030      0.052    -0.58   0.563       -0.131       0.071
              3  |     -0.055      0.060    -0.90   0.366       -0.173       0.064
              4  |      0.025      0.047     0.53   0.599       -0.067       0.116
                 |
          hhsize |
              2  |     -0.073      0.050    -1.46   0.144       -0.172       0.025
              3  |     -0.101      0.055    -1.83   0.067       -0.209       0.007
              4  |      0.018      0.062     0.29   0.769       -0.104       0.140
              5  |     -0.020      0.067    -0.30   0.768       -0.151       0.112
              6  |     -0.028      0.067    -0.42   0.672       -0.160       0.103
                 |
         marital |
              2  |     -0.060      0.080    -0.75   0.453       -0.218       0.097
              3  |      0.008      0.049     0.17   0.865       -0.087       0.104
              4  |      0.258      0.095     2.70   0.007        0.071       0.445
              5  |      0.014      0.049     0.28   0.776       -0.083       0.111
              6  |      0.069      0.056     1.23   0.221       -0.041       0.180
                 |
           relig |
              2  |     -0.076      0.045    -1.69   0.091       -0.163       0.012
              3  |     -0.166      0.151    -1.10   0.272       -0.461       0.130
              4  |      0.359      0.119     3.01   0.003        0.125       0.593
              5  |      0.102      0.104     0.98   0.326       -0.102       0.306
              6  |     -0.172      0.201    -0.85   0.394       -0.567       0.223
              7  |      0.130      0.124     1.04   0.296       -0.114       0.373
              8  |     -0.353      0.156    -2.26   0.024       -0.659      -0.046
              9  |      0.158      0.071     2.23   0.026        0.019       0.298
             10  |      0.053      0.074     0.71   0.478       -0.093       0.198
             11  |      0.091      0.050     1.81   0.071       -0.008       0.189
             12  |     -0.036      0.041    -0.88   0.382       -0.117       0.045
             13  |      0.099      0.108     0.91   0.362       -0.114       0.311
             14  |      0.079      0.105     0.75   0.452       -0.127       0.284
             15  |      0.066      0.151     0.44   0.664       -0.230       0.361
                 |
           educ4 |
              2  |      0.074      0.068     1.09   0.276       -0.059       0.207
              3  |      0.182      0.065     2.79   0.005        0.054       0.309
              4  |      0.261      0.070     3.73   0.000        0.124       0.398
                 |
          income |
              2  |      0.105      0.140     0.75   0.453       -0.170       0.381
              3  |     -0.013      0.138    -0.10   0.922       -0.283       0.256
              4  |     -0.073      0.124    -0.59   0.553       -0.316       0.169
              5  |      0.043      0.122     0.35   0.727       -0.196       0.281
              6  |     -0.060      0.122    -0.49   0.625       -0.299       0.180
              7  |     -0.032      0.124    -0.26   0.794       -0.275       0.210
              8  |     -0.060      0.128    -0.46   0.642       -0.311       0.192
              9  |     -0.043      0.123    -0.35   0.727       -0.284       0.198
             10  |      0.021      0.122     0.17   0.862       -0.219       0.261
             11  |     -0.052      0.121    -0.43   0.669       -0.289       0.185
             12  |     -0.020      0.129    -0.15   0.879       -0.273       0.233
             13  |      0.077      0.121     0.64   0.525       -0.160       0.314
             14  |      0.004      0.122     0.03   0.973       -0.235       0.244
             15  |     -0.045      0.128    -0.35   0.727       -0.297       0.207
             16  |     -0.027      0.132    -0.20   0.841       -0.286       0.233
             17  |      0.233      0.145     1.60   0.109       -0.052       0.518
             18  |      0.079      0.135     0.58   0.559       -0.186       0.344
                 |
         housing |
              2  |      0.067      0.042     1.61   0.107       -0.015       0.150
              3  |     -0.011      0.104    -0.10   0.917       -0.215       0.193
                 |
       home_type |
              2  |     -0.091      0.048    -1.90   0.057       -0.185       0.003
              3  |     -0.100      0.046    -2.15   0.031       -0.191      -0.009
              4  |      0.178      0.076     2.33   0.020        0.028       0.327
              5  |     -0.234      0.182    -1.29   0.197       -0.591       0.122
                 |
      1.internet |      0.008      0.050     0.17   0.866       -0.090       0.106
                 |
    phoneservice |
              2  |     -0.049      0.077    -0.63   0.526       -0.201       0.103
              3  |      0.001      0.082     0.01   0.995       -0.160       0.161
              4  |     -0.037      0.077    -0.49   0.627       -0.188       0.113
              5  |      0.081      0.175     0.47   0.642       -0.262       0.424
                 |
          device |
     Smartphone  |     -0.114      0.033    -3.50   0.000       -0.178      -0.050
         Tablet  |     -0.020      0.060    -0.32   0.746       -0.138       0.099
                 |
          durint |
       1-3 mins  |     -0.271      0.126    -2.16   0.031       -0.518      -0.025
       4-6 mins  |     -0.294      0.128    -2.30   0.021       -0.545      -0.044
       7-9 mins  |     -0.266      0.140    -1.90   0.057       -0.540       0.008
10 or more mins  |     -0.324      0.133    -2.43   0.015       -0.586      -0.062
                 |
        partyid7 |     -0.012      0.008    -1.49   0.136       -0.028       0.004
           _cons |      0.896      0.207     4.33   0.000        0.490       1.302
----------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,009
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : partyid7

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    partyid7 |     -0.012      0.008    -1.49   0.136       -0.028       0.004
------------------------------------------------------------------------------
(sum of wgt is 2,008.1219889845)

Linear regression                               Number of obs     =      2,009
                                                F(77, 1931)       =       4.84
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1672
                                                Root MSE          =     .46278

----------------------------------------------------------------------------------
                 |               Robust
             spk |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
         region4 |
              2  |      0.026      0.046     0.56   0.575       -0.065       0.117
              3  |     -0.001      0.045    -0.02   0.985       -0.089       0.087
              4  |      0.040      0.049     0.82   0.411       -0.056       0.136
                 |
         1.metro |      0.032      0.049     0.66   0.512       -0.063       0.127
        1.female |     -0.126      0.028    -4.45   0.000       -0.182      -0.071
                 |
            age4 |
              2  |     -0.117      0.050    -2.35   0.019       -0.215      -0.020
              3  |     -0.173      0.053    -3.26   0.001       -0.277      -0.069
              4  |     -0.178      0.062    -2.88   0.004       -0.298      -0.057
                 |
           race4 |
              2  |     -0.032      0.051    -0.63   0.529       -0.132       0.068
              3  |     -0.049      0.061    -0.82   0.414       -0.168       0.069
              4  |      0.029      0.046     0.62   0.534       -0.062       0.119
                 |
          hhsize |
              2  |     -0.076      0.050    -1.52   0.130       -0.175       0.022
              3  |     -0.103      0.055    -1.86   0.063       -0.211       0.006
              4  |      0.012      0.062     0.19   0.851       -0.109       0.132
              5  |     -0.013      0.068    -0.19   0.850       -0.145       0.120
              6  |     -0.033      0.068    -0.48   0.632       -0.166       0.101
                 |
         marital |
              2  |     -0.053      0.081    -0.65   0.515       -0.213       0.107
              3  |      0.017      0.048     0.36   0.721       -0.077       0.112
              4  |      0.269      0.092     2.92   0.004        0.088       0.449
              5  |      0.011      0.049     0.23   0.817       -0.085       0.107
              6  |      0.078      0.056     1.39   0.165       -0.032       0.188
                 |
           relig |
              2  |     -0.079      0.045    -1.77   0.078       -0.167       0.009
              3  |     -0.163      0.157    -1.04   0.299       -0.470       0.144
              4  |      0.366      0.116     3.16   0.002        0.139       0.593
              5  |      0.095      0.102     0.93   0.352       -0.106       0.296
              6  |     -0.168      0.190    -0.88   0.379       -0.541       0.206
              7  |      0.125      0.120     1.04   0.300       -0.111       0.361
              8  |     -0.365      0.157    -2.33   0.020       -0.673      -0.058
              9  |      0.160      0.071     2.23   0.026        0.020       0.300
             10  |      0.054      0.075     0.72   0.470       -0.093       0.201
             11  |      0.089      0.050     1.76   0.078       -0.010       0.188
             12  |     -0.037      0.040    -0.91   0.363       -0.116       0.042
             13  |      0.090      0.108     0.83   0.404       -0.121       0.301
             14  |      0.088      0.109     0.81   0.420       -0.125       0.301
             15  |      0.093      0.150     0.62   0.533       -0.200       0.387
                 |
           educ4 |
              2  |      0.076      0.067     1.13   0.258       -0.056       0.207
              3  |      0.188      0.064     2.93   0.003        0.062       0.315
              4  |      0.264      0.069     3.83   0.000        0.129       0.399
                 |
          income |
              2  |      0.099      0.140     0.71   0.480       -0.176       0.374
              3  |     -0.017      0.136    -0.12   0.902       -0.283       0.250
              4  |     -0.078      0.120    -0.65   0.516       -0.314       0.157
              5  |      0.027      0.120     0.22   0.823       -0.209       0.263
              6  |     -0.065      0.119    -0.54   0.587       -0.298       0.169
              7  |     -0.046      0.121    -0.38   0.707       -0.283       0.192
              8  |     -0.071      0.126    -0.56   0.573       -0.317       0.176
              9  |     -0.054      0.119    -0.46   0.649       -0.288       0.180
             10  |      0.007      0.120     0.06   0.953       -0.228       0.242
             11  |     -0.051      0.118    -0.43   0.667       -0.282       0.181
             12  |     -0.034      0.126    -0.27   0.788       -0.282       0.214
             13  |      0.070      0.119     0.59   0.558       -0.163       0.303
             14  |     -0.011      0.119    -0.09   0.925       -0.246       0.223
             15  |     -0.062      0.127    -0.49   0.624       -0.311       0.186
             16  |     -0.035      0.130    -0.27   0.790       -0.290       0.220
             17  |      0.224      0.140     1.60   0.110       -0.051       0.499
             18  |      0.069      0.132     0.52   0.602       -0.190       0.328
                 |
         housing |
              2  |      0.061      0.041     1.49   0.137       -0.020       0.143
              3  |     -0.009      0.106    -0.08   0.933       -0.216       0.198
                 |
       home_type |
              2  |     -0.091      0.048    -1.91   0.056       -0.184       0.002
              3  |     -0.095      0.046    -2.09   0.037       -0.185      -0.006
              4  |      0.185      0.077     2.41   0.016        0.035       0.336
              5  |     -0.215      0.187    -1.15   0.249       -0.581       0.151
                 |
      1.internet |      0.013      0.050     0.26   0.793       -0.084       0.110
                 |
    phoneservice |
              2  |     -0.048      0.076    -0.63   0.528       -0.196       0.100
              3  |     -0.006      0.080    -0.08   0.938       -0.163       0.150
              4  |     -0.039      0.075    -0.52   0.602       -0.187       0.108
              5  |      0.099      0.170     0.58   0.559       -0.234       0.433
                 |
          device |
     Smartphone  |     -0.112      0.032    -3.48   0.001       -0.175      -0.049
         Tablet  |     -0.021      0.060    -0.35   0.728       -0.139       0.097
                 |
          durint |
       1-3 mins  |     -0.255      0.126    -2.01   0.044       -0.502      -0.007
       4-6 mins  |     -0.278      0.128    -2.16   0.031       -0.530      -0.026
       7-9 mins  |     -0.235      0.140    -1.68   0.094       -0.509       0.040
10 or more mins  |     -0.315      0.135    -2.34   0.019       -0.579      -0.051
                 |
           treat |
             ic  |      0.024      0.072     0.33   0.740       -0.118       0.166
            irl  |     -0.022      0.075    -0.30   0.766       -0.169       0.124
                 |
        partyid7 |     -0.001      0.012    -0.11   0.916       -0.025       0.022
                 |
treat#c.partyid7 |
             ic  |     -0.028      0.017    -1.68   0.093       -0.060       0.005
            irl  |     -0.008      0.017    -0.45   0.650       -0.041       0.026
                 |
           _cons |      0.881      0.203     4.35   0.000        0.484       1.279
----------------------------------------------------------------------------------

Predictive margins                              Number of obs     =      2,009
Model VCE    : Robust

Expression   : Linear prediction, predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.491      0.023    21.01   0.000        0.445       0.537
         ic  |      0.408      0.024    16.86   0.000        0.361       0.455
        irl  |      0.439      0.025    17.28   0.000        0.389       0.488
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,009
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.083      0.034    -2.44   0.015       -0.149      -0.016
        irl  |     -0.052      0.034    -1.51   0.131       -0.120       0.015
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,009
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 1.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.083      0.034     2.44   0.015        0.016       0.149
        irl  |      0.031      0.035     0.87   0.384       -0.038       0.099
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,009
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : partyid7

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    partyid7 |     -0.013      0.008    -1.61   0.108       -0.029       0.003
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,009
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : partyid7

1._at        : treat           =           1

2._at        : treat           =           2

3._at        : treat           =           3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
partyid7     |
         _at |
          1  |     -0.001      0.012    -0.11   0.916       -0.025       0.022
          2  |     -0.029      0.012    -2.35   0.019       -0.053      -0.005
          3  |     -0.009      0.014    -0.66   0.509       -0.036       0.018
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,009
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.treat 3.treat

1._at        : partyid7        =           1

2._at        : partyid7        =           2

3._at        : partyid7        =           3

4._at        : partyid7        =           4

5._at        : partyid7        =           5

6._at        : partyid7        =           6

7._at        : partyid7        =           7

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1.treat      |  (base outcome)
-------------+----------------------------------------------------------------
2.treat      |
         _at |
          1  |     -0.004      0.058    -0.07   0.948       -0.118       0.111
          2  |     -0.032      0.046    -0.69   0.491       -0.122       0.058
          3  |     -0.059      0.037    -1.61   0.107       -0.132       0.013
          4  |     -0.087      0.034    -2.57   0.010       -0.154      -0.021
          5  |     -0.115      0.039    -2.97   0.003       -0.191      -0.039
          6  |     -0.143      0.049    -2.92   0.004       -0.239      -0.047
          7  |     -0.171      0.062    -2.76   0.006       -0.292      -0.049
-------------+----------------------------------------------------------------
3.treat      |
         _at |
          1  |     -0.030      0.060    -0.50   0.617       -0.148       0.088
          2  |     -0.038      0.047    -0.80   0.421       -0.130       0.054
          3  |     -0.046      0.038    -1.22   0.224       -0.119       0.028
          4  |     -0.053      0.035    -1.55   0.122       -0.121       0.014
          5  |     -0.061      0.040    -1.55   0.122       -0.139       0.016
          6  |     -0.069      0.050    -1.37   0.170       -0.168       0.030
          7  |     -0.077      0.064    -1.20   0.229       -0.202       0.048
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.
(sum of wgt is 2,011.2303007225)

Linear regression                               Number of obs     =      2,012
                                                F(74, 1937)       =       3.12
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1265
                                                Root MSE          =     .41235

----------------------------------------------------------------------------------
                 |               Robust
             col |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
         region4 |
              2  |      0.046      0.042     1.11   0.269       -0.036       0.127
              3  |      0.019      0.038     0.49   0.621       -0.056       0.093
              4  |      0.068      0.042     1.62   0.105       -0.014       0.151
                 |
         1.metro |      0.045      0.043     1.05   0.295       -0.039       0.128
        1.female |     -0.033      0.026    -1.30   0.195       -0.083       0.017
                 |
            age4 |
              2  |     -0.067      0.047    -1.41   0.157       -0.160       0.026
              3  |     -0.126      0.050    -2.50   0.012       -0.225      -0.027
              4  |     -0.166      0.056    -2.95   0.003       -0.277      -0.056
                 |
           race4 |
              2  |      0.018      0.043     0.42   0.678       -0.066       0.101
              3  |      0.001      0.056     0.02   0.986       -0.108       0.110
              4  |     -0.047      0.039    -1.18   0.236       -0.124       0.031
                 |
          hhsize |
              2  |     -0.037      0.045    -0.82   0.415       -0.125       0.052
              3  |     -0.070      0.048    -1.46   0.144       -0.164       0.024
              4  |     -0.023      0.057    -0.41   0.685       -0.136       0.089
              5  |     -0.044      0.062    -0.72   0.472       -0.165       0.077
              6  |      0.024      0.059     0.40   0.691       -0.093       0.140
                 |
         marital |
              2  |      0.064      0.071     0.90   0.366       -0.075       0.203
              3  |     -0.009      0.038    -0.25   0.805       -0.084       0.065
              4  |      0.230      0.116     1.97   0.049        0.001       0.458
              5  |      0.038      0.046     0.83   0.406       -0.052       0.129
              6  |      0.094      0.053     1.79   0.073       -0.009       0.198
                 |
           relig |
              2  |     -0.022      0.039    -0.58   0.560       -0.098       0.053
              3  |     -0.114      0.092    -1.24   0.216       -0.294       0.066
              4  |      0.363      0.140     2.58   0.010        0.088       0.638
              5  |      0.071      0.099     0.71   0.476       -0.124       0.266
              6  |     -0.030      0.207    -0.15   0.883       -0.437       0.376
              7  |     -0.029      0.110    -0.27   0.790       -0.245       0.187
              8  |     -0.278      0.092    -3.02   0.003       -0.458      -0.097
              9  |      0.106      0.064     1.65   0.098       -0.020       0.233
             10  |      0.032      0.064     0.50   0.621       -0.093       0.156
             11  |      0.097      0.045     2.18   0.029        0.010       0.184
             12  |      0.009      0.037     0.26   0.798       -0.062       0.081
             13  |      0.208      0.115     1.82   0.070       -0.017       0.434
             14  |      0.112      0.094     1.19   0.233       -0.072       0.296
             15  |      0.256      0.137     1.88   0.061       -0.012       0.524
                 |
           educ4 |
              2  |     -0.073      0.062    -1.18   0.239       -0.194       0.048
              3  |     -0.025      0.060    -0.43   0.670       -0.142       0.092
              4  |      0.107      0.063     1.68   0.092       -0.017       0.231
                 |
          income |
              2  |      0.018      0.131     0.14   0.889       -0.238       0.275
              3  |     -0.022      0.118    -0.18   0.854       -0.254       0.211
              4  |     -0.114      0.098    -1.16   0.245       -0.308       0.079
              5  |     -0.068      0.098    -0.69   0.489       -0.260       0.124
              6  |     -0.055      0.098    -0.56   0.573       -0.247       0.137
              7  |     -0.020      0.105    -0.19   0.852       -0.226       0.187
              8  |     -0.040      0.102    -0.40   0.690       -0.240       0.159
              9  |     -0.097      0.094    -1.03   0.304       -0.282       0.088
             10  |      0.031      0.096     0.32   0.750       -0.158       0.219
             11  |     -0.106      0.093    -1.14   0.255       -0.289       0.077
             12  |     -0.021      0.109    -0.19   0.851       -0.235       0.194
             13  |      0.009      0.096     0.09   0.926       -0.180       0.197
             14  |     -0.045      0.096    -0.47   0.641       -0.234       0.144
             15  |     -0.077      0.100    -0.77   0.443       -0.272       0.119
             16  |     -0.076      0.105    -0.72   0.469       -0.282       0.130
             17  |      0.182      0.140     1.30   0.193       -0.092       0.455
             18  |     -0.036      0.110    -0.33   0.743       -0.253       0.180
                 |
         housing |
              2  |      0.052      0.038     1.36   0.174       -0.023       0.128
              3  |     -0.026      0.096    -0.27   0.787       -0.215       0.163
                 |
       home_type |
              2  |     -0.043      0.041    -1.05   0.294       -0.123       0.037
              3  |     -0.094      0.041    -2.30   0.022       -0.175      -0.014
              4  |      0.076      0.074     1.02   0.309       -0.070       0.221
              5  |     -0.182      0.116    -1.58   0.115       -0.409       0.044
                 |
      1.internet |     -0.019      0.048    -0.40   0.689       -0.113       0.074
                 |
    phoneservice |
              2  |     -0.097      0.066    -1.46   0.144       -0.227       0.033
              3  |     -0.070      0.069    -1.00   0.316       -0.206       0.067
              4  |     -0.088      0.068    -1.30   0.193       -0.220       0.044
              5  |     -0.279      0.113    -2.47   0.014       -0.500      -0.057
                 |
          device |
     Smartphone  |     -0.032      0.029    -1.12   0.262       -0.088       0.024
         Tablet  |      0.034      0.050     0.68   0.497       -0.064       0.131
                 |
          durint |
       1-3 mins  |     -0.246      0.159    -1.55   0.122       -0.559       0.066
       4-6 mins  |     -0.230      0.161    -1.43   0.154       -0.546       0.086
       7-9 mins  |     -0.296      0.165    -1.79   0.074       -0.620       0.028
10 or more mins  |     -0.342      0.164    -2.09   0.036       -0.663      -0.022
                 |
           treat |
             ic  |     -0.052      0.030    -1.72   0.086       -0.110       0.007
            irl  |     -0.055      0.031    -1.78   0.075       -0.115       0.006
                 |
           _cons |      0.723      0.199     3.64   0.000        0.334       1.113
----------------------------------------------------------------------------------

Predictive margins                              Number of obs     =      2,012
Model VCE    : Robust

Expression   : Linear prediction, predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.284      0.022    12.83   0.000        0.240       0.327
         ic  |      0.232      0.020    11.40   0.000        0.192       0.272
        irl  |      0.229      0.022    10.54   0.000        0.186       0.272
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,012
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.052      0.030    -1.72   0.086       -0.110       0.007
        irl  |     -0.055      0.031    -1.78   0.075       -0.115       0.006
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,012
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 1.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.052      0.030     1.72   0.086       -0.007       0.110
        irl  |     -0.003      0.030    -0.11   0.912       -0.062       0.055
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.
(sum of wgt is 2,003.3937954824)

Linear regression                               Number of obs     =      2,005
                                                F(73, 1931)       =       3.46
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1320
                                                Root MSE          =     .41005

----------------------------------------------------------------------------------
                 |               Robust
             col |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
         region4 |
              2  |      0.052      0.042     1.22   0.223       -0.031       0.135
              3  |      0.033      0.039     0.85   0.395       -0.043       0.110
              4  |      0.077      0.043     1.80   0.072       -0.007       0.162
                 |
         1.metro |      0.046      0.042     1.08   0.278       -0.037       0.128
        1.female |     -0.040      0.026    -1.58   0.114       -0.091       0.010
                 |
            age4 |
              2  |     -0.071      0.047    -1.51   0.132       -0.164       0.021
              3  |     -0.122      0.050    -2.42   0.016       -0.220      -0.023
              4  |     -0.166      0.056    -2.95   0.003       -0.276      -0.056
                 |
           race4 |
              2  |     -0.024      0.046    -0.52   0.602       -0.114       0.066
              3  |     -0.019      0.055    -0.34   0.734       -0.126       0.089
              4  |     -0.071      0.040    -1.78   0.076       -0.150       0.007
                 |
          hhsize |
              2  |     -0.045      0.046    -0.98   0.328       -0.134       0.045
              3  |     -0.073      0.048    -1.51   0.131       -0.167       0.022
              4  |     -0.021      0.058    -0.36   0.718       -0.135       0.093
              5  |     -0.054      0.061    -0.88   0.377       -0.173       0.066
              6  |      0.025      0.060     0.41   0.680       -0.093       0.142
                 |
         marital |
              2  |      0.049      0.072     0.68   0.499       -0.093       0.190
              3  |     -0.020      0.038    -0.54   0.588       -0.095       0.054
              4  |      0.252      0.109     2.32   0.021        0.039       0.466
              5  |      0.016      0.047     0.33   0.738       -0.077       0.108
              6  |      0.084      0.053     1.60   0.111       -0.019       0.188
                 |
           relig |
              2  |     -0.031      0.039    -0.80   0.426       -0.107       0.045
              3  |     -0.131      0.094    -1.38   0.166       -0.316       0.054
              4  |      0.353      0.142     2.49   0.013        0.074       0.632
              5  |      0.060      0.099     0.61   0.542       -0.133       0.254
              6  |     -0.042      0.219    -0.19   0.847       -0.472       0.387
              7  |     -0.045      0.105    -0.43   0.671       -0.251       0.162
              8  |     -0.284      0.094    -3.01   0.003       -0.469      -0.099
              9  |      0.064      0.066     0.97   0.334       -0.065       0.193
             10  |      0.001      0.065     0.01   0.993       -0.128       0.129
             11  |      0.078      0.045     1.73   0.084       -0.010       0.167
             12  |      0.009      0.037     0.25   0.802       -0.062       0.081
             13  |      0.176      0.114     1.55   0.122       -0.047       0.400
             14  |      0.084      0.092     0.91   0.362       -0.097       0.265
             15  |      0.189      0.142     1.33   0.183       -0.089       0.468
                 |
           educ4 |
              2  |     -0.065      0.061    -1.06   0.289       -0.186       0.055
              3  |     -0.024      0.059    -0.40   0.689       -0.140       0.092
              4  |      0.108      0.064     1.70   0.090       -0.017       0.233
                 |
          income |
              2  |      0.028      0.131     0.21   0.831       -0.229       0.285
              3  |     -0.006      0.120    -0.05   0.960       -0.240       0.228
              4  |     -0.110      0.101    -1.09   0.276       -0.307       0.088
              5  |     -0.063      0.099    -0.64   0.521       -0.257       0.130
              6  |     -0.049      0.100    -0.49   0.622       -0.246       0.147
              7  |     -0.014      0.106    -0.13   0.895       -0.223       0.195
              8  |     -0.044      0.102    -0.43   0.666       -0.244       0.156
              9  |     -0.091      0.097    -0.94   0.348       -0.281       0.099
             10  |      0.051      0.097     0.53   0.597       -0.140       0.243
             11  |     -0.103      0.095    -1.08   0.281       -0.290       0.084
             12  |     -0.006      0.111    -0.05   0.960       -0.223       0.212
             13  |      0.025      0.097     0.26   0.795       -0.166       0.216
             14  |     -0.035      0.098    -0.36   0.719       -0.227       0.157
             15  |     -0.055      0.101    -0.55   0.584       -0.253       0.143
             16  |     -0.061      0.105    -0.57   0.565       -0.267       0.146
             17  |      0.194      0.141     1.38   0.168       -0.082       0.471
             18  |     -0.029      0.112    -0.26   0.794       -0.249       0.190
                 |
         housing |
              2  |      0.050      0.038     1.32   0.187       -0.024       0.125
              3  |     -0.008      0.094    -0.09   0.930       -0.194       0.177
                 |
       home_type |
              2  |     -0.033      0.041    -0.79   0.428       -0.114       0.048
              3  |     -0.094      0.041    -2.28   0.023       -0.176      -0.013
              4  |      0.079      0.072     1.10   0.274       -0.063       0.221
              5  |     -0.216      0.122    -1.77   0.077       -0.455       0.023
                 |
      1.internet |     -0.030      0.047    -0.62   0.534       -0.123       0.064
                 |
    phoneservice |
              2  |     -0.103      0.067    -1.54   0.123       -0.235       0.028
              3  |     -0.072      0.070    -1.03   0.304       -0.209       0.065
              4  |     -0.087      0.068    -1.27   0.206       -0.221       0.048
              5  |     -0.269      0.116    -2.33   0.020       -0.496      -0.042
                 |
          device |
     Smartphone  |     -0.030      0.029    -1.04   0.300       -0.086       0.027
         Tablet  |      0.035      0.049     0.71   0.479       -0.062       0.132
                 |
          durint |
       1-3 mins  |     -0.292      0.152    -1.92   0.055       -0.589       0.006
       4-6 mins  |     -0.277      0.153    -1.81   0.071       -0.577       0.024
       7-9 mins  |     -0.350      0.158    -2.22   0.027       -0.660      -0.040
10 or more mins  |     -0.389      0.156    -2.49   0.013       -0.696      -0.082
                 |
        partyid7 |     -0.021      0.007    -2.88   0.004       -0.035      -0.007
           _cons |      0.835      0.203     4.12   0.000        0.438       1.233
----------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,005
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : partyid7

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    partyid7 |     -0.021      0.007    -2.88   0.004       -0.035      -0.007
------------------------------------------------------------------------------
(sum of wgt is 2,003.3937954824)

Linear regression                               Number of obs     =      2,005
                                                F(77, 1927)       =       3.41
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1363
                                                Root MSE          =     .40945

----------------------------------------------------------------------------------
                 |               Robust
             col |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
         region4 |
              2  |      0.051      0.042     1.22   0.222       -0.031       0.132
              3  |      0.034      0.039     0.89   0.374       -0.041       0.110
              4  |      0.081      0.042     1.91   0.056       -0.002       0.164
                 |
         1.metro |      0.049      0.042     1.17   0.242       -0.033       0.131
        1.female |     -0.040      0.026    -1.58   0.115       -0.090       0.010
                 |
            age4 |
              2  |     -0.071      0.047    -1.53   0.126       -0.163       0.020
              3  |     -0.123      0.050    -2.49   0.013       -0.221      -0.026
              4  |     -0.169      0.055    -3.04   0.002       -0.277      -0.060
                 |
           race4 |
              2  |     -0.018      0.046    -0.40   0.690       -0.108       0.071
              3  |     -0.013      0.055    -0.24   0.811       -0.121       0.095
              4  |     -0.067      0.040    -1.71   0.088       -0.145       0.010
                 |
          hhsize |
              2  |     -0.048      0.045    -1.07   0.286       -0.136       0.040
              3  |     -0.077      0.048    -1.62   0.106       -0.171       0.016
              4  |     -0.027      0.058    -0.48   0.634       -0.140       0.086
              5  |     -0.056      0.061    -0.92   0.357       -0.175       0.063
              6  |      0.012      0.059     0.20   0.838       -0.104       0.128
                 |
         marital |
              2  |      0.050      0.071     0.70   0.483       -0.089       0.188
              3  |     -0.017      0.038    -0.46   0.646       -0.091       0.057
              4  |      0.250      0.111     2.25   0.024        0.032       0.467
              5  |      0.013      0.047     0.29   0.775       -0.078       0.105
              6  |      0.087      0.053     1.64   0.101       -0.017       0.192
                 |
           relig |
              2  |     -0.027      0.039    -0.69   0.488       -0.103       0.049
              3  |     -0.134      0.096    -1.39   0.163       -0.323       0.055
              4  |      0.340      0.147     2.32   0.021        0.052       0.627
              5  |      0.056      0.096     0.58   0.561       -0.132       0.243
              6  |     -0.048      0.209    -0.23   0.819       -0.457       0.362
              7  |     -0.038      0.105    -0.36   0.716       -0.245       0.168
              8  |     -0.297      0.095    -3.13   0.002       -0.483      -0.111
              9  |      0.070      0.065     1.07   0.285       -0.058       0.198
             10  |      0.008      0.064     0.13   0.900       -0.118       0.135
             11  |      0.079      0.045     1.75   0.081       -0.010       0.168
             12  |      0.008      0.036     0.22   0.823       -0.063       0.080
             13  |      0.165      0.114     1.45   0.148       -0.059       0.389
             14  |      0.088      0.093     0.95   0.340       -0.093       0.270
             15  |      0.202      0.142     1.43   0.154       -0.076       0.480
                 |
           educ4 |
              2  |     -0.068      0.061    -1.12   0.262       -0.187       0.051
              3  |     -0.027      0.059    -0.47   0.640       -0.142       0.087
              4  |      0.102      0.063     1.62   0.105       -0.021       0.225
                 |
          income |
              2  |      0.022      0.131     0.17   0.865       -0.235       0.279
              3  |     -0.017      0.120    -0.14   0.886       -0.252       0.217
              4  |     -0.116      0.101    -1.15   0.249       -0.313       0.081
              5  |     -0.071      0.099    -0.72   0.474       -0.266       0.124
              6  |     -0.062      0.101    -0.62   0.535       -0.260       0.135
              7  |     -0.030      0.105    -0.28   0.776       -0.235       0.176
              8  |     -0.058      0.103    -0.57   0.570       -0.260       0.143
              9  |     -0.102      0.097    -1.05   0.292       -0.292       0.088
             10  |      0.037      0.098     0.38   0.704       -0.155       0.230
             11  |     -0.107      0.095    -1.12   0.263       -0.294       0.080
             12  |     -0.020      0.110    -0.18   0.859       -0.235       0.196
             13  |      0.013      0.097     0.13   0.895       -0.178       0.204
             14  |     -0.045      0.098    -0.46   0.649       -0.238       0.148
             15  |     -0.068      0.102    -0.67   0.505       -0.267       0.131
             16  |     -0.069      0.106    -0.65   0.514       -0.277       0.139
             17  |      0.184      0.140     1.31   0.189       -0.090       0.458
             18  |     -0.041      0.112    -0.37   0.714       -0.261       0.179
                 |
         housing |
              2  |      0.050      0.038     1.32   0.186       -0.024       0.125
              3  |     -0.005      0.094    -0.06   0.954       -0.189       0.178
                 |
       home_type |
              2  |     -0.038      0.041    -0.92   0.359       -0.119       0.043
              3  |     -0.094      0.041    -2.30   0.022       -0.175      -0.014
              4  |      0.075      0.072     1.04   0.299       -0.067       0.217
              5  |     -0.185      0.125    -1.47   0.141       -0.431       0.061
                 |
      1.internet |     -0.026      0.048    -0.54   0.588       -0.120       0.068
                 |
    phoneservice |
              2  |     -0.101      0.065    -1.56   0.119       -0.229       0.026
              3  |     -0.075      0.068    -1.10   0.273       -0.208       0.059
              4  |     -0.086      0.066    -1.30   0.192       -0.216       0.043
              5  |     -0.271      0.112    -2.42   0.016       -0.490      -0.051
                 |
          device |
     Smartphone  |     -0.035      0.028    -1.23   0.219       -0.091       0.021
         Tablet  |      0.032      0.049     0.66   0.508       -0.063       0.127
                 |
          durint |
       1-3 mins  |     -0.292      0.152    -1.92   0.055       -0.590       0.006
       4-6 mins  |     -0.279      0.153    -1.82   0.068       -0.580       0.021
       7-9 mins  |     -0.349      0.158    -2.20   0.028       -0.660      -0.038
10 or more mins  |     -0.392      0.157    -2.51   0.012       -0.700      -0.085
                 |
           treat |
             ic  |     -0.096      0.064    -1.50   0.135       -0.221       0.030
            irl  |     -0.137      0.065    -2.11   0.035       -0.264      -0.010
                 |
        partyid7 |     -0.032      0.011    -2.96   0.003       -0.053      -0.011
                 |
treat#c.partyid7 |
             ic  |      0.013      0.014     0.92   0.358       -0.014       0.040
            irl  |      0.023      0.015     1.58   0.114       -0.006       0.052
                 |
           _cons |      0.921      0.204     4.52   0.000        0.521       1.320
----------------------------------------------------------------------------------

Predictive margins                              Number of obs     =      2,005
Model VCE    : Robust

Expression   : Linear prediction, predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.278      0.022    12.72   0.000        0.235       0.321
         ic  |      0.232      0.021    11.28   0.000        0.191       0.272
        irl  |      0.231      0.022    10.63   0.000        0.189       0.274
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,005
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.046      0.030    -1.55   0.121       -0.105       0.012
        irl  |     -0.047      0.031    -1.52   0.128       -0.107       0.014
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,005
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 1.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.046      0.030     1.55   0.121       -0.012       0.105
        irl  |     -0.000      0.030    -0.01   0.990       -0.059       0.059
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,005
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : partyid7

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    partyid7 |     -0.020      0.007    -2.83   0.005       -0.034      -0.006
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,005
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : partyid7

1._at        : treat           =           1

2._at        : treat           =           2

3._at        : treat           =           3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
partyid7     |
         _at |
          1  |     -0.032      0.011    -2.96   0.003       -0.053      -0.011
          2  |     -0.019      0.010    -1.82   0.070       -0.039       0.002
          3  |     -0.008      0.012    -0.71   0.479       -0.031       0.015
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,005
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.treat 3.treat

1._at        : partyid7        =           1

2._at        : partyid7        =           2

3._at        : partyid7        =           3

4._at        : partyid7        =           4

5._at        : partyid7        =           5

6._at        : partyid7        =           6

7._at        : partyid7        =           7

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1.treat      |  (base outcome)
-------------+----------------------------------------------------------------
2.treat      |
         _at |
          1  |     -0.083      0.052    -1.59   0.111       -0.185       0.019
          2  |     -0.070      0.041    -1.69   0.090       -0.151       0.011
          3  |     -0.057      0.033    -1.72   0.085       -0.122       0.008
          4  |     -0.044      0.030    -1.49   0.136       -0.103       0.014
          5  |     -0.032      0.032    -0.97   0.331       -0.095       0.032
          6  |     -0.019      0.040    -0.47   0.641       -0.097       0.060
          7  |     -0.006      0.051    -0.12   0.906       -0.105       0.093
-------------+----------------------------------------------------------------
3.treat      |
         _at |
          1  |     -0.113      0.052    -2.17   0.030       -0.216      -0.011
          2  |     -0.090      0.041    -2.18   0.029       -0.171      -0.009
          3  |     -0.066      0.033    -2.00   0.046       -0.132      -0.001
          4  |     -0.043      0.031    -1.40   0.163       -0.103       0.017
          5  |     -0.020      0.035    -0.56   0.577       -0.088       0.049
          6  |      0.004      0.044     0.09   0.931       -0.083       0.091
          7  |      0.027      0.056     0.49   0.626       -0.082       0.137
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.
(sum of wgt is 2,011.1671752376)

Linear regression                               Number of obs     =      2,009
                                                F(74, 1934)       =       5.26
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1812
                                                Root MSE          =     .46054

----------------------------------------------------------------------------------
                 |               Robust
             lib |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
         region4 |
              2  |     -0.003      0.044    -0.08   0.938       -0.090       0.083
              3  |     -0.089      0.042    -2.14   0.032       -0.171      -0.007
              4  |      0.027      0.045     0.59   0.556       -0.062       0.115
                 |
         1.metro |      0.053      0.048     1.10   0.271       -0.042       0.148
        1.female |      0.001      0.029     0.05   0.960       -0.056       0.059
                 |
            age4 |
              2  |     -0.108      0.049    -2.19   0.028       -0.205      -0.011
              3  |     -0.200      0.053    -3.79   0.000       -0.304      -0.096
              4  |     -0.164      0.061    -2.67   0.008       -0.285      -0.044
                 |
           race4 |
              2  |      0.004      0.051     0.08   0.938       -0.097       0.105
              3  |      0.013      0.052     0.25   0.802       -0.090       0.116
              4  |     -0.082      0.044    -1.88   0.061       -0.167       0.004
                 |
          hhsize |
              2  |     -0.098      0.046    -2.13   0.033       -0.189      -0.008
              3  |     -0.172      0.053    -3.27   0.001       -0.275      -0.069
              4  |     -0.139      0.058    -2.39   0.017       -0.252      -0.025
              5  |     -0.028      0.063    -0.44   0.660       -0.151       0.096
              6  |     -0.123      0.062    -1.99   0.046       -0.244      -0.002
                 |
         marital |
              2  |     -0.061      0.067    -0.91   0.360       -0.193       0.070
              3  |     -0.023      0.046    -0.50   0.620       -0.114       0.068
              4  |     -0.084      0.129    -0.65   0.518       -0.338       0.170
              5  |     -0.025      0.049    -0.51   0.612       -0.120       0.071
              6  |     -0.010      0.058    -0.17   0.866       -0.123       0.103
                 |
           relig |
              2  |      0.046      0.044     1.04   0.300       -0.041       0.132
              3  |     -0.070      0.150    -0.46   0.642       -0.364       0.224
              4  |      0.133      0.151     0.88   0.377       -0.162       0.429
              5  |      0.101      0.097     1.04   0.299       -0.089       0.291
              6  |      0.055      0.183     0.30   0.766       -0.305       0.414
              7  |     -0.151      0.127    -1.19   0.236       -0.400       0.099
              8  |     -0.162      0.171    -0.94   0.346       -0.497       0.174
              9  |      0.255      0.060     4.23   0.000        0.137       0.373
             10  |      0.132      0.070     1.89   0.059       -0.005       0.268
             11  |      0.199      0.049     4.04   0.000        0.102       0.295
             12  |     -0.022      0.041    -0.52   0.601       -0.102       0.059
             13  |      0.087      0.118     0.74   0.458       -0.143       0.318
             14  |      0.086      0.105     0.82   0.411       -0.119       0.292
             15  |     -0.157      0.109    -1.44   0.151       -0.371       0.057
                 |
           educ4 |
              2  |     -0.064      0.062    -1.04   0.299       -0.186       0.057
              3  |      0.050      0.059     0.85   0.394       -0.066       0.166
              4  |      0.197      0.063     3.14   0.002        0.074       0.319
                 |
          income |
              2  |     -0.194      0.138    -1.41   0.160       -0.464       0.076
              3  |     -0.198      0.133    -1.49   0.136       -0.459       0.063
              4  |     -0.127      0.126    -1.00   0.316       -0.374       0.121
              5  |     -0.094      0.118    -0.79   0.429       -0.326       0.139
              6  |     -0.176      0.122    -1.44   0.150       -0.415       0.064
              7  |     -0.073      0.124    -0.59   0.556       -0.316       0.170
              8  |     -0.159      0.129    -1.24   0.216       -0.411       0.093
              9  |     -0.248      0.117    -2.13   0.033       -0.477      -0.019
             10  |     -0.125      0.115    -1.08   0.279       -0.351       0.101
             11  |     -0.117      0.119    -0.99   0.323       -0.351       0.116
             12  |     -0.149      0.126    -1.18   0.240       -0.396       0.099
             13  |     -0.085      0.118    -0.72   0.471       -0.316       0.146
             14  |     -0.152      0.121    -1.26   0.209       -0.389       0.085
             15  |     -0.168      0.122    -1.38   0.169       -0.407       0.071
             16  |     -0.145      0.133    -1.09   0.275       -0.406       0.116
             17  |     -0.151      0.152    -1.00   0.320       -0.449       0.147
             18  |     -0.022      0.128    -0.17   0.863       -0.273       0.229
                 |
         housing |
              2  |     -0.013      0.041    -0.33   0.742       -0.094       0.067
              3  |      0.135      0.092     1.47   0.141       -0.045       0.315
                 |
       home_type |
              2  |     -0.064      0.051    -1.26   0.209       -0.164       0.036
              3  |      0.007      0.044     0.17   0.869       -0.079       0.093
              4  |      0.037      0.076     0.49   0.626       -0.112       0.186
              5  |      0.143      0.256     0.56   0.579       -0.361       0.646
                 |
      1.internet |      0.030      0.052     0.58   0.563       -0.071       0.131
                 |
    phoneservice |
              2  |      0.076      0.071     1.07   0.284       -0.063       0.215
              3  |      0.037      0.076     0.49   0.624       -0.112       0.187
              4  |      0.102      0.070     1.45   0.147       -0.036       0.240
              5  |     -0.022      0.192    -0.12   0.908       -0.399       0.354
                 |
          device |
     Smartphone  |     -0.115      0.031    -3.67   0.000       -0.177      -0.054
         Tablet  |      0.038      0.058     0.66   0.511       -0.075       0.151
                 |
          durint |
       1-3 mins  |      0.200      0.148     1.35   0.178       -0.091       0.491
       4-6 mins  |      0.224      0.151     1.48   0.138       -0.072       0.520
       7-9 mins  |      0.149      0.160     0.93   0.352       -0.165       0.464
10 or more mins  |      0.182      0.157     1.16   0.245       -0.125       0.490
                 |
           treat |
             ic  |     -0.035      0.034    -1.03   0.303       -0.101       0.031
            irl  |      0.009      0.034     0.27   0.790       -0.058       0.076
                 |
           _cons |      0.554      0.222     2.49   0.013        0.118       0.990
----------------------------------------------------------------------------------

Predictive margins                              Number of obs     =      2,009
Model VCE    : Robust

Expression   : Linear prediction, predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.534      0.024    22.28   0.000        0.487       0.581
         ic  |      0.499      0.024    21.02   0.000        0.453       0.546
        irl  |      0.543      0.024    22.77   0.000        0.496       0.590
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,009
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.035      0.034    -1.03   0.303       -0.101       0.031
        irl  |      0.009      0.034     0.27   0.790       -0.058       0.076
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,009
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 1.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.035      0.034     1.03   0.303       -0.031       0.101
        irl  |      0.044      0.034     1.30   0.194       -0.022       0.110
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.
(sum of wgt is 2,003.3306699975)

Linear regression                               Number of obs     =      2,002
                                                F(73, 1928)       =       5.62
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1842
                                                Root MSE          =     .45953

----------------------------------------------------------------------------------
                 |               Robust
             lib |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
         region4 |
              2  |     -0.003      0.044    -0.06   0.951       -0.089       0.084
              3  |     -0.081      0.042    -1.92   0.055       -0.164       0.002
              4  |      0.031      0.045     0.68   0.496       -0.058       0.120
                 |
         1.metro |      0.057      0.048     1.17   0.241       -0.038       0.151
        1.female |     -0.007      0.029    -0.24   0.814       -0.064       0.050
                 |
            age4 |
              2  |     -0.109      0.050    -2.20   0.028       -0.206      -0.012
              3  |     -0.200      0.052    -3.81   0.000       -0.303      -0.097
              4  |     -0.171      0.061    -2.80   0.005       -0.291      -0.051
                 |
           race4 |
              2  |     -0.038      0.054    -0.70   0.483       -0.143       0.068
              3  |      0.004      0.052     0.08   0.934       -0.097       0.105
              4  |     -0.097      0.044    -2.21   0.027       -0.184      -0.011
                 |
          hhsize |
              2  |     -0.105      0.046    -2.26   0.024       -0.196      -0.014
              3  |     -0.176      0.053    -3.34   0.001       -0.280      -0.073
              4  |     -0.137      0.059    -2.33   0.020       -0.252      -0.022
              5  |     -0.046      0.063    -0.74   0.461       -0.170       0.077
              6  |     -0.132      0.062    -2.12   0.034       -0.254      -0.010
                 |
         marital |
              2  |     -0.079      0.065    -1.22   0.224       -0.206       0.048
              3  |     -0.030      0.046    -0.66   0.512       -0.120       0.060
              4  |     -0.087      0.136    -0.64   0.524       -0.354       0.180
              5  |     -0.042      0.049    -0.85   0.393       -0.139       0.055
              6  |     -0.018      0.057    -0.32   0.749       -0.130       0.094
                 |
           relig |
              2  |      0.038      0.044     0.85   0.393       -0.049       0.124
              3  |     -0.075      0.144    -0.53   0.599       -0.357       0.206
              4  |      0.126      0.130     0.97   0.331       -0.128       0.380
              5  |      0.076      0.094     0.81   0.419       -0.109       0.262
              6  |      0.032      0.181     0.18   0.858       -0.322       0.387
              7  |     -0.181      0.120    -1.52   0.130       -0.416       0.053
              8  |     -0.183      0.176    -1.04   0.297       -0.528       0.161
              9  |      0.205      0.063     3.23   0.001        0.081       0.329
             10  |      0.099      0.071     1.40   0.163       -0.040       0.237
             11  |      0.176      0.050     3.52   0.000        0.078       0.274
             12  |     -0.025      0.041    -0.60   0.546       -0.105       0.056
             13  |      0.039      0.115     0.34   0.735       -0.187       0.265
             14  |      0.058      0.106     0.55   0.584       -0.149       0.265
             15  |     -0.133      0.149    -0.90   0.370       -0.424       0.158
                 |
           educ4 |
              2  |     -0.054      0.061    -0.88   0.377       -0.173       0.065
              3  |      0.054      0.058     0.94   0.345       -0.059       0.167
              4  |      0.195      0.061     3.19   0.001        0.075       0.315
                 |
          income |
              2  |     -0.184      0.143    -1.28   0.201       -0.465       0.098
              3  |     -0.194      0.136    -1.42   0.156       -0.461       0.074
              4  |     -0.127      0.131    -0.97   0.332       -0.384       0.130
              5  |     -0.100      0.123    -0.81   0.419       -0.341       0.142
              6  |     -0.174      0.127    -1.37   0.171       -0.423       0.075
              7  |     -0.078      0.129    -0.60   0.546       -0.330       0.175
              8  |     -0.153      0.134    -1.14   0.255       -0.415       0.110
              9  |     -0.255      0.122    -2.08   0.038       -0.495      -0.015
             10  |     -0.122      0.121    -1.01   0.314       -0.359       0.115
             11  |     -0.121      0.124    -0.98   0.328       -0.364       0.122
             12  |     -0.151      0.131    -1.16   0.248       -0.408       0.106
             13  |     -0.076      0.123    -0.62   0.535       -0.317       0.164
             14  |     -0.143      0.126    -1.14   0.255       -0.389       0.103
             15  |     -0.158      0.127    -1.24   0.215       -0.407       0.092
             16  |     -0.132      0.137    -0.97   0.334       -0.400       0.136
             17  |     -0.150      0.153    -0.98   0.326       -0.451       0.150
             18  |     -0.024      0.133    -0.18   0.857       -0.286       0.238
                 |
         housing |
              2  |     -0.019      0.041    -0.47   0.639       -0.100       0.061
              3  |      0.143      0.091     1.57   0.116       -0.035       0.322
                 |
       home_type |
              2  |     -0.057      0.050    -1.13   0.260       -0.156       0.042
              3  |      0.006      0.044     0.14   0.889       -0.081       0.093
              4  |      0.038      0.076     0.51   0.612       -0.110       0.187
              5  |      0.127      0.252     0.50   0.614       -0.367       0.621
                 |
      1.internet |      0.027      0.052     0.53   0.596       -0.074       0.129
                 |
    phoneservice |
              2  |      0.074      0.073     1.01   0.312       -0.069       0.217
              3  |      0.034      0.079     0.43   0.669       -0.120       0.188
              4  |      0.101      0.072     1.40   0.162       -0.041       0.243
              5  |     -0.015      0.193    -0.08   0.937       -0.395       0.364
                 |
          device |
     Smartphone  |     -0.116      0.031    -3.69   0.000       -0.178      -0.055
         Tablet  |      0.040      0.057     0.70   0.486       -0.072       0.152
                 |
          durint |
       1-3 mins  |      0.158      0.156     1.01   0.311       -0.148       0.464
       4-6 mins  |      0.176      0.158     1.11   0.265       -0.134       0.486
       7-9 mins  |      0.097      0.168     0.58   0.561       -0.232       0.426
10 or more mins  |      0.146      0.164     0.89   0.373       -0.175       0.467
                 |
        partyid7 |     -0.023      0.008    -2.99   0.003       -0.038      -0.008
           _cons |      0.707      0.232     3.05   0.002        0.253       1.162
----------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,002
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : partyid7

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    partyid7 |     -0.023      0.008    -2.99   0.003       -0.038      -0.008
------------------------------------------------------------------------------
(sum of wgt is 2,003.3306699975)

Linear regression                               Number of obs     =      2,002
                                                F(77, 1924)       =       5.60
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1874
                                                Root MSE          =     .45912

----------------------------------------------------------------------------------
                 |               Robust
             lib |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
         region4 |
              2  |      0.002      0.044     0.04   0.970       -0.084       0.087
              3  |     -0.082      0.042    -1.95   0.052       -0.164       0.001
              4  |      0.030      0.045     0.66   0.509       -0.058       0.117
                 |
         1.metro |      0.051      0.048     1.07   0.286       -0.043       0.146
        1.female |     -0.006      0.029    -0.19   0.847       -0.063       0.051
                 |
            age4 |
              2  |     -0.110      0.049    -2.22   0.026       -0.207      -0.013
              3  |     -0.198      0.052    -3.79   0.000       -0.301      -0.096
              4  |     -0.169      0.061    -2.78   0.005       -0.289      -0.050
                 |
           race4 |
              2  |     -0.034      0.054    -0.64   0.521       -0.140       0.071
              3  |      0.004      0.052     0.08   0.935       -0.098       0.107
              4  |     -0.094      0.044    -2.15   0.032       -0.180      -0.008
                 |
          hhsize |
              2  |     -0.107      0.046    -2.31   0.021       -0.197      -0.016
              3  |     -0.176      0.053    -3.33   0.001       -0.280      -0.073
              4  |     -0.141      0.058    -2.43   0.015       -0.256      -0.027
              5  |     -0.049      0.062    -0.78   0.436       -0.171       0.074
              6  |     -0.131      0.062    -2.12   0.034       -0.253      -0.010
                 |
         marital |
              2  |     -0.070      0.066    -1.07   0.287       -0.200       0.059
              3  |     -0.030      0.046    -0.65   0.518       -0.119       0.060
              4  |     -0.082      0.136    -0.60   0.548       -0.349       0.185
              5  |     -0.044      0.049    -0.90   0.370       -0.140       0.052
              6  |     -0.016      0.057    -0.29   0.773       -0.128       0.096
                 |
           relig |
              2  |      0.035      0.044     0.80   0.422       -0.051       0.122
              3  |     -0.080      0.143    -0.56   0.575       -0.361       0.201
              4  |      0.147      0.128     1.15   0.250       -0.103       0.398
              5  |      0.085      0.094     0.90   0.367       -0.100       0.270
              6  |      0.027      0.187     0.15   0.885       -0.340       0.394
              7  |     -0.164      0.125    -1.32   0.188       -0.409       0.080
              8  |     -0.188      0.175    -1.08   0.282       -0.531       0.154
              9  |      0.201      0.062     3.23   0.001        0.079       0.323
             10  |      0.099      0.070     1.42   0.155       -0.037       0.235
             11  |      0.173      0.050     3.47   0.001        0.075       0.270
             12  |     -0.023      0.041    -0.57   0.570       -0.103       0.057
             13  |      0.047      0.116     0.41   0.681       -0.179       0.274
             14  |      0.061      0.106     0.58   0.563       -0.146       0.268
             15  |     -0.131      0.144    -0.91   0.364       -0.415       0.152
                 |
           educ4 |
              2  |     -0.053      0.060    -0.89   0.373       -0.171       0.064
              3  |      0.058      0.057     1.02   0.309       -0.054       0.169
              4  |      0.198      0.060     3.30   0.001        0.081       0.316
                 |
          income |
              2  |     -0.183      0.140    -1.31   0.191       -0.457       0.092
              3  |     -0.186      0.132    -1.41   0.158       -0.444       0.072
              4  |     -0.121      0.126    -0.96   0.337       -0.367       0.126
              5  |     -0.105      0.117    -0.90   0.369       -0.336       0.125
              6  |     -0.168      0.122    -1.38   0.167       -0.407       0.071
              7  |     -0.080      0.123    -0.65   0.518       -0.322       0.162
              8  |     -0.148      0.129    -1.14   0.255       -0.401       0.106
              9  |     -0.246      0.117    -2.10   0.036       -0.475      -0.016
             10  |     -0.118      0.116    -1.02   0.310       -0.344       0.109
             11  |     -0.118      0.119    -1.00   0.319       -0.351       0.114
             12  |     -0.143      0.126    -1.14   0.255       -0.390       0.104
             13  |     -0.074      0.118    -0.63   0.531       -0.304       0.157
             14  |     -0.140      0.121    -1.16   0.246       -0.377       0.097
             15  |     -0.157      0.123    -1.28   0.201       -0.399       0.084
             16  |     -0.130      0.133    -0.98   0.327       -0.390       0.130
             17  |     -0.151      0.149    -1.01   0.312       -0.443       0.142
             18  |     -0.017      0.129    -0.13   0.898       -0.270       0.237
                 |
         housing |
              2  |     -0.019      0.041    -0.46   0.644       -0.099       0.061
              3  |      0.146      0.091     1.60   0.110       -0.033       0.325
                 |
       home_type |
              2  |     -0.052      0.050    -1.04   0.297       -0.151       0.046
              3  |      0.008      0.044     0.19   0.852       -0.078       0.094
              4  |      0.041      0.076     0.54   0.590       -0.108       0.191
              5  |      0.098      0.253     0.39   0.697       -0.397       0.594
                 |
      1.internet |      0.025      0.051     0.49   0.626       -0.076       0.126
                 |
    phoneservice |
              2  |      0.078      0.072     1.09   0.277       -0.063       0.219
              3  |      0.038      0.077     0.49   0.622       -0.113       0.189
              4  |      0.103      0.071     1.45   0.146       -0.036       0.243
              5  |      0.004      0.193     0.02   0.984       -0.375       0.383
                 |
          device |
     Smartphone  |     -0.112      0.031    -3.58   0.000       -0.174      -0.051
         Tablet  |      0.039      0.056     0.68   0.493       -0.072       0.149
                 |
          durint |
       1-3 mins  |      0.153      0.151     1.01   0.314       -0.144       0.449
       4-6 mins  |      0.175      0.153     1.14   0.256       -0.126       0.476
       7-9 mins  |      0.086      0.163     0.53   0.599       -0.234       0.405
10 or more mins  |      0.138      0.159     0.87   0.387       -0.175       0.450
                 |
           treat |
             ic  |     -0.058      0.074    -0.79   0.430       -0.202       0.086
            irl  |      0.093      0.069     1.34   0.180       -0.043       0.229
                 |
        partyid7 |     -0.018      0.012    -1.51   0.132       -0.041       0.005
                 |
treat#c.partyid7 |
             ic  |      0.006      0.017     0.35   0.724       -0.028       0.040
            irl  |     -0.021      0.016    -1.30   0.193       -0.053       0.011
                 |
           _cons |      0.692      0.228     3.04   0.002        0.245       1.140
----------------------------------------------------------------------------------

Predictive margins                              Number of obs     =      2,002
Model VCE    : Robust

Expression   : Linear prediction, predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.534      0.024    22.30   0.000        0.487       0.581
         ic  |      0.500      0.024    20.97   0.000        0.453       0.546
        irl  |      0.545      0.023    23.30   0.000        0.500       0.591
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,002
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.034      0.034    -1.02   0.306       -0.101       0.032
        irl  |      0.011      0.034     0.34   0.735       -0.055       0.078
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,002
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 1.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.034      0.034     1.02   0.306       -0.032       0.101
        irl  |      0.046      0.033     1.37   0.170       -0.020       0.112
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,002
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : partyid7

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    partyid7 |     -0.022      0.008    -2.88   0.004       -0.037      -0.007
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,002
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : partyid7

1._at        : treat           =           1

2._at        : treat           =           2

3._at        : treat           =           3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
partyid7     |
         _at |
          1  |     -0.018      0.012    -1.51   0.132       -0.041       0.005
          2  |     -0.012      0.014    -0.86   0.390       -0.038       0.015
          3  |     -0.039      0.012    -3.20   0.001       -0.063      -0.015
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,002
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.treat 3.treat

1._at        : partyid7        =           1

2._at        : partyid7        =           2

3._at        : partyid7        =           3

4._at        : partyid7        =           4

5._at        : partyid7        =           5

6._at        : partyid7        =           6

7._at        : partyid7        =           7

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1.treat      |  (base outcome)
-------------+----------------------------------------------------------------
2.treat      |
         _at |
          1  |     -0.052      0.059    -0.88   0.376       -0.167       0.063
          2  |     -0.046      0.046    -1.00   0.315       -0.135       0.044
          3  |     -0.040      0.036    -1.09   0.274       -0.111       0.031
          4  |     -0.034      0.034    -0.99   0.323       -0.100       0.033
          5  |     -0.027      0.040    -0.69   0.492       -0.106       0.051
          6  |     -0.021      0.051    -0.42   0.678       -0.122       0.079
          7  |     -0.015      0.065    -0.23   0.816       -0.143       0.113
-------------+----------------------------------------------------------------
3.treat      |
         _at |
          1  |      0.072      0.056     1.29   0.198       -0.038       0.181
          2  |      0.051      0.044     1.15   0.250       -0.036       0.137
          3  |      0.029      0.036     0.82   0.412       -0.041       0.099
          4  |      0.008      0.034     0.24   0.813       -0.059       0.075
          5  |     -0.013      0.040    -0.33   0.740       -0.091       0.065
          6  |     -0.034      0.050    -0.69   0.493       -0.133       0.064
          7  |     -0.056      0.063    -0.88   0.379       -0.180       0.068
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

. 
. outreg2 [*] ///
>   using docs/ols-margins-with-covariates.xls, ///
>   noaster stats(coef se ci pval) bdec(1) sdec(1) cdec(3)  ///
>   stnum(replace coef=coef*100, replace se=se*100) ///
>   paren(se) bracket(ci) ///
>   excel replace
docs/ols-margins-with-covariates.xls
dir : seeout

. 
. estimates clear

. 
. *** Logit models, with no additional adjustment
. 
. foreach dom in `domain' {
  2. 
. logit `dom' `covariates' b1.treat [pweight=weight]
  3. estimates store `dom'_r1
  4. 
. logit `dom' `covariates' c.partyid7 [pweight=weight]
  5. estimates store `dom'_r2
  6. 
. logit `dom' `covariates' b1.treat##c.partyid7 [pweight=weight]
  7. estimates store `dom'_r3
  8. 
. }

Iteration 0:   log pseudolikelihood = -1385.8683  
Iteration 1:   log pseudolikelihood = -1210.6315  
Iteration 2:   log pseudolikelihood = -1209.6478  
Iteration 3:   log pseudolikelihood = -1209.6392  
Iteration 4:   log pseudolikelihood = -1209.6392  

Logistic regression                             Number of obs     =      2,016
                                                Wald chi2(74)     =     176.08
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -1209.6392               Pseudo R2         =     0.1272

----------------------------------------------------------------------------------
                 |               Robust
             spk |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
         region4 |
              2  |      0.128      0.215     0.59   0.553       -0.294       0.550
              3  |     -0.052      0.211    -0.24   0.807       -0.466       0.363
              4  |      0.174      0.230     0.76   0.449       -0.276       0.624
                 |
         1.metro |      0.115      0.226     0.51   0.610       -0.328       0.558
        1.female |     -0.565      0.133    -4.26   0.000       -0.825      -0.305
                 |
            age4 |
              2  |     -0.498      0.235    -2.12   0.034       -0.957      -0.038
              3  |     -0.817      0.251    -3.25   0.001       -1.309      -0.325
              4  |     -0.816      0.289    -2.82   0.005       -1.381      -0.250
                 |
           race4 |
              2  |      0.019      0.238     0.08   0.938       -0.448       0.486
              3  |     -0.199      0.286    -0.70   0.486       -0.760       0.362
              4  |      0.215      0.216     1.00   0.319       -0.208       0.638
                 |
          hhsize |
              2  |     -0.352      0.239    -1.47   0.141       -0.820       0.117
              3  |     -0.494      0.260    -1.90   0.058       -1.004       0.017
              4  |      0.051      0.284     0.18   0.858       -0.505       0.607
              5  |     -0.094      0.319    -0.30   0.768       -0.720       0.531
              6  |     -0.165      0.324    -0.51   0.609       -0.800       0.469
                 |
         marital |
              2  |     -0.264      0.417    -0.63   0.526       -1.080       0.552
              3  |      0.057      0.239     0.24   0.813       -0.412       0.525
              4  |      1.127      0.487     2.32   0.021        0.173       2.081
              5  |      0.091      0.231     0.39   0.695       -0.362       0.543
              6  |      0.386      0.259     1.49   0.137       -0.122       0.895
                 |
           relig |
              2  |     -0.361      0.209    -1.73   0.084       -0.771       0.049
              3  |     -0.788      0.744    -1.06   0.290       -2.247       0.671
              4  |      2.596      1.081     2.40   0.016        0.477       4.715
              5  |      0.521      0.474     1.10   0.271       -0.408       1.451
              6  |     -0.782      0.854    -0.92   0.360       -2.456       0.891
              7  |      0.676      0.567     1.19   0.234       -0.436       1.788
              8  |     -1.760      0.884    -1.99   0.046       -3.492      -0.027
              9  |      0.903      0.370     2.44   0.015        0.179       1.627
             10  |      0.335      0.337     0.99   0.320       -0.325       0.995
             11  |      0.444      0.223     1.99   0.047        0.007       0.881
             12  |     -0.179      0.191    -0.94   0.348       -0.554       0.195
             13  |      0.549      0.502     1.09   0.274       -0.435       1.533
             14  |      0.448      0.511     0.88   0.381       -0.553       1.448
             15  |      0.358      0.629     0.57   0.570       -0.876       1.592
                 |
           educ4 |
              2  |      0.409      0.354     1.15   0.248       -0.285       1.103
              3  |      0.918      0.344     2.67   0.008        0.245       1.591
              4  |      1.282      0.359     3.57   0.000        0.578       1.985
                 |
          income |
              2  |      0.426      0.682     0.62   0.532       -0.911       1.762
              3  |     -0.131      0.678    -0.19   0.847       -1.459       1.197
              4  |     -0.433      0.602    -0.72   0.472       -1.613       0.747
              5  |      0.106      0.605     0.18   0.861       -1.081       1.293
              6  |     -0.358      0.591    -0.60   0.545       -1.516       0.801
              7  |     -0.262      0.592    -0.44   0.658       -1.423       0.899
              8  |     -0.289      0.622    -0.46   0.642       -1.509       0.931
              9  |     -0.285      0.592    -0.48   0.630       -1.445       0.875
             10  |     -0.017      0.593    -0.03   0.977       -1.180       1.145
             11  |     -0.290      0.582    -0.50   0.618       -1.431       0.851
             12  |     -0.201      0.626    -0.32   0.748       -1.427       1.025
             13  |      0.258      0.588     0.44   0.661       -0.894       1.410
             14  |     -0.103      0.588    -0.18   0.860       -1.256       1.049
             15  |     -0.360      0.615    -0.59   0.558       -1.566       0.845
             16  |     -0.220      0.635    -0.35   0.730       -1.465       1.026
             17  |      0.954      0.700     1.36   0.173       -0.419       2.326
             18  |      0.167      0.636     0.26   0.793       -1.079       1.414
                 |
         housing |
              2  |      0.322      0.198     1.63   0.104       -0.066       0.710
              3  |     -0.081      0.556    -0.15   0.884       -1.171       1.008
                 |
       home_type |
              2  |     -0.490      0.236    -2.08   0.038       -0.951      -0.028
              3  |     -0.488      0.226    -2.16   0.031       -0.930      -0.046
              4  |      0.813      0.356     2.28   0.023        0.114       1.511
              5  |     -1.237      1.089    -1.14   0.256       -3.371       0.898
                 |
      1.internet |      0.069      0.240     0.29   0.774       -0.401       0.538
                 |
    phoneservice |
              2  |     -0.263      0.353    -0.75   0.456       -0.956       0.429
              3  |     -0.053      0.370    -0.14   0.886       -0.779       0.673
              4  |     -0.239      0.351    -0.68   0.495       -0.927       0.448
              5  |      0.382      0.848     0.45   0.652       -1.280       2.044
                 |
          device |
     Smartphone  |     -0.547      0.153    -3.57   0.000       -0.847      -0.247
         Tablet  |     -0.088      0.275    -0.32   0.748       -0.628       0.451
                 |
          durint |
       1-3 mins  |     -1.305      0.772    -1.69   0.091       -2.819       0.208
       4-6 mins  |     -1.426      0.782    -1.82   0.068       -2.958       0.107
       7-9 mins  |     -1.245      0.828    -1.50   0.133       -2.868       0.378
10 or more mins  |     -1.590      0.807    -1.97   0.049       -3.172      -0.009
                 |
           treat |
             ic  |     -0.411      0.162    -2.54   0.011       -0.729      -0.093
            irl  |     -0.261      0.159    -1.64   0.100       -0.572       0.050
                 |
           _cons |      1.928      1.069     1.80   0.071       -0.167       4.023
----------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -1380.5082  
Iteration 1:   log pseudolikelihood = -1206.3317  
Iteration 2:   log pseudolikelihood = -1205.2584  
Iteration 3:   log pseudolikelihood = -1205.2502  
Iteration 4:   log pseudolikelihood = -1205.2502  

Logistic regression                             Number of obs     =      2,009
                                                Wald chi2(73)     =     175.29
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -1205.2502               Pseudo R2         =     0.1270

----------------------------------------------------------------------------------
                 |               Robust
             spk |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
         region4 |
              2  |      0.121      0.219     0.55   0.580       -0.308       0.550
              3  |     -0.019      0.214    -0.09   0.928       -0.439       0.400
              4  |      0.181      0.233     0.78   0.437       -0.276       0.639
                 |
         1.metro |      0.115      0.222     0.52   0.605       -0.320       0.550
        1.female |     -0.586      0.134    -4.39   0.000       -0.848      -0.325
                 |
            age4 |
              2  |     -0.541      0.237    -2.29   0.022       -1.005      -0.077
              3  |     -0.827      0.253    -3.27   0.001       -1.322      -0.332
              4  |     -0.838      0.292    -2.87   0.004       -1.411      -0.265
                 |
           race4 |
              2  |     -0.117      0.250    -0.47   0.639       -0.607       0.373
              3  |     -0.242      0.281    -0.86   0.389       -0.794       0.309
              4  |      0.106      0.220     0.48   0.629       -0.325       0.537
                 |
          hhsize |
              2  |     -0.363      0.239    -1.52   0.129       -0.830       0.105
              3  |     -0.496      0.259    -1.92   0.055       -1.003       0.011
              4  |      0.096      0.285     0.34   0.736       -0.463       0.655
              5  |     -0.104      0.313    -0.33   0.739       -0.719       0.510
              6  |     -0.129      0.316    -0.41   0.682       -0.748       0.490
                 |
         marital |
              2  |     -0.320      0.406    -0.79   0.430       -1.116       0.475
              3  |      0.027      0.238     0.11   0.910       -0.440       0.494
              4  |      1.279      0.479     2.67   0.008        0.340       2.218
              5  |      0.055      0.232     0.24   0.813       -0.400       0.510
              6  |      0.333      0.259     1.29   0.198       -0.174       0.840
                 |
           relig |
              2  |     -0.369      0.209    -1.77   0.077       -0.778       0.040
              3  |     -0.818      0.732    -1.12   0.264       -2.252       0.616
              4  |      2.434      1.119     2.18   0.030        0.241       4.628
              5  |      0.475      0.477     1.00   0.319       -0.459       1.409
              6  |     -0.817      0.925    -0.88   0.377       -2.630       0.995
              7  |      0.558      0.568     0.98   0.326       -0.556       1.672
              8  |     -1.767      0.889    -1.99   0.047       -3.509      -0.026
              9  |      0.763      0.382     2.00   0.046        0.015       1.512
             10  |      0.225      0.342     0.66   0.511       -0.446       0.896
             11  |      0.400      0.228     1.75   0.080       -0.047       0.848
             12  |     -0.186      0.194    -0.96   0.339       -0.567       0.195
             13  |      0.470      0.504     0.93   0.351       -0.517       1.458
             14  |      0.340      0.492     0.69   0.489       -0.624       1.304
             15  |      0.301      0.689     0.44   0.662       -1.050       1.652
                 |
           educ4 |
              2  |      0.447      0.365     1.23   0.221       -0.268       1.162
              3  |      0.950      0.352     2.70   0.007        0.261       1.639
              4  |      1.301      0.369     3.53   0.000        0.578       2.023
                 |
          income |
              2  |      0.460      0.681     0.68   0.499       -0.875       1.795
              3  |     -0.082      0.692    -0.12   0.905       -1.439       1.275
              4  |     -0.428      0.624    -0.69   0.493       -1.651       0.794
              5  |      0.146      0.623     0.23   0.815       -1.075       1.367
              6  |     -0.316      0.611    -0.52   0.605       -1.513       0.881
              7  |     -0.202      0.612    -0.33   0.742       -1.402       0.999
              8  |     -0.315      0.636    -0.49   0.621       -1.561       0.932
              9  |     -0.249      0.615    -0.41   0.685       -1.455       0.956
             10  |      0.080      0.611     0.13   0.896       -1.118       1.278
             11  |     -0.285      0.604    -0.47   0.636       -1.468       0.898
             12  |     -0.138      0.646    -0.21   0.831       -1.404       1.128
             13  |      0.331      0.606     0.55   0.585       -0.858       1.519
             14  |     -0.011      0.607    -0.02   0.986       -1.201       1.180
             15  |     -0.248      0.633    -0.39   0.695       -1.489       0.992
             16  |     -0.149      0.652    -0.23   0.819       -1.427       1.129
             17  |      1.011      0.722     1.40   0.161       -0.404       2.426
             18  |      0.297      0.659     0.45   0.653       -0.996       1.589
                 |
         housing |
              2  |      0.327      0.201     1.63   0.104       -0.067       0.721
              3  |     -0.051      0.541    -0.09   0.926       -1.111       1.009
                 |
       home_type |
              2  |     -0.473      0.237    -2.00   0.046       -0.937      -0.009
              3  |     -0.507      0.229    -2.21   0.027       -0.956      -0.057
              4  |      0.825      0.349     2.36   0.018        0.141       1.509
              5  |     -1.342      1.072    -1.25   0.210       -3.443       0.758
                 |
      1.internet |      0.034      0.241     0.14   0.888       -0.438       0.505
                 |
    phoneservice |
              2  |     -0.297      0.367    -0.81   0.418       -1.016       0.422
              3  |     -0.062      0.383    -0.16   0.871       -0.812       0.688
              4  |     -0.227      0.364    -0.62   0.532       -0.941       0.486
              5  |      0.331      0.854     0.39   0.698       -1.343       2.005
                 |
          device |
     Smartphone  |     -0.538      0.155    -3.48   0.001       -0.840      -0.235
         Tablet  |     -0.073      0.275    -0.27   0.790       -0.612       0.466
                 |
          durint |
       1-3 mins  |     -1.478      0.751    -1.97   0.049       -2.950      -0.006
       4-6 mins  |     -1.579      0.759    -2.08   0.037       -3.066      -0.092
       7-9 mins  |     -1.434      0.808    -1.78   0.076       -3.018       0.149
10 or more mins  |     -1.721      0.787    -2.19   0.029       -3.264      -0.178
                 |
        partyid7 |     -0.059      0.038    -1.55   0.121       -0.133       0.016
           _cons |      2.143      1.095     1.96   0.050       -0.004       4.289
----------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -1380.5082  
Iteration 1:   log pseudolikelihood = -1199.2246  
Iteration 2:   log pseudolikelihood = -1198.1816  
Iteration 3:   log pseudolikelihood = -1198.1731  
Iteration 4:   log pseudolikelihood = -1198.1731  

Logistic regression                             Number of obs     =      2,009
                                                Wald chi2(77)     =     187.95
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -1198.1731               Pseudo R2         =     0.1321

----------------------------------------------------------------------------------
                 |               Robust
             spk |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
         region4 |
              2  |      0.135      0.216     0.62   0.534       -0.289       0.559
              3  |     -0.015      0.213    -0.07   0.945       -0.432       0.402
              4  |      0.192      0.231     0.83   0.406       -0.261       0.645
                 |
         1.metro |      0.139      0.226     0.62   0.539       -0.304       0.583
        1.female |     -0.602      0.134    -4.50   0.000       -0.864      -0.340
                 |
            age4 |
              2  |     -0.552      0.235    -2.35   0.019       -1.013      -0.091
              3  |     -0.838      0.251    -3.34   0.001       -1.330      -0.346
              4  |     -0.840      0.290    -2.90   0.004       -1.408      -0.272
                 |
           race4 |
              2  |     -0.128      0.249    -0.52   0.605       -0.616       0.359
              3  |     -0.223      0.283    -0.79   0.431       -0.778       0.332
              4  |      0.129      0.219     0.59   0.556       -0.300       0.557
                 |
          hhsize |
              2  |     -0.377      0.241    -1.56   0.119       -0.850       0.096
              3  |     -0.500      0.262    -1.91   0.056       -1.013       0.013
              4  |      0.066      0.285     0.23   0.817       -0.493       0.625
              5  |     -0.065      0.318    -0.20   0.838       -0.688       0.558
              6  |     -0.148      0.325    -0.45   0.650       -0.785       0.490
                 |
         marital |
              2  |     -0.294      0.415    -0.71   0.479       -1.107       0.519
              3  |      0.064      0.241     0.27   0.790       -0.408       0.537
              4  |      1.331      0.471     2.82   0.005        0.407       2.254
              5  |      0.048      0.232     0.21   0.837       -0.407       0.502
              6  |      0.383      0.259     1.48   0.140       -0.125       0.891
                 |
           relig |
              2  |     -0.384      0.210    -1.83   0.067       -0.796       0.028
              3  |     -0.820      0.773    -1.06   0.289       -2.335       0.695
              4  |      2.477      1.124     2.20   0.028        0.273       4.680
              5  |      0.453      0.473     0.96   0.338       -0.473       1.379
              6  |     -0.802      0.860    -0.93   0.351       -2.487       0.883
              7  |      0.544      0.567     0.96   0.337       -0.566       1.654
              8  |     -1.820      0.890    -2.04   0.041       -3.566      -0.075
              9  |      0.778      0.387     2.01   0.044        0.020       1.536
             10  |      0.237      0.350     0.68   0.498       -0.449       0.923
             11  |      0.403      0.230     1.75   0.080       -0.048       0.855
             12  |     -0.181      0.191    -0.95   0.345       -0.556       0.194
             13  |      0.447      0.507     0.88   0.378       -0.547       1.441
             14  |      0.385      0.517     0.75   0.456       -0.628       1.399
             15  |      0.434      0.677     0.64   0.522       -0.893       1.761
                 |
           educ4 |
              2  |      0.446      0.361     1.23   0.217       -0.262       1.154
              3  |      0.975      0.350     2.79   0.005        0.290       1.660
              4  |      1.313      0.366     3.59   0.000        0.595       2.030
                 |
          income |
              2  |      0.459      0.685     0.67   0.503       -0.884       1.802
              3  |     -0.084      0.685    -0.12   0.903       -1.427       1.259
              4  |     -0.417      0.608    -0.69   0.492       -1.609       0.774
              5  |      0.092      0.618     0.15   0.881       -1.118       1.303
              6  |     -0.326      0.598    -0.55   0.585       -1.498       0.845
              7  |     -0.249      0.601    -0.41   0.679       -1.427       0.930
              8  |     -0.353      0.623    -0.57   0.571       -1.574       0.868
              9  |     -0.288      0.599    -0.48   0.631       -1.463       0.887
             10  |      0.031      0.601     0.05   0.959       -1.146       1.209
             11  |     -0.261      0.591    -0.44   0.659       -1.419       0.898
             12  |     -0.182      0.632    -0.29   0.774       -1.420       1.057
             13  |      0.317      0.596     0.53   0.595       -0.850       1.484
             14  |     -0.070      0.596    -0.12   0.907       -1.239       1.099
             15  |     -0.316      0.626    -0.51   0.613       -1.543       0.911
             16  |     -0.169      0.642    -0.26   0.792       -1.428       1.090
             17  |      1.007      0.702     1.43   0.151       -0.369       2.383
             18  |      0.264      0.644     0.41   0.682       -0.998       1.527
                 |
         housing |
              2  |      0.297      0.199     1.50   0.135       -0.092       0.686
              3  |     -0.057      0.560    -0.10   0.919       -1.155       1.041
                 |
       home_type |
              2  |     -0.461      0.236    -1.95   0.051       -0.924       0.002
              3  |     -0.480      0.226    -2.12   0.034       -0.923      -0.037
              4  |      0.852      0.353     2.41   0.016        0.160       1.543
              5  |     -1.244      1.071    -1.16   0.245       -3.342       0.855
                 |
      1.internet |      0.054      0.240     0.22   0.823       -0.417       0.524
                 |
    phoneservice |
              2  |     -0.295      0.358    -0.83   0.409       -0.997       0.406
              3  |     -0.091      0.375    -0.24   0.808       -0.826       0.643
              4  |     -0.242      0.356    -0.68   0.496       -0.939       0.455
              5  |      0.411      0.821     0.50   0.617       -1.198       2.019
                 |
          device |
     Smartphone  |     -0.529      0.153    -3.46   0.001       -0.829      -0.229
         Tablet  |     -0.081      0.277    -0.29   0.769       -0.623       0.461
                 |
          durint |
       1-3 mins  |     -1.349      0.743    -1.81   0.070       -2.806       0.108
       4-6 mins  |     -1.459      0.752    -1.94   0.052       -2.933       0.015
       7-9 mins  |     -1.244      0.801    -1.55   0.120       -2.813       0.326
10 or more mins  |     -1.632      0.782    -2.09   0.037       -3.164      -0.100
                 |
           treat |
             ic  |      0.105      0.348     0.30   0.762       -0.576       0.787
            irl  |     -0.123      0.345    -0.36   0.720       -0.799       0.552
                 |
        partyid7 |     -0.011      0.056    -0.19   0.850       -0.120       0.099
                 |
treat#c.partyid7 |
             ic  |     -0.128      0.080    -1.60   0.109       -0.285       0.028
            irl  |     -0.030      0.079    -0.38   0.707       -0.186       0.126
                 |
           _cons |      2.020      1.071     1.89   0.059       -0.079       4.120
----------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -1130.5407  
Iteration 1:   log pseudolikelihood =  -1004.594  
Iteration 2:   log pseudolikelihood = -999.30017  
Iteration 3:   log pseudolikelihood = -999.28176  
Iteration 4:   log pseudolikelihood = -999.28175  

Logistic regression                             Number of obs     =      2,012
                                                Wald chi2(74)     =     159.49
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -999.28175               Pseudo R2         =     0.1161

----------------------------------------------------------------------------------
                 |               Robust
             col |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
         region4 |
              2  |      0.287      0.252     1.14   0.255       -0.207       0.781
              3  |      0.071      0.242     0.29   0.771       -0.404       0.545
              4  |      0.378      0.246     1.54   0.124       -0.104       0.859
                 |
         1.metro |      0.284      0.275     1.03   0.303       -0.256       0.823
        1.female |     -0.200      0.154    -1.30   0.193       -0.502       0.101
                 |
            age4 |
              2  |     -0.353      0.241    -1.46   0.143       -0.824       0.119
              3  |     -0.747      0.271    -2.76   0.006       -1.279      -0.216
              4  |     -0.999      0.320    -3.12   0.002       -1.627      -0.372
                 |
           race4 |
              2  |      0.120      0.256     0.47   0.638       -0.381       0.622
              3  |     -0.059      0.298    -0.20   0.843       -0.643       0.525
              4  |     -0.299      0.245    -1.22   0.223       -0.778       0.181
                 |
          hhsize |
              2  |     -0.240      0.263    -0.91   0.360       -0.755       0.275
              3  |     -0.442      0.288    -1.54   0.125       -1.006       0.122
              4  |     -0.129      0.328    -0.39   0.693       -0.772       0.513
              5  |     -0.273      0.352    -0.78   0.437       -0.963       0.417
              6  |      0.118      0.328     0.36   0.718       -0.525       0.762
                 |
         marital |
              2  |      0.383      0.442     0.87   0.387       -0.484       1.250
              3  |     -0.111      0.256    -0.43   0.664       -0.612       0.390
              4  |      1.205      0.621     1.94   0.052       -0.011       2.422
              5  |      0.230      0.261     0.88   0.379       -0.282       0.741
              6  |      0.535      0.278     1.92   0.055       -0.011       1.081
                 |
           relig |
              2  |     -0.171      0.254    -0.67   0.501       -0.670       0.327
              3  |     -0.820      0.737    -1.11   0.266       -2.265       0.624
              4  |      2.203      0.889     2.48   0.013        0.461       3.945
              5  |      0.424      0.539     0.79   0.431       -0.632       1.481
              6  |     -0.143      1.042    -0.14   0.891       -2.185       1.898
              7  |     -0.154      0.719    -0.21   0.831       -1.564       1.257
              8  |     -2.172      1.088    -2.00   0.046       -4.304      -0.040
              9  |      0.530      0.319     1.66   0.097       -0.096       1.155
             10  |      0.178      0.354     0.50   0.615       -0.516       0.873
             11  |      0.554      0.247     2.24   0.025        0.070       1.037
             12  |      0.068      0.231     0.29   0.768       -0.384       0.520
             13  |      1.020      0.508     2.01   0.044        0.025       2.015
             14  |      0.573      0.450     1.27   0.203       -0.309       1.455
             15  |      1.399      0.651     2.15   0.032        0.123       2.675
                 |
           educ4 |
              2  |     -0.428      0.383    -1.12   0.263       -1.179       0.322
              3  |     -0.110      0.366    -0.30   0.765       -0.827       0.608
              4  |      0.647      0.379     1.71   0.088       -0.095       1.390
                 |
          income |
              2  |      0.095      0.714     0.13   0.894       -1.304       1.493
              3  |     -0.125      0.685    -0.18   0.855       -1.468       1.218
              4  |     -0.739      0.606    -1.22   0.223       -1.927       0.450
              5  |     -0.490      0.619    -0.79   0.429       -1.703       0.724
              6  |     -0.315      0.583    -0.54   0.589       -1.457       0.827
              7  |     -0.143      0.587    -0.24   0.808       -1.293       1.008
              8  |     -0.241      0.578    -0.42   0.676       -1.375       0.892
              9  |     -0.586      0.562    -1.04   0.297       -1.688       0.515
             10  |      0.123      0.551     0.22   0.824       -0.957       1.202
             11  |     -0.683      0.556    -1.23   0.220       -1.773       0.408
             12  |     -0.129      0.622    -0.21   0.835       -1.349       1.090
             13  |      0.026      0.547     0.05   0.962       -1.045       1.098
             14  |     -0.263      0.553    -0.48   0.634       -1.347       0.821
             15  |     -0.487      0.581    -0.84   0.403       -1.626       0.653
             16  |     -0.458      0.614    -0.75   0.455       -1.661       0.745
             17  |      0.886      0.692     1.28   0.201       -0.471       2.243
             18  |     -0.194      0.612    -0.32   0.751       -1.394       1.005
                 |
         housing |
              2  |      0.314      0.219     1.43   0.153       -0.116       0.744
              3  |     -0.152      0.605    -0.25   0.801       -1.338       1.034
                 |
       home_type |
              2  |     -0.317      0.273    -1.16   0.245       -0.851       0.217
              3  |     -0.575      0.247    -2.33   0.020       -1.059      -0.092
              4  |      0.422      0.379     1.11   0.265       -0.320       1.164
              5  |     -1.421      0.959    -1.48   0.139       -3.301       0.460
                 |
      1.internet |     -0.113      0.274    -0.41   0.679       -0.650       0.423
                 |
    phoneservice |
              2  |     -0.637      0.366    -1.74   0.081       -1.354       0.079
              3  |     -0.453      0.394    -1.15   0.250       -1.226       0.319
              4  |     -0.566      0.366    -1.55   0.122       -1.284       0.152
              5  |     -1.707      0.822    -2.08   0.038       -3.319      -0.095
                 |
          device |
     Smartphone  |     -0.203      0.169    -1.20   0.229       -0.534       0.128
         Tablet  |      0.249      0.300     0.83   0.406       -0.339       0.838
                 |
          durint |
       1-3 mins  |     -1.276      0.801    -1.59   0.111       -2.846       0.294
       4-6 mins  |     -1.175      0.814    -1.44   0.149       -2.771       0.420
       7-9 mins  |     -1.670      0.890    -1.88   0.061       -3.413       0.074
10 or more mins  |     -1.884      0.859    -2.19   0.028       -3.568      -0.200
                 |
           treat |
             ic  |     -0.330      0.178    -1.85   0.064       -0.680       0.019
            irl  |     -0.298      0.180    -1.65   0.099       -0.651       0.056
                 |
           _cons |      1.476      1.088     1.36   0.175       -0.657       3.608
----------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -1122.4494  
Iteration 1:   log pseudolikelihood =  -991.1827  
Iteration 2:   log pseudolikelihood = -985.37531  
Iteration 3:   log pseudolikelihood = -985.35815  
Iteration 4:   log pseudolikelihood = -985.35815  

Logistic regression                             Number of obs     =      2,005
                                                Wald chi2(73)     =     172.11
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -985.35815               Pseudo R2         =     0.1221

----------------------------------------------------------------------------------
                 |               Robust
             col |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
         region4 |
              2  |      0.332      0.265     1.25   0.211       -0.188       0.852
              3  |      0.173      0.255     0.68   0.496       -0.326       0.673
              4  |      0.439      0.260     1.69   0.092       -0.072       0.949
                 |
         1.metro |      0.282      0.274     1.03   0.304       -0.255       0.818
        1.female |     -0.267      0.158    -1.69   0.091       -0.576       0.042
                 |
            age4 |
              2  |     -0.380      0.241    -1.57   0.115       -0.852       0.093
              3  |     -0.735      0.273    -2.69   0.007       -1.270      -0.200
              4  |     -1.032      0.319    -3.24   0.001       -1.657      -0.407
                 |
           race4 |
              2  |     -0.125      0.271    -0.46   0.646       -0.656       0.407
              3  |     -0.174      0.295    -0.59   0.556       -0.752       0.405
              4  |     -0.445      0.251    -1.77   0.077       -0.938       0.048
                 |
          hhsize |
              2  |     -0.293      0.271    -1.08   0.281       -0.825       0.239
              3  |     -0.454      0.290    -1.57   0.118       -1.023       0.115
              4  |     -0.117      0.337    -0.35   0.729       -0.777       0.543
              5  |     -0.343      0.351    -0.98   0.329       -1.031       0.346
              6  |      0.130      0.329     0.39   0.693       -0.515       0.775
                 |
         marital |
              2  |      0.307      0.454     0.68   0.499       -0.583       1.197
              3  |     -0.176      0.257    -0.68   0.494       -0.679       0.328
              4  |      1.356      0.562     2.41   0.016        0.254       2.458
              5  |      0.087      0.270     0.32   0.747       -0.442       0.617
              6  |      0.476      0.278     1.71   0.087       -0.069       1.021
                 |
           relig |
              2  |     -0.215      0.262    -0.82   0.413       -0.729       0.299
              3  |     -0.929      0.779    -1.19   0.233       -2.456       0.598
              4  |      2.034      0.877     2.32   0.020        0.314       3.753
              5  |      0.360      0.544     0.66   0.509       -0.707       1.426
              6  |     -0.199      1.144    -0.17   0.862       -2.441       2.043
              7  |     -0.215      0.684    -0.31   0.753       -1.556       1.126
              8  |     -2.171      1.131    -1.92   0.055       -4.387       0.045
              9  |      0.284      0.329     0.86   0.388       -0.361       0.929
             10  |      0.013      0.362     0.04   0.971       -0.696       0.722
             11  |      0.458      0.250     1.83   0.067       -0.032       0.948
             12  |      0.066      0.235     0.28   0.779       -0.394       0.526
             13  |      0.827      0.523     1.58   0.114       -0.198       1.852
             14  |      0.426      0.446     0.96   0.339       -0.448       1.300
             15  |      1.096      0.690     1.59   0.112       -0.257       2.450
                 |
           educ4 |
              2  |     -0.354      0.380    -0.93   0.352       -1.099       0.392
              3  |     -0.083      0.362    -0.23   0.818       -0.793       0.626
              4  |      0.684      0.380     1.80   0.072       -0.061       1.428
                 |
          income |
              2  |      0.159      0.711     0.22   0.823       -1.235       1.552
              3  |     -0.049      0.707    -0.07   0.945       -1.435       1.338
              4  |     -0.731      0.633    -1.16   0.248       -1.972       0.509
              5  |     -0.471      0.627    -0.75   0.453       -1.701       0.759
              6  |     -0.282      0.606    -0.47   0.641       -1.471       0.906
              7  |     -0.127      0.606    -0.21   0.834       -1.314       1.060
              8  |     -0.300      0.607    -0.49   0.621       -1.489       0.889
              9  |     -0.565      0.592    -0.95   0.340       -1.725       0.595
             10  |      0.228      0.567     0.40   0.688       -0.883       1.338
             11  |     -0.687      0.577    -1.19   0.234       -1.819       0.444
             12  |     -0.065      0.647    -0.10   0.920       -1.332       1.203
             13  |      0.103      0.567     0.18   0.856       -1.008       1.214
             14  |     -0.213      0.575    -0.37   0.710       -1.340       0.913
             15  |     -0.377      0.598    -0.63   0.528       -1.550       0.795
             16  |     -0.409      0.628    -0.65   0.515       -1.641       0.823
             17  |      0.964      0.709     1.36   0.174       -0.426       2.353
             18  |     -0.178      0.634    -0.28   0.779       -1.421       1.064
                 |
         housing |
              2  |      0.307      0.220     1.40   0.162       -0.123       0.738
              3  |     -0.053      0.578    -0.09   0.927       -1.187       1.081
                 |
       home_type |
              2  |     -0.252      0.275    -0.92   0.359       -0.792       0.287
              3  |     -0.574      0.251    -2.29   0.022       -1.065      -0.082
              4  |      0.458      0.367     1.25   0.212       -0.261       1.177
              5  |     -1.464      0.978    -1.50   0.135       -3.381       0.454
                 |
      1.internet |     -0.179      0.272    -0.66   0.510       -0.713       0.354
                 |
    phoneservice |
              2  |     -0.663      0.374    -1.77   0.076       -1.396       0.070
              3  |     -0.452      0.402    -1.12   0.262       -1.241       0.337
              4  |     -0.560      0.377    -1.49   0.137       -1.298       0.178
              5  |     -1.682      0.851    -1.98   0.048       -3.351      -0.014
                 |
          device |
     Smartphone  |     -0.186      0.172    -1.08   0.279       -0.523       0.151
         Tablet  |      0.273      0.299     0.92   0.360       -0.312       0.859
                 |
          durint |
       1-3 mins  |     -1.558      0.753    -2.07   0.039       -3.033      -0.082
       4-6 mins  |     -1.458      0.763    -1.91   0.056       -2.953       0.038
       7-9 mins  |     -1.997      0.840    -2.38   0.017       -3.643      -0.351
10 or more mins  |     -2.175      0.819    -2.66   0.008       -3.780      -0.569
                 |
        partyid7 |     -0.132      0.044    -2.97   0.003       -0.219      -0.045
           _cons |      2.174      1.109     1.96   0.050        0.001       4.347
----------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -1122.4494  
Iteration 1:   log pseudolikelihood = -987.14217  
Iteration 2:   log pseudolikelihood = -980.94683  
Iteration 3:   log pseudolikelihood = -980.92878  
Iteration 4:   log pseudolikelihood = -980.92877  

Logistic regression                             Number of obs     =      2,005
                                                Wald chi2(77)     =     179.88
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -980.92877               Pseudo R2         =     0.1261

----------------------------------------------------------------------------------
                 |               Robust
             col |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
         region4 |
              2  |      0.323      0.261     1.24   0.216       -0.189       0.834
              3  |      0.166      0.254     0.65   0.514       -0.332       0.663
              4  |      0.453      0.257     1.76   0.078       -0.051       0.958
                 |
         1.metro |      0.304      0.274     1.11   0.268       -0.234       0.841
        1.female |     -0.269      0.158    -1.70   0.089       -0.580       0.041
                 |
            age4 |
              2  |     -0.382      0.240    -1.59   0.112       -0.852       0.088
              3  |     -0.742      0.272    -2.73   0.006       -1.275      -0.210
              4  |     -1.043      0.318    -3.28   0.001       -1.667      -0.420
                 |
           race4 |
              2  |     -0.099      0.273    -0.36   0.716       -0.635       0.436
              3  |     -0.146      0.297    -0.49   0.623       -0.727       0.435
              4  |     -0.425      0.250    -1.70   0.089       -0.915       0.065
                 |
          hhsize |
              2  |     -0.319      0.268    -1.19   0.235       -0.844       0.207
              3  |     -0.485      0.288    -1.68   0.092       -1.050       0.079
              4  |     -0.162      0.335    -0.48   0.629       -0.818       0.494
              5  |     -0.362      0.353    -1.03   0.305       -1.053       0.329
              6  |      0.057      0.330     0.17   0.864       -0.590       0.703
                 |
         marital |
              2  |      0.319      0.445     0.72   0.473       -0.552       1.191
              3  |     -0.164      0.257    -0.64   0.523       -0.668       0.340
              4  |      1.339      0.584     2.29   0.022        0.194       2.484
              5  |      0.078      0.269     0.29   0.771       -0.449       0.605
              6  |      0.498      0.282     1.77   0.077       -0.054       1.050
                 |
           relig |
              2  |     -0.204      0.263    -0.78   0.438       -0.720       0.312
              3  |     -0.969      0.777    -1.25   0.212       -2.493       0.554
              4  |      1.980      0.938     2.11   0.035        0.143       3.818
              5  |      0.317      0.532     0.59   0.552       -0.727       1.360
              6  |     -0.240      1.074    -0.22   0.823       -2.346       1.865
              7  |     -0.203      0.688    -0.29   0.768       -1.552       1.146
              8  |     -2.262      1.133    -2.00   0.046       -4.483      -0.041
              9  |      0.307      0.329     0.93   0.350       -0.337       0.951
             10  |      0.035      0.361     0.10   0.922       -0.673       0.743
             11  |      0.460      0.251     1.83   0.067       -0.033       0.953
             12  |      0.064      0.234     0.28   0.783       -0.395       0.524
             13  |      0.778      0.540     1.44   0.150       -0.280       1.835
             14  |      0.451      0.449     1.00   0.315       -0.428       1.330
             15  |      1.188      0.681     1.74   0.081       -0.147       2.523
                 |
           educ4 |
              2  |     -0.381      0.378    -1.01   0.314       -1.122       0.360
              3  |     -0.112      0.360    -0.31   0.755       -0.817       0.593
              4  |      0.643      0.376     1.71   0.087       -0.094       1.379
                 |
          income |
              2  |      0.135      0.721     0.19   0.851       -1.278       1.549
              3  |     -0.098      0.710    -0.14   0.890       -1.490       1.294
              4  |     -0.757      0.635    -1.19   0.233       -2.001       0.488
              5  |     -0.514      0.639    -0.80   0.422       -1.766       0.739
              6  |     -0.351      0.614    -0.57   0.567       -1.554       0.852
              7  |     -0.217      0.603    -0.36   0.719       -1.398       0.965
              8  |     -0.374      0.616    -0.61   0.544       -1.581       0.833
              9  |     -0.618      0.594    -1.04   0.298       -1.784       0.547
             10  |      0.159      0.574     0.28   0.782       -0.966       1.285
             11  |     -0.705      0.583    -1.21   0.226       -1.848       0.437
             12  |     -0.135      0.649    -0.21   0.835       -1.407       1.136
             13  |      0.046      0.571     0.08   0.935       -1.073       1.166
             14  |     -0.256      0.582    -0.44   0.660       -1.395       0.884
             15  |     -0.437      0.607    -0.72   0.471       -1.626       0.751
             16  |     -0.425      0.633    -0.67   0.502       -1.665       0.815
             17  |      0.919      0.710     1.29   0.195       -0.472       2.311
             18  |     -0.231      0.640    -0.36   0.718       -1.486       1.024
                 |
         housing |
              2  |      0.310      0.218     1.42   0.156       -0.118       0.738
              3  |     -0.011      0.571    -0.02   0.985       -1.129       1.107
                 |
       home_type |
              2  |     -0.286      0.276    -1.04   0.298       -0.827       0.254
              3  |     -0.568      0.248    -2.29   0.022       -1.054      -0.082
              4  |      0.431      0.372     1.16   0.246       -0.297       1.159
              5  |     -1.303      1.003    -1.30   0.194       -3.269       0.664
                 |
      1.internet |     -0.164      0.277    -0.59   0.554       -0.706       0.378
                 |
    phoneservice |
              2  |     -0.648      0.368    -1.76   0.078       -1.369       0.073
              3  |     -0.464      0.397    -1.17   0.242       -1.242       0.314
              4  |     -0.549      0.369    -1.49   0.137       -1.273       0.174
              5  |     -1.671      0.827    -2.02   0.043       -3.292      -0.049
                 |
          device |
     Smartphone  |     -0.215      0.171    -1.26   0.207       -0.550       0.120
         Tablet  |      0.262      0.295     0.89   0.374       -0.316       0.841
                 |
          durint |
       1-3 mins  |     -1.548      0.747    -2.07   0.038       -3.012      -0.084
       4-6 mins  |     -1.475      0.758    -1.95   0.052       -2.961       0.011
       7-9 mins  |     -1.986      0.841    -2.36   0.018       -3.635      -0.338
10 or more mins  |     -2.209      0.812    -2.72   0.007       -3.801      -0.617
                 |
           treat |
             ic  |     -0.513      0.353    -1.45   0.146       -1.204       0.178
            irl  |     -0.740      0.355    -2.08   0.037       -1.436      -0.044
                 |
        partyid7 |     -0.188      0.064    -2.94   0.003       -0.314      -0.063
                 |
treat#c.partyid7 |
             ic  |      0.062      0.088     0.70   0.481       -0.111       0.236
            irl  |      0.136      0.091     1.49   0.136       -0.043       0.314
                 |
           _cons |      2.627      1.116     2.35   0.019        0.440       4.815
----------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -1391.4433  
Iteration 1:   log pseudolikelihood = -1192.8933  
Iteration 2:   log pseudolikelihood = -1191.6246  
Iteration 3:   log pseudolikelihood = -1191.6209  
Iteration 4:   log pseudolikelihood = -1191.6209  

Logistic regression                             Number of obs     =      2,009
                                                Wald chi2(74)     =     205.71
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -1191.6209               Pseudo R2         =     0.1436

----------------------------------------------------------------------------------
                 |               Robust
             lib |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
         region4 |
              2  |     -0.022      0.211    -0.10   0.918       -0.435       0.392
              3  |     -0.422      0.202    -2.09   0.037       -0.818      -0.026
              4  |      0.136      0.224     0.61   0.544       -0.303       0.574
                 |
         1.metro |      0.245      0.224     1.10   0.273       -0.193       0.684
        1.female |      0.010      0.139     0.07   0.945       -0.264       0.283
                 |
            age4 |
              2  |     -0.529      0.241    -2.20   0.028       -1.001      -0.057
              3  |     -0.974      0.257    -3.80   0.000       -1.477      -0.471
              4  |     -0.801      0.298    -2.69   0.007       -1.385      -0.217
                 |
           race4 |
              2  |      0.009      0.244     0.04   0.970       -0.469       0.487
              3  |      0.095      0.269     0.35   0.725       -0.432       0.621
              4  |     -0.393      0.205    -1.91   0.056       -0.796       0.010
                 |
          hhsize |
              2  |     -0.491      0.225    -2.18   0.029       -0.933      -0.049
              3  |     -0.845      0.256    -3.30   0.001       -1.347      -0.343
              4  |     -0.708      0.280    -2.53   0.011       -1.256      -0.159
              5  |     -0.163      0.304    -0.54   0.593       -0.759       0.433
              6  |     -0.616      0.295    -2.09   0.037       -1.194      -0.038
                 |
         marital |
              2  |     -0.297      0.321    -0.92   0.355       -0.925       0.332
              3  |     -0.133      0.227    -0.59   0.557       -0.578       0.311
              4  |     -0.411      0.610    -0.67   0.500       -1.606       0.784
              5  |     -0.125      0.232    -0.54   0.588       -0.579       0.329
              6  |     -0.063      0.267    -0.23   0.815       -0.586       0.461
                 |
           relig |
              2  |      0.205      0.203     1.01   0.313       -0.193       0.603
              3  |     -0.336      0.660    -0.51   0.611       -1.629       0.957
              4  |      0.655      0.726     0.90   0.367       -0.768       2.078
              5  |      0.458      0.483     0.95   0.343       -0.489       1.404
              6  |      0.221      0.871     0.25   0.799       -1.485       1.927
              7  |     -0.719      0.601    -1.20   0.231       -1.897       0.458
              8  |     -0.856      0.805    -1.06   0.288       -2.433       0.721
              9  |      1.384      0.406     3.41   0.001        0.589       2.179
             10  |      0.689      0.373     1.85   0.065       -0.042       1.420
             11  |      0.966      0.242     3.99   0.000        0.492       1.441
             12  |     -0.086      0.190    -0.45   0.652       -0.458       0.286
             13  |      0.403      0.604     0.67   0.504       -0.780       1.587
             14  |      0.405      0.476     0.85   0.396       -0.529       1.338
             15  |     -0.769      0.558    -1.38   0.168       -1.862       0.324
                 |
           educ4 |
              2  |     -0.289      0.289    -1.00   0.318       -0.855       0.278
              3  |      0.236      0.274     0.86   0.389       -0.300       0.772
              4  |      0.934      0.292     3.20   0.001        0.361       1.507
                 |
          income |
              2  |     -0.968      0.638    -1.52   0.129       -2.218       0.282
              3  |     -0.954      0.627    -1.52   0.128       -2.183       0.274
              4  |     -0.601      0.600    -1.00   0.317       -1.777       0.575
              5  |     -0.450      0.562    -0.80   0.422       -1.551       0.650
              6  |     -0.835      0.571    -1.46   0.143       -1.954       0.284
              7  |     -0.372      0.579    -0.64   0.521       -1.507       0.764
              8  |     -0.803      0.602    -1.33   0.182       -1.983       0.377
              9  |     -1.188      0.552    -2.15   0.031       -2.269      -0.106
             10  |     -0.587      0.547    -1.07   0.283       -1.660       0.486
             11  |     -0.572      0.566    -1.01   0.312       -1.681       0.538
             12  |     -0.716      0.598    -1.20   0.231       -1.887       0.456
             13  |     -0.435      0.561    -0.78   0.438       -1.535       0.664
             14  |     -0.753      0.573    -1.31   0.189       -1.877       0.370
             15  |     -0.833      0.581    -1.43   0.152       -1.971       0.306
             16  |     -0.708      0.628    -1.13   0.259       -1.939       0.522
             17  |     -0.744      0.712    -1.04   0.297       -2.139       0.652
             18  |     -0.045      0.639    -0.07   0.944       -1.298       1.208
                 |
         housing |
              2  |     -0.060      0.197    -0.31   0.759       -0.446       0.325
              3  |      0.702      0.460     1.53   0.127       -0.199       1.603
                 |
       home_type |
              2  |     -0.286      0.239    -1.20   0.231       -0.753       0.182
              3  |      0.069      0.215     0.32   0.750       -0.353       0.491
              4  |      0.167      0.344     0.49   0.626       -0.506       0.841
              5  |      0.723      1.176     0.62   0.539       -1.582       3.029
                 |
      1.internet |      0.145      0.239     0.61   0.544       -0.324       0.614
                 |
    phoneservice |
              2  |      0.379      0.330     1.15   0.250       -0.267       1.025
              3  |      0.191      0.352     0.54   0.587       -0.499       0.881
              4  |      0.494      0.325     1.52   0.129       -0.143       1.132
              5  |     -0.115      0.888    -0.13   0.897       -1.855       1.625
                 |
          device |
     Smartphone  |     -0.564      0.153    -3.69   0.000       -0.863      -0.264
         Tablet  |      0.164      0.275     0.60   0.552       -0.375       0.703
                 |
          durint |
       1-3 mins  |      0.955      0.670     1.42   0.154       -0.359       2.269
       4-6 mins  |      1.066      0.683     1.56   0.119       -0.273       2.405
       7-9 mins  |      0.704      0.734     0.96   0.337       -0.735       2.144
10 or more mins  |      0.861      0.710     1.21   0.225       -0.531       2.254
                 |
           treat |
             ic  |     -0.185      0.163    -1.14   0.255       -0.504       0.134
            irl  |      0.036      0.164     0.22   0.827       -0.286       0.358
                 |
           _cons |      0.318      1.025     0.31   0.756       -1.691       2.327
----------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -1385.7829  
Iteration 1:   log pseudolikelihood = -1184.5537  
Iteration 2:   log pseudolikelihood = -1183.1637  
Iteration 3:   log pseudolikelihood = -1183.1593  
Iteration 4:   log pseudolikelihood = -1183.1593  

Logistic regression                             Number of obs     =      2,002
                                                Wald chi2(73)     =     215.26
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -1183.1593               Pseudo R2         =     0.1462

----------------------------------------------------------------------------------
                 |               Robust
             lib |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
         region4 |
              2  |     -0.028      0.214    -0.13   0.895       -0.447       0.390
              3  |     -0.395      0.205    -1.92   0.054       -0.798       0.007
              4  |      0.146      0.226     0.65   0.519       -0.297       0.589
                 |
         1.metro |      0.261      0.223     1.17   0.243       -0.176       0.698
        1.female |     -0.028      0.140    -0.20   0.840       -0.303       0.246
                 |
            age4 |
              2  |     -0.540      0.244    -2.21   0.027       -1.019      -0.061
              3  |     -0.975      0.257    -3.79   0.000       -1.479      -0.471
              4  |     -0.841      0.300    -2.80   0.005       -1.429      -0.253
                 |
           race4 |
              2  |     -0.201      0.255    -0.79   0.430       -0.702       0.299
              3  |      0.047      0.265     0.18   0.858       -0.472       0.566
              4  |     -0.471      0.208    -2.26   0.024       -0.878      -0.063
                 |
          hhsize |
              2  |     -0.519      0.229    -2.27   0.023       -0.967      -0.070
              3  |     -0.866      0.259    -3.35   0.001       -1.374      -0.359
              4  |     -0.699      0.286    -2.45   0.014       -1.259      -0.139
              5  |     -0.260      0.305    -0.85   0.394       -0.858       0.338
              6  |     -0.654      0.299    -2.19   0.029       -1.240      -0.068
                 |
         marital |
              2  |     -0.377      0.310    -1.22   0.224       -0.984       0.231
              3  |     -0.168      0.225    -0.74   0.457       -0.610       0.274
              4  |     -0.433      0.637    -0.68   0.497       -1.682       0.816
              5  |     -0.206      0.234    -0.88   0.379       -0.666       0.253
              6  |     -0.111      0.265    -0.42   0.675       -0.631       0.408
                 |
           relig |
              2  |      0.159      0.205     0.77   0.438       -0.243       0.561
              3  |     -0.377      0.628    -0.60   0.548       -1.607       0.854
              4  |      0.601      0.668     0.90   0.368       -0.708       1.910
              5  |      0.345      0.478     0.72   0.471       -0.592       1.281
              6  |      0.110      0.850     0.13   0.897       -1.557       1.776
              7  |     -0.878      0.564    -1.56   0.120       -1.983       0.228
              8  |     -0.989      0.820    -1.21   0.228       -2.596       0.619
              9  |      1.144      0.421     2.71   0.007        0.318       1.970
             10  |      0.515      0.378     1.36   0.173       -0.225       1.256
             11  |      0.857      0.247     3.47   0.001        0.373       1.341
             12  |     -0.104      0.191    -0.55   0.585       -0.478       0.269
             13  |      0.167      0.593     0.28   0.779       -0.996       1.330
             14  |      0.247      0.474     0.52   0.602       -0.681       1.175
             15  |     -0.637      0.719    -0.89   0.375       -2.046       0.771
                 |
           educ4 |
              2  |     -0.235      0.288    -0.81   0.415       -0.800       0.330
              3  |      0.255      0.272     0.94   0.349       -0.278       0.788
              4  |      0.927      0.291     3.18   0.001        0.356       1.498
                 |
          income |
              2  |     -0.897      0.663    -1.35   0.176       -2.195       0.402
              3  |     -0.930      0.650    -1.43   0.153       -2.203       0.344
              4  |     -0.595      0.620    -0.96   0.337       -1.810       0.620
              5  |     -0.479      0.583    -0.82   0.411       -1.622       0.663
              6  |     -0.824      0.596    -1.38   0.167       -1.993       0.345
              7  |     -0.390      0.604    -0.65   0.519       -1.575       0.795
              8  |     -0.757      0.630    -1.20   0.230       -1.993       0.478
              9  |     -1.219      0.580    -2.10   0.036       -2.356      -0.082
             10  |     -0.576      0.575    -1.00   0.316       -1.703       0.550
             11  |     -0.583      0.591    -0.99   0.324       -1.742       0.575
             12  |     -0.721      0.624    -1.16   0.248       -1.944       0.501
             13  |     -0.382      0.585    -0.65   0.514       -1.530       0.765
             14  |     -0.699      0.595    -1.17   0.241       -1.865       0.468
             15  |     -0.770      0.607    -1.27   0.204       -1.959       0.418
             16  |     -0.633      0.647    -0.98   0.328       -1.901       0.635
             17  |     -0.751      0.717    -1.05   0.294       -2.156       0.653
             18  |     -0.037      0.669    -0.06   0.956       -1.348       1.274
                 |
         housing |
              2  |     -0.085      0.199    -0.43   0.669       -0.474       0.304
              3  |      0.768      0.466     1.65   0.099       -0.145       1.680
                 |
       home_type |
              2  |     -0.257      0.237    -1.08   0.279       -0.722       0.208
              3  |      0.061      0.218     0.28   0.780       -0.367       0.489
              4  |      0.172      0.345     0.50   0.619       -0.504       0.847
              5  |      0.666      1.153     0.58   0.564       -1.594       2.925
                 |
      1.internet |      0.136      0.240     0.57   0.571       -0.335       0.608
                 |
    phoneservice |
              2  |      0.369      0.342     1.08   0.281       -0.302       1.040
              3  |      0.176      0.366     0.48   0.632       -0.542       0.894
              4  |      0.494      0.338     1.46   0.144       -0.169       1.157
              5  |     -0.102      0.877    -0.12   0.908       -1.820       1.617
                 |
          device |
     Smartphone  |     -0.571      0.155    -3.70   0.000       -0.874      -0.269
         Tablet  |      0.178      0.279     0.64   0.525       -0.369       0.724
                 |
          durint |
       1-3 mins  |      0.758      0.701     1.08   0.280       -0.616       2.132
       4-6 mins  |      0.837      0.713     1.18   0.240       -0.559       2.234
       7-9 mins  |      0.460      0.764     0.60   0.547       -1.037       1.957
10 or more mins  |      0.696      0.738     0.94   0.346       -0.751       2.143
                 |
        partyid7 |     -0.113      0.037    -3.06   0.002       -0.185      -0.040
           _cons |      1.056      1.073     0.98   0.325       -1.047       3.159
----------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -1385.7829  
Iteration 1:   log pseudolikelihood = -1180.4897  
Iteration 2:   log pseudolikelihood =  -1178.864  
Iteration 3:   log pseudolikelihood = -1178.8585  
Iteration 4:   log pseudolikelihood = -1178.8585  

Logistic regression                             Number of obs     =      2,002
                                                Wald chi2(77)     =     221.20
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -1178.8585               Pseudo R2         =     0.1493

----------------------------------------------------------------------------------
                 |               Robust
             lib |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
         region4 |
              2  |     -0.009      0.212    -0.04   0.965       -0.425       0.407
              3  |     -0.400      0.205    -1.95   0.051       -0.801       0.002
              4  |      0.135      0.225     0.60   0.547       -0.305       0.576
                 |
         1.metro |      0.237      0.223     1.06   0.287       -0.200       0.673
        1.female |     -0.019      0.140    -0.14   0.891       -0.293       0.255
                 |
            age4 |
              2  |     -0.537      0.243    -2.21   0.027       -1.013      -0.061
              3  |     -0.966      0.257    -3.76   0.000       -1.470      -0.463
              4  |     -0.823      0.297    -2.77   0.006       -1.406      -0.241
                 |
           race4 |
              2  |     -0.189      0.256    -0.74   0.461       -0.690       0.313
              3  |      0.049      0.269     0.18   0.855       -0.479       0.577
              4  |     -0.453      0.206    -2.20   0.028       -0.858      -0.049
                 |
          hhsize |
              2  |     -0.529      0.228    -2.33   0.020       -0.976      -0.083
              3  |     -0.876      0.259    -3.39   0.001       -1.383      -0.370
              4  |     -0.724      0.284    -2.55   0.011       -1.280      -0.169
              5  |     -0.275      0.304    -0.91   0.365       -0.870       0.320
              6  |     -0.658      0.298    -2.21   0.027       -1.241      -0.075
                 |
         marital |
              2  |     -0.347      0.317    -1.10   0.273       -0.967       0.274
              3  |     -0.166      0.227    -0.73   0.464       -0.611       0.279
              4  |     -0.393      0.634    -0.62   0.536       -1.636       0.851
              5  |     -0.207      0.232    -0.89   0.372       -0.662       0.248
              6  |     -0.097      0.265    -0.37   0.713       -0.618       0.423
                 |
           relig |
              2  |      0.152      0.205     0.74   0.460       -0.250       0.553
              3  |     -0.405      0.624    -0.65   0.516       -1.629       0.818
              4  |      0.726      0.667     1.09   0.276       -0.581       2.032
              5  |      0.401      0.484     0.83   0.407       -0.546       1.349
              6  |      0.080      0.898     0.09   0.929       -1.680       1.839
              7  |     -0.788      0.595    -1.32   0.185       -1.953       0.378
              8  |     -1.026      0.816    -1.26   0.209       -2.625       0.573
              9  |      1.118      0.410     2.73   0.006        0.314       1.921
             10  |      0.522      0.378     1.38   0.168       -0.220       1.263
             11  |      0.847      0.246     3.44   0.001        0.364       1.330
             12  |     -0.094      0.190    -0.50   0.620       -0.466       0.278
             13  |      0.218      0.601     0.36   0.717       -0.959       1.395
             14  |      0.267      0.479     0.56   0.577       -0.671       1.206
             15  |     -0.631      0.718    -0.88   0.379       -2.039       0.777
                 |
           educ4 |
              2  |     -0.241      0.285    -0.84   0.398       -0.799       0.318
              3  |      0.263      0.270     0.98   0.329       -0.265       0.791
              4  |      0.939      0.289     3.25   0.001        0.374       1.505
                 |
          income |
              2  |     -0.897      0.637    -1.41   0.159       -2.146       0.352
              3  |     -0.887      0.617    -1.44   0.151       -2.097       0.323
              4  |     -0.555      0.590    -0.94   0.346       -1.711       0.600
              5  |     -0.510      0.552    -0.92   0.355       -1.591       0.571
              6  |     -0.803      0.565    -1.42   0.155       -1.910       0.304
              7  |     -0.401      0.575    -0.70   0.486       -1.528       0.727
              8  |     -0.740      0.602    -1.23   0.219       -1.921       0.440
              9  |     -1.173      0.548    -2.14   0.032       -2.247      -0.099
             10  |     -0.550      0.545    -1.01   0.313       -1.618       0.518
             11  |     -0.568      0.562    -1.01   0.312       -1.671       0.534
             12  |     -0.685      0.594    -1.15   0.249       -1.849       0.479
             13  |     -0.366      0.557    -0.66   0.511       -1.456       0.725
             14  |     -0.684      0.569    -1.20   0.229       -1.800       0.431
             15  |     -0.777      0.583    -1.33   0.183       -1.920       0.366
             16  |     -0.618      0.626    -0.99   0.324       -1.844       0.609
             17  |     -0.751      0.694    -1.08   0.279       -2.111       0.610
             18  |     -0.001      0.647    -0.00   0.999       -1.269       1.268
                 |
         housing |
              2  |     -0.087      0.197    -0.44   0.660       -0.474       0.300
              3  |      0.767      0.462     1.66   0.097       -0.138       1.672
                 |
       home_type |
              2  |     -0.234      0.237    -0.99   0.322       -0.698       0.229
              3  |      0.074      0.217     0.34   0.734       -0.352       0.499
              4  |      0.187      0.344     0.54   0.587       -0.488       0.862
              5  |      0.523      1.169     0.45   0.655       -1.769       2.814
                 |
      1.internet |      0.125      0.237     0.53   0.599       -0.340       0.589
                 |
    phoneservice |
              2  |      0.395      0.339     1.16   0.245       -0.270       1.060
              3  |      0.196      0.361     0.54   0.588       -0.512       0.904
              4  |      0.509      0.334     1.52   0.127       -0.146       1.165
              5  |      0.000      0.891     0.00   1.000       -1.746       1.746
                 |
          device |
     Smartphone  |     -0.557      0.154    -3.61   0.000       -0.860      -0.254
         Tablet  |      0.163      0.275     0.59   0.553       -0.376       0.703
                 |
          durint |
       1-3 mins  |      0.726      0.677     1.07   0.284       -0.601       2.053
       4-6 mins  |      0.824      0.688     1.20   0.231       -0.525       2.174
       7-9 mins  |      0.378      0.741     0.51   0.610       -1.075       1.831
10 or more mins  |      0.640      0.717     0.89   0.372       -0.765       2.044
                 |
           treat |
             ic  |     -0.327      0.362    -0.90   0.366       -1.036       0.382
            irl  |      0.489      0.364     1.34   0.179       -0.225       1.203
                 |
        partyid7 |     -0.089      0.056    -1.58   0.113       -0.199       0.021
                 |
treat#c.partyid7 |
             ic  |      0.038      0.082     0.46   0.648       -0.124       0.199
            irl  |     -0.109      0.081    -1.35   0.178       -0.268       0.050
                 |
           _cons |      1.004      1.055     0.95   0.342       -1.065       3.072
----------------------------------------------------------------------------------

. 
. estimates dir

-------------------------------------------------------
        name | command      depvar       npar  title 
-------------+-----------------------------------------
      spk_r1 | logit        spk            92  
      spk_r2 | logit        spk            90  
      spk_r3 | logit        spk            96  
      col_r1 | logit        col            92  
      col_r2 | logit        col            90  
      col_r3 | logit        col            96  
      lib_r1 | logit        lib            92  
      lib_r2 | logit        lib            90  
      lib_r3 | logit        lib            96  
-------------------------------------------------------

. 
. outreg2 [*] ///
>   using docs/logit-estimates-with-covariates.xls, ///
>   noaster stats(coef se ci pval)  dec(3)  ///
>   paren(se) bracket(ci) ///
>   excel replace
docs/logit-estimates-with-covariates.xls
dir : seeout

. 
. estimates clear

. 
. foreach dom in `domain' {
  2. 
. logit `dom' `covariates' b1.treat [pweight=weight]
  3.   margins b1.treat, post
  4.   estimates store `dom'_r1
  5.     quietly logit `dom' `covariates' b1.treat [pweight=weight]
  6.     margins, dydx(b1.treat) post
  7.     estimates store `dom'_r1d1
  8.     quietly logit `dom' `covariates' b2.treat [pweight=weight]
  9.     margins, dydx(b2.treat) post
 10.     estimates store `dom'_r1d2
 11. 
. logit `dom' `covariates' c.partyid7 [pweight=weight]
 12.   margins, dydx(c.partyid7) post
 13.   estimates store `dom'_r2
 14.    
. logit `dom' `covariates' b1.treat##c.partyid7 [pweight=weight]
 15.   margins b1.treat, post
 16.   estimates store `dom'_r3
 17.     quietly logit `dom' `covariates' b1.treat##c.partyid7 [pweight=weight]
 18.     margins, dydx(b1.treat) post
 19.     estimates store `dom'_r3d1
 20.     quietly logit `dom' `covariates' b2.treat##c.partyid7 [pweight=weight]
 21.     margins, dydx(b2.treat) post
 22.     estimates store `dom'_r3d2
 23.   quietly logit `dom' `covariates' b1.treat##c.partyid7 [pweight=weight]
 24.     margins, dydx(c.partyid7) post
 25.     estimates store `dom'_r4
 26.   quietly logit `dom' `covariates' b1.treat##c.partyid7 [pweight=weight]
 27.     margins, dydx(partyid7) at(treat = (1(1)3)) post
 28.     estimates store `dom'_r5
 29.   quietly logit `dom' `covariates' b1.treat##c.partyid7 [pweight=weight] 
 30.     margins, dydx(b1.treat) at(partyid = (1(1)7)) post
 31.     estimates store `dom'_r6
 32.         
. }

Iteration 0:   log pseudolikelihood = -1385.8683  
Iteration 1:   log pseudolikelihood = -1210.6315  
Iteration 2:   log pseudolikelihood = -1209.6478  
Iteration 3:   log pseudolikelihood = -1209.6392  
Iteration 4:   log pseudolikelihood = -1209.6392  

Logistic regression                             Number of obs     =      2,016
                                                Wald chi2(74)     =     176.08
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -1209.6392               Pseudo R2         =     0.1272

----------------------------------------------------------------------------------
                 |               Robust
             spk |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
         region4 |
              2  |      0.128      0.215     0.59   0.553       -0.294       0.550
              3  |     -0.052      0.211    -0.24   0.807       -0.466       0.363
              4  |      0.174      0.230     0.76   0.449       -0.276       0.624
                 |
         1.metro |      0.115      0.226     0.51   0.610       -0.328       0.558
        1.female |     -0.565      0.133    -4.26   0.000       -0.825      -0.305
                 |
            age4 |
              2  |     -0.498      0.235    -2.12   0.034       -0.957      -0.038
              3  |     -0.817      0.251    -3.25   0.001       -1.309      -0.325
              4  |     -0.816      0.289    -2.82   0.005       -1.381      -0.250
                 |
           race4 |
              2  |      0.019      0.238     0.08   0.938       -0.448       0.486
              3  |     -0.199      0.286    -0.70   0.486       -0.760       0.362
              4  |      0.215      0.216     1.00   0.319       -0.208       0.638
                 |
          hhsize |
              2  |     -0.352      0.239    -1.47   0.141       -0.820       0.117
              3  |     -0.494      0.260    -1.90   0.058       -1.004       0.017
              4  |      0.051      0.284     0.18   0.858       -0.505       0.607
              5  |     -0.094      0.319    -0.30   0.768       -0.720       0.531
              6  |     -0.165      0.324    -0.51   0.609       -0.800       0.469
                 |
         marital |
              2  |     -0.264      0.417    -0.63   0.526       -1.080       0.552
              3  |      0.057      0.239     0.24   0.813       -0.412       0.525
              4  |      1.127      0.487     2.32   0.021        0.173       2.081
              5  |      0.091      0.231     0.39   0.695       -0.362       0.543
              6  |      0.386      0.259     1.49   0.137       -0.122       0.895
                 |
           relig |
              2  |     -0.361      0.209    -1.73   0.084       -0.771       0.049
              3  |     -0.788      0.744    -1.06   0.290       -2.247       0.671
              4  |      2.596      1.081     2.40   0.016        0.477       4.715
              5  |      0.521      0.474     1.10   0.271       -0.408       1.451
              6  |     -0.782      0.854    -0.92   0.360       -2.456       0.891
              7  |      0.676      0.567     1.19   0.234       -0.436       1.788
              8  |     -1.760      0.884    -1.99   0.046       -3.492      -0.027
              9  |      0.903      0.370     2.44   0.015        0.179       1.627
             10  |      0.335      0.337     0.99   0.320       -0.325       0.995
             11  |      0.444      0.223     1.99   0.047        0.007       0.881
             12  |     -0.179      0.191    -0.94   0.348       -0.554       0.195
             13  |      0.549      0.502     1.09   0.274       -0.435       1.533
             14  |      0.448      0.511     0.88   0.381       -0.553       1.448
             15  |      0.358      0.629     0.57   0.570       -0.876       1.592
                 |
           educ4 |
              2  |      0.409      0.354     1.15   0.248       -0.285       1.103
              3  |      0.918      0.344     2.67   0.008        0.245       1.591
              4  |      1.282      0.359     3.57   0.000        0.578       1.985
                 |
          income |
              2  |      0.426      0.682     0.62   0.532       -0.911       1.762
              3  |     -0.131      0.678    -0.19   0.847       -1.459       1.197
              4  |     -0.433      0.602    -0.72   0.472       -1.613       0.747
              5  |      0.106      0.605     0.18   0.861       -1.081       1.293
              6  |     -0.358      0.591    -0.60   0.545       -1.516       0.801
              7  |     -0.262      0.592    -0.44   0.658       -1.423       0.899
              8  |     -0.289      0.622    -0.46   0.642       -1.509       0.931
              9  |     -0.285      0.592    -0.48   0.630       -1.445       0.875
             10  |     -0.017      0.593    -0.03   0.977       -1.180       1.145
             11  |     -0.290      0.582    -0.50   0.618       -1.431       0.851
             12  |     -0.201      0.626    -0.32   0.748       -1.427       1.025
             13  |      0.258      0.588     0.44   0.661       -0.894       1.410
             14  |     -0.103      0.588    -0.18   0.860       -1.256       1.049
             15  |     -0.360      0.615    -0.59   0.558       -1.566       0.845
             16  |     -0.220      0.635    -0.35   0.730       -1.465       1.026
             17  |      0.954      0.700     1.36   0.173       -0.419       2.326
             18  |      0.167      0.636     0.26   0.793       -1.079       1.414
                 |
         housing |
              2  |      0.322      0.198     1.63   0.104       -0.066       0.710
              3  |     -0.081      0.556    -0.15   0.884       -1.171       1.008
                 |
       home_type |
              2  |     -0.490      0.236    -2.08   0.038       -0.951      -0.028
              3  |     -0.488      0.226    -2.16   0.031       -0.930      -0.046
              4  |      0.813      0.356     2.28   0.023        0.114       1.511
              5  |     -1.237      1.089    -1.14   0.256       -3.371       0.898
                 |
      1.internet |      0.069      0.240     0.29   0.774       -0.401       0.538
                 |
    phoneservice |
              2  |     -0.263      0.353    -0.75   0.456       -0.956       0.429
              3  |     -0.053      0.370    -0.14   0.886       -0.779       0.673
              4  |     -0.239      0.351    -0.68   0.495       -0.927       0.448
              5  |      0.382      0.848     0.45   0.652       -1.280       2.044
                 |
          device |
     Smartphone  |     -0.547      0.153    -3.57   0.000       -0.847      -0.247
         Tablet  |     -0.088      0.275    -0.32   0.748       -0.628       0.451
                 |
          durint |
       1-3 mins  |     -1.305      0.772    -1.69   0.091       -2.819       0.208
       4-6 mins  |     -1.426      0.782    -1.82   0.068       -2.958       0.107
       7-9 mins  |     -1.245      0.828    -1.50   0.133       -2.868       0.378
10 or more mins  |     -1.590      0.807    -1.97   0.049       -3.172      -0.009
                 |
           treat |
             ic  |     -0.411      0.162    -2.54   0.011       -0.729      -0.093
            irl  |     -0.261      0.159    -1.64   0.100       -0.572       0.050
                 |
           _cons |      1.928      1.069     1.80   0.071       -0.167       4.023
----------------------------------------------------------------------------------

Predictive margins                              Number of obs     =      2,016
Model VCE    : Robust

Expression   : Pr(spk), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.492      0.023    21.58   0.000        0.447       0.536
         ic  |      0.406      0.024    17.00   0.000        0.360       0.453
        irl  |      0.437      0.024    18.13   0.000        0.390       0.484
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,016
Model VCE    : Robust

Expression   : Pr(spk), predict()
dy/dx w.r.t. : 2.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.085      0.033    -2.56   0.010       -0.150      -0.020
        irl  |     -0.054      0.033    -1.65   0.100       -0.119       0.010
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,016
Model VCE    : Robust

Expression   : Pr(spk), predict()
dy/dx w.r.t. : 1.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.085      0.033     2.56   0.010        0.020       0.150
        irl  |      0.031      0.034     0.91   0.365       -0.036       0.097
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Iteration 0:   log pseudolikelihood = -1380.5082  
Iteration 1:   log pseudolikelihood = -1206.3317  
Iteration 2:   log pseudolikelihood = -1205.2584  
Iteration 3:   log pseudolikelihood = -1205.2502  
Iteration 4:   log pseudolikelihood = -1205.2502  

Logistic regression                             Number of obs     =      2,009
                                                Wald chi2(73)     =     175.29
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -1205.2502               Pseudo R2         =     0.1270

----------------------------------------------------------------------------------
                 |               Robust
             spk |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
         region4 |
              2  |      0.121      0.219     0.55   0.580       -0.308       0.550
              3  |     -0.019      0.214    -0.09   0.928       -0.439       0.400
              4  |      0.181      0.233     0.78   0.437       -0.276       0.639
                 |
         1.metro |      0.115      0.222     0.52   0.605       -0.320       0.550
        1.female |     -0.586      0.134    -4.39   0.000       -0.848      -0.325
                 |
            age4 |
              2  |     -0.541      0.237    -2.29   0.022       -1.005      -0.077
              3  |     -0.827      0.253    -3.27   0.001       -1.322      -0.332
              4  |     -0.838      0.292    -2.87   0.004       -1.411      -0.265
                 |
           race4 |
              2  |     -0.117      0.250    -0.47   0.639       -0.607       0.373
              3  |     -0.242      0.281    -0.86   0.389       -0.794       0.309
              4  |      0.106      0.220     0.48   0.629       -0.325       0.537
                 |
          hhsize |
              2  |     -0.363      0.239    -1.52   0.129       -0.830       0.105
              3  |     -0.496      0.259    -1.92   0.055       -1.003       0.011
              4  |      0.096      0.285     0.34   0.736       -0.463       0.655
              5  |     -0.104      0.313    -0.33   0.739       -0.719       0.510
              6  |     -0.129      0.316    -0.41   0.682       -0.748       0.490
                 |
         marital |
              2  |     -0.320      0.406    -0.79   0.430       -1.116       0.475
              3  |      0.027      0.238     0.11   0.910       -0.440       0.494
              4  |      1.279      0.479     2.67   0.008        0.340       2.218
              5  |      0.055      0.232     0.24   0.813       -0.400       0.510
              6  |      0.333      0.259     1.29   0.198       -0.174       0.840
                 |
           relig |
              2  |     -0.369      0.209    -1.77   0.077       -0.778       0.040
              3  |     -0.818      0.732    -1.12   0.264       -2.252       0.616
              4  |      2.434      1.119     2.18   0.030        0.241       4.628
              5  |      0.475      0.477     1.00   0.319       -0.459       1.409
              6  |     -0.817      0.925    -0.88   0.377       -2.630       0.995
              7  |      0.558      0.568     0.98   0.326       -0.556       1.672
              8  |     -1.767      0.889    -1.99   0.047       -3.509      -0.026
              9  |      0.763      0.382     2.00   0.046        0.015       1.512
             10  |      0.225      0.342     0.66   0.511       -0.446       0.896
             11  |      0.400      0.228     1.75   0.080       -0.047       0.848
             12  |     -0.186      0.194    -0.96   0.339       -0.567       0.195
             13  |      0.470      0.504     0.93   0.351       -0.517       1.458
             14  |      0.340      0.492     0.69   0.489       -0.624       1.304
             15  |      0.301      0.689     0.44   0.662       -1.050       1.652
                 |
           educ4 |
              2  |      0.447      0.365     1.23   0.221       -0.268       1.162
              3  |      0.950      0.352     2.70   0.007        0.261       1.639
              4  |      1.301      0.369     3.53   0.000        0.578       2.023
                 |
          income |
              2  |      0.460      0.681     0.68   0.499       -0.875       1.795
              3  |     -0.082      0.692    -0.12   0.905       -1.439       1.275
              4  |     -0.428      0.624    -0.69   0.493       -1.651       0.794
              5  |      0.146      0.623     0.23   0.815       -1.075       1.367
              6  |     -0.316      0.611    -0.52   0.605       -1.513       0.881
              7  |     -0.202      0.612    -0.33   0.742       -1.402       0.999
              8  |     -0.315      0.636    -0.49   0.621       -1.561       0.932
              9  |     -0.249      0.615    -0.41   0.685       -1.455       0.956
             10  |      0.080      0.611     0.13   0.896       -1.118       1.278
             11  |     -0.285      0.604    -0.47   0.636       -1.468       0.898
             12  |     -0.138      0.646    -0.21   0.831       -1.404       1.128
             13  |      0.331      0.606     0.55   0.585       -0.858       1.519
             14  |     -0.011      0.607    -0.02   0.986       -1.201       1.180
             15  |     -0.248      0.633    -0.39   0.695       -1.489       0.992
             16  |     -0.149      0.652    -0.23   0.819       -1.427       1.129
             17  |      1.011      0.722     1.40   0.161       -0.404       2.426
             18  |      0.297      0.659     0.45   0.653       -0.996       1.589
                 |
         housing |
              2  |      0.327      0.201     1.63   0.104       -0.067       0.721
              3  |     -0.051      0.541    -0.09   0.926       -1.111       1.009
                 |
       home_type |
              2  |     -0.473      0.237    -2.00   0.046       -0.937      -0.009
              3  |     -0.507      0.229    -2.21   0.027       -0.956      -0.057
              4  |      0.825      0.349     2.36   0.018        0.141       1.509
              5  |     -1.342      1.072    -1.25   0.210       -3.443       0.758
                 |
      1.internet |      0.034      0.241     0.14   0.888       -0.438       0.505
                 |
    phoneservice |
              2  |     -0.297      0.367    -0.81   0.418       -1.016       0.422
              3  |     -0.062      0.383    -0.16   0.871       -0.812       0.688
              4  |     -0.227      0.364    -0.62   0.532       -0.941       0.486
              5  |      0.331      0.854     0.39   0.698       -1.343       2.005
                 |
          device |
     Smartphone  |     -0.538      0.155    -3.48   0.001       -0.840      -0.235
         Tablet  |     -0.073      0.275    -0.27   0.790       -0.612       0.466
                 |
          durint |
       1-3 mins  |     -1.478      0.751    -1.97   0.049       -2.950      -0.006
       4-6 mins  |     -1.579      0.759    -2.08   0.037       -3.066      -0.092
       7-9 mins  |     -1.434      0.808    -1.78   0.076       -3.018       0.149
10 or more mins  |     -1.721      0.787    -2.19   0.029       -3.264      -0.178
                 |
        partyid7 |     -0.059      0.038    -1.55   0.121       -0.133       0.016
           _cons |      2.143      1.095     1.96   0.050       -0.004       4.289
----------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,009
Model VCE    : Robust

Expression   : Pr(spk), predict()
dy/dx w.r.t. : partyid7

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    partyid7 |     -0.012      0.008    -1.55   0.121       -0.028       0.003
------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -1380.5082  
Iteration 1:   log pseudolikelihood = -1199.2246  
Iteration 2:   log pseudolikelihood = -1198.1816  
Iteration 3:   log pseudolikelihood = -1198.1731  
Iteration 4:   log pseudolikelihood = -1198.1731  

Logistic regression                             Number of obs     =      2,009
                                                Wald chi2(77)     =     187.95
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -1198.1731               Pseudo R2         =     0.1321

----------------------------------------------------------------------------------
                 |               Robust
             spk |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
         region4 |
              2  |      0.135      0.216     0.62   0.534       -0.289       0.559
              3  |     -0.015      0.213    -0.07   0.945       -0.432       0.402
              4  |      0.192      0.231     0.83   0.406       -0.261       0.645
                 |
         1.metro |      0.139      0.226     0.62   0.539       -0.304       0.583
        1.female |     -0.602      0.134    -4.50   0.000       -0.864      -0.340
                 |
            age4 |
              2  |     -0.552      0.235    -2.35   0.019       -1.013      -0.091
              3  |     -0.838      0.251    -3.34   0.001       -1.330      -0.346
              4  |     -0.840      0.290    -2.90   0.004       -1.408      -0.272
                 |
           race4 |
              2  |     -0.128      0.249    -0.52   0.605       -0.616       0.359
              3  |     -0.223      0.283    -0.79   0.431       -0.778       0.332
              4  |      0.129      0.219     0.59   0.556       -0.300       0.557
                 |
          hhsize |
              2  |     -0.377      0.241    -1.56   0.119       -0.850       0.096
              3  |     -0.500      0.262    -1.91   0.056       -1.013       0.013
              4  |      0.066      0.285     0.23   0.817       -0.493       0.625
              5  |     -0.065      0.318    -0.20   0.838       -0.688       0.558
              6  |     -0.148      0.325    -0.45   0.650       -0.785       0.490
                 |
         marital |
              2  |     -0.294      0.415    -0.71   0.479       -1.107       0.519
              3  |      0.064      0.241     0.27   0.790       -0.408       0.537
              4  |      1.331      0.471     2.82   0.005        0.407       2.254
              5  |      0.048      0.232     0.21   0.837       -0.407       0.502
              6  |      0.383      0.259     1.48   0.140       -0.125       0.891
                 |
           relig |
              2  |     -0.384      0.210    -1.83   0.067       -0.796       0.028
              3  |     -0.820      0.773    -1.06   0.289       -2.335       0.695
              4  |      2.477      1.124     2.20   0.028        0.273       4.680
              5  |      0.453      0.473     0.96   0.338       -0.473       1.379
              6  |     -0.802      0.860    -0.93   0.351       -2.487       0.883
              7  |      0.544      0.567     0.96   0.337       -0.566       1.654
              8  |     -1.820      0.890    -2.04   0.041       -3.566      -0.075
              9  |      0.778      0.387     2.01   0.044        0.020       1.536
             10  |      0.237      0.350     0.68   0.498       -0.449       0.923
             11  |      0.403      0.230     1.75   0.080       -0.048       0.855
             12  |     -0.181      0.191    -0.95   0.345       -0.556       0.194
             13  |      0.447      0.507     0.88   0.378       -0.547       1.441
             14  |      0.385      0.517     0.75   0.456       -0.628       1.399
             15  |      0.434      0.677     0.64   0.522       -0.893       1.761
                 |
           educ4 |
              2  |      0.446      0.361     1.23   0.217       -0.262       1.154
              3  |      0.975      0.350     2.79   0.005        0.290       1.660
              4  |      1.313      0.366     3.59   0.000        0.595       2.030
                 |
          income |
              2  |      0.459      0.685     0.67   0.503       -0.884       1.802
              3  |     -0.084      0.685    -0.12   0.903       -1.427       1.259
              4  |     -0.417      0.608    -0.69   0.492       -1.609       0.774
              5  |      0.092      0.618     0.15   0.881       -1.118       1.303
              6  |     -0.326      0.598    -0.55   0.585       -1.498       0.845
              7  |     -0.249      0.601    -0.41   0.679       -1.427       0.930
              8  |     -0.353      0.623    -0.57   0.571       -1.574       0.868
              9  |     -0.288      0.599    -0.48   0.631       -1.463       0.887
             10  |      0.031      0.601     0.05   0.959       -1.146       1.209
             11  |     -0.261      0.591    -0.44   0.659       -1.419       0.898
             12  |     -0.182      0.632    -0.29   0.774       -1.420       1.057
             13  |      0.317      0.596     0.53   0.595       -0.850       1.484
             14  |     -0.070      0.596    -0.12   0.907       -1.239       1.099
             15  |     -0.316      0.626    -0.51   0.613       -1.543       0.911
             16  |     -0.169      0.642    -0.26   0.792       -1.428       1.090
             17  |      1.007      0.702     1.43   0.151       -0.369       2.383
             18  |      0.264      0.644     0.41   0.682       -0.998       1.527
                 |
         housing |
              2  |      0.297      0.199     1.50   0.135       -0.092       0.686
              3  |     -0.057      0.560    -0.10   0.919       -1.155       1.041
                 |
       home_type |
              2  |     -0.461      0.236    -1.95   0.051       -0.924       0.002
              3  |     -0.480      0.226    -2.12   0.034       -0.923      -0.037
              4  |      0.852      0.353     2.41   0.016        0.160       1.543
              5  |     -1.244      1.071    -1.16   0.245       -3.342       0.855
                 |
      1.internet |      0.054      0.240     0.22   0.823       -0.417       0.524
                 |
    phoneservice |
              2  |     -0.295      0.358    -0.83   0.409       -0.997       0.406
              3  |     -0.091      0.375    -0.24   0.808       -0.826       0.643
              4  |     -0.242      0.356    -0.68   0.496       -0.939       0.455
              5  |      0.411      0.821     0.50   0.617       -1.198       2.019
                 |
          device |
     Smartphone  |     -0.529      0.153    -3.46   0.001       -0.829      -0.229
         Tablet  |     -0.081      0.277    -0.29   0.769       -0.623       0.461
                 |
          durint |
       1-3 mins  |     -1.349      0.743    -1.81   0.070       -2.806       0.108
       4-6 mins  |     -1.459      0.752    -1.94   0.052       -2.933       0.015
       7-9 mins  |     -1.244      0.801    -1.55   0.120       -2.813       0.326
10 or more mins  |     -1.632      0.782    -2.09   0.037       -3.164      -0.100
                 |
           treat |
             ic  |      0.105      0.348     0.30   0.762       -0.576       0.787
            irl  |     -0.123      0.345    -0.36   0.720       -0.799       0.552
                 |
        partyid7 |     -0.011      0.056    -0.19   0.850       -0.120       0.099
                 |
treat#c.partyid7 |
             ic  |     -0.128      0.080    -1.60   0.109       -0.285       0.028
            irl  |     -0.030      0.079    -0.38   0.707       -0.186       0.126
                 |
           _cons |      2.020      1.071     1.89   0.059       -0.079       4.120
----------------------------------------------------------------------------------

Predictive margins                              Number of obs     =      2,009
Model VCE    : Robust

Expression   : Pr(spk), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.489      0.023    21.40   0.000        0.444       0.534
         ic  |      0.410      0.024    17.21   0.000        0.363       0.456
        irl  |      0.439      0.024    18.08   0.000        0.392       0.487
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,009
Model VCE    : Robust

Expression   : Pr(spk), predict()
dy/dx w.r.t. : 2.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.079      0.033    -2.37   0.018       -0.145      -0.014
        irl  |     -0.050      0.033    -1.49   0.136       -0.115       0.016
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,009
Model VCE    : Robust

Expression   : Pr(spk), predict()
dy/dx w.r.t. : 1.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.079      0.033     2.37   0.018        0.014       0.145
        irl  |      0.030      0.034     0.87   0.384       -0.037       0.096
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,009
Model VCE    : Robust

Expression   : Pr(spk), predict()
dy/dx w.r.t. : partyid7

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    partyid7 |     -0.013      0.008    -1.62   0.105       -0.028       0.003
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,009
Model VCE    : Robust

Expression   : Pr(spk), predict()
dy/dx w.r.t. : partyid7

1._at        : treat           =           1

2._at        : treat           =           2

3._at        : treat           =           3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
partyid7     |
         _at |
          1  |     -0.002      0.012    -0.19   0.850       -0.025       0.021
          2  |     -0.028      0.012    -2.33   0.020       -0.051      -0.004
          3  |     -0.008      0.013    -0.64   0.520       -0.034       0.017
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,009
Model VCE    : Robust

Expression   : Pr(spk), predict()
dy/dx w.r.t. : 2.treat 3.treat

1._at        : partyid7        =           1

2._at        : partyid7        =           2

3._at        : partyid7        =           3

4._at        : partyid7        =           4

5._at        : partyid7        =           5

6._at        : partyid7        =           6

7._at        : partyid7        =           7

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1.treat      |  (base outcome)
-------------+----------------------------------------------------------------
2.treat      |
         _at |
          1  |     -0.005      0.059    -0.08   0.935       -0.120       0.110
          2  |     -0.032      0.046    -0.69   0.491       -0.121       0.058
          3  |     -0.058      0.037    -1.59   0.112       -0.130       0.014
          4  |     -0.084      0.034    -2.51   0.012       -0.150      -0.018
          5  |     -0.110      0.038    -2.88   0.004       -0.184      -0.035
          6  |     -0.134      0.048    -2.83   0.005       -0.228      -0.041
          7  |     -0.158      0.059    -2.67   0.008       -0.275      -0.042
-------------+----------------------------------------------------------------
3.treat      |
         _at |
          1  |     -0.032      0.058    -0.55   0.579       -0.145       0.081
          2  |     -0.038      0.045    -0.85   0.398       -0.127       0.050
          3  |     -0.044      0.036    -1.23   0.219       -0.115       0.026
          4  |     -0.051      0.033    -1.51   0.130       -0.116       0.015
          5  |     -0.057      0.038    -1.48   0.139       -0.132       0.018
          6  |     -0.063      0.049    -1.29   0.197       -0.158       0.032
          7  |     -0.069      0.061    -1.12   0.263       -0.189       0.052
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Iteration 0:   log pseudolikelihood = -1130.5407  
Iteration 1:   log pseudolikelihood =  -1004.594  
Iteration 2:   log pseudolikelihood = -999.30017  
Iteration 3:   log pseudolikelihood = -999.28176  
Iteration 4:   log pseudolikelihood = -999.28175  

Logistic regression                             Number of obs     =      2,012
                                                Wald chi2(74)     =     159.49
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -999.28175               Pseudo R2         =     0.1161

----------------------------------------------------------------------------------
                 |               Robust
             col |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
         region4 |
              2  |      0.287      0.252     1.14   0.255       -0.207       0.781
              3  |      0.071      0.242     0.29   0.771       -0.404       0.545
              4  |      0.378      0.246     1.54   0.124       -0.104       0.859
                 |
         1.metro |      0.284      0.275     1.03   0.303       -0.256       0.823
        1.female |     -0.200      0.154    -1.30   0.193       -0.502       0.101
                 |
            age4 |
              2  |     -0.353      0.241    -1.46   0.143       -0.824       0.119
              3  |     -0.747      0.271    -2.76   0.006       -1.279      -0.216
              4  |     -0.999      0.320    -3.12   0.002       -1.627      -0.372
                 |
           race4 |
              2  |      0.120      0.256     0.47   0.638       -0.381       0.622
              3  |     -0.059      0.298    -0.20   0.843       -0.643       0.525
              4  |     -0.299      0.245    -1.22   0.223       -0.778       0.181
                 |
          hhsize |
              2  |     -0.240      0.263    -0.91   0.360       -0.755       0.275
              3  |     -0.442      0.288    -1.54   0.125       -1.006       0.122
              4  |     -0.129      0.328    -0.39   0.693       -0.772       0.513
              5  |     -0.273      0.352    -0.78   0.437       -0.963       0.417
              6  |      0.118      0.328     0.36   0.718       -0.525       0.762
                 |
         marital |
              2  |      0.383      0.442     0.87   0.387       -0.484       1.250
              3  |     -0.111      0.256    -0.43   0.664       -0.612       0.390
              4  |      1.205      0.621     1.94   0.052       -0.011       2.422
              5  |      0.230      0.261     0.88   0.379       -0.282       0.741
              6  |      0.535      0.278     1.92   0.055       -0.011       1.081
                 |
           relig |
              2  |     -0.171      0.254    -0.67   0.501       -0.670       0.327
              3  |     -0.820      0.737    -1.11   0.266       -2.265       0.624
              4  |      2.203      0.889     2.48   0.013        0.461       3.945
              5  |      0.424      0.539     0.79   0.431       -0.632       1.481
              6  |     -0.143      1.042    -0.14   0.891       -2.185       1.898
              7  |     -0.154      0.719    -0.21   0.831       -1.564       1.257
              8  |     -2.172      1.088    -2.00   0.046       -4.304      -0.040
              9  |      0.530      0.319     1.66   0.097       -0.096       1.155
             10  |      0.178      0.354     0.50   0.615       -0.516       0.873
             11  |      0.554      0.247     2.24   0.025        0.070       1.037
             12  |      0.068      0.231     0.29   0.768       -0.384       0.520
             13  |      1.020      0.508     2.01   0.044        0.025       2.015
             14  |      0.573      0.450     1.27   0.203       -0.309       1.455
             15  |      1.399      0.651     2.15   0.032        0.123       2.675
                 |
           educ4 |
              2  |     -0.428      0.383    -1.12   0.263       -1.179       0.322
              3  |     -0.110      0.366    -0.30   0.765       -0.827       0.608
              4  |      0.647      0.379     1.71   0.088       -0.095       1.390
                 |
          income |
              2  |      0.095      0.714     0.13   0.894       -1.304       1.493
              3  |     -0.125      0.685    -0.18   0.855       -1.468       1.218
              4  |     -0.739      0.606    -1.22   0.223       -1.927       0.450
              5  |     -0.490      0.619    -0.79   0.429       -1.703       0.724
              6  |     -0.315      0.583    -0.54   0.589       -1.457       0.827
              7  |     -0.143      0.587    -0.24   0.808       -1.293       1.008
              8  |     -0.241      0.578    -0.42   0.676       -1.375       0.892
              9  |     -0.586      0.562    -1.04   0.297       -1.688       0.515
             10  |      0.123      0.551     0.22   0.824       -0.957       1.202
             11  |     -0.683      0.556    -1.23   0.220       -1.773       0.408
             12  |     -0.129      0.622    -0.21   0.835       -1.349       1.090
             13  |      0.026      0.547     0.05   0.962       -1.045       1.098
             14  |     -0.263      0.553    -0.48   0.634       -1.347       0.821
             15  |     -0.487      0.581    -0.84   0.403       -1.626       0.653
             16  |     -0.458      0.614    -0.75   0.455       -1.661       0.745
             17  |      0.886      0.692     1.28   0.201       -0.471       2.243
             18  |     -0.194      0.612    -0.32   0.751       -1.394       1.005
                 |
         housing |
              2  |      0.314      0.219     1.43   0.153       -0.116       0.744
              3  |     -0.152      0.605    -0.25   0.801       -1.338       1.034
                 |
       home_type |
              2  |     -0.317      0.273    -1.16   0.245       -0.851       0.217
              3  |     -0.575      0.247    -2.33   0.020       -1.059      -0.092
              4  |      0.422      0.379     1.11   0.265       -0.320       1.164
              5  |     -1.421      0.959    -1.48   0.139       -3.301       0.460
                 |
      1.internet |     -0.113      0.274    -0.41   0.679       -0.650       0.423
                 |
    phoneservice |
              2  |     -0.637      0.366    -1.74   0.081       -1.354       0.079
              3  |     -0.453      0.394    -1.15   0.250       -1.226       0.319
              4  |     -0.566      0.366    -1.55   0.122       -1.284       0.152
              5  |     -1.707      0.822    -2.08   0.038       -3.319      -0.095
                 |
          device |
     Smartphone  |     -0.203      0.169    -1.20   0.229       -0.534       0.128
         Tablet  |      0.249      0.300     0.83   0.406       -0.339       0.838
                 |
          durint |
       1-3 mins  |     -1.276      0.801    -1.59   0.111       -2.846       0.294
       4-6 mins  |     -1.175      0.814    -1.44   0.149       -2.771       0.420
       7-9 mins  |     -1.670      0.890    -1.88   0.061       -3.413       0.074
10 or more mins  |     -1.884      0.859    -2.19   0.028       -3.568      -0.200
                 |
           treat |
             ic  |     -0.330      0.178    -1.85   0.064       -0.680       0.019
            irl  |     -0.298      0.180    -1.65   0.099       -0.651       0.056
                 |
           _cons |      1.476      1.088     1.36   0.175       -0.657       3.608
----------------------------------------------------------------------------------

Predictive margins                              Number of obs     =      2,012
Model VCE    : Robust

Expression   : Pr(col), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.283      0.021    13.21   0.000        0.241       0.325
         ic  |      0.228      0.020    11.45   0.000        0.189       0.268
        irl  |      0.233      0.021    11.04   0.000        0.192       0.275
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,012
Model VCE    : Robust

Expression   : Pr(col), predict()
dy/dx w.r.t. : 2.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.055      0.029    -1.86   0.063       -0.112       0.003
        irl  |     -0.049      0.030    -1.67   0.096       -0.108       0.009
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,012
Model VCE    : Robust

Expression   : Pr(col), predict()
dy/dx w.r.t. : 1.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.055      0.029     1.86   0.063       -0.003       0.112
        irl  |      0.005      0.029     0.17   0.863       -0.053       0.063
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Iteration 0:   log pseudolikelihood = -1122.4494  
Iteration 1:   log pseudolikelihood =  -991.1827  
Iteration 2:   log pseudolikelihood = -985.37531  
Iteration 3:   log pseudolikelihood = -985.35815  
Iteration 4:   log pseudolikelihood = -985.35815  

Logistic regression                             Number of obs     =      2,005
                                                Wald chi2(73)     =     172.11
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -985.35815               Pseudo R2         =     0.1221

----------------------------------------------------------------------------------
                 |               Robust
             col |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
         region4 |
              2  |      0.332      0.265     1.25   0.211       -0.188       0.852
              3  |      0.173      0.255     0.68   0.496       -0.326       0.673
              4  |      0.439      0.260     1.69   0.092       -0.072       0.949
                 |
         1.metro |      0.282      0.274     1.03   0.304       -0.255       0.818
        1.female |     -0.267      0.158    -1.69   0.091       -0.576       0.042
                 |
            age4 |
              2  |     -0.380      0.241    -1.57   0.115       -0.852       0.093
              3  |     -0.735      0.273    -2.69   0.007       -1.270      -0.200
              4  |     -1.032      0.319    -3.24   0.001       -1.657      -0.407
                 |
           race4 |
              2  |     -0.125      0.271    -0.46   0.646       -0.656       0.407
              3  |     -0.174      0.295    -0.59   0.556       -0.752       0.405
              4  |     -0.445      0.251    -1.77   0.077       -0.938       0.048
                 |
          hhsize |
              2  |     -0.293      0.271    -1.08   0.281       -0.825       0.239
              3  |     -0.454      0.290    -1.57   0.118       -1.023       0.115
              4  |     -0.117      0.337    -0.35   0.729       -0.777       0.543
              5  |     -0.343      0.351    -0.98   0.329       -1.031       0.346
              6  |      0.130      0.329     0.39   0.693       -0.515       0.775
                 |
         marital |
              2  |      0.307      0.454     0.68   0.499       -0.583       1.197
              3  |     -0.176      0.257    -0.68   0.494       -0.679       0.328
              4  |      1.356      0.562     2.41   0.016        0.254       2.458
              5  |      0.087      0.270     0.32   0.747       -0.442       0.617
              6  |      0.476      0.278     1.71   0.087       -0.069       1.021
                 |
           relig |
              2  |     -0.215      0.262    -0.82   0.413       -0.729       0.299
              3  |     -0.929      0.779    -1.19   0.233       -2.456       0.598
              4  |      2.034      0.877     2.32   0.020        0.314       3.753
              5  |      0.360      0.544     0.66   0.509       -0.707       1.426
              6  |     -0.199      1.144    -0.17   0.862       -2.441       2.043
              7  |     -0.215      0.684    -0.31   0.753       -1.556       1.126
              8  |     -2.171      1.131    -1.92   0.055       -4.387       0.045
              9  |      0.284      0.329     0.86   0.388       -0.361       0.929
             10  |      0.013      0.362     0.04   0.971       -0.696       0.722
             11  |      0.458      0.250     1.83   0.067       -0.032       0.948
             12  |      0.066      0.235     0.28   0.779       -0.394       0.526
             13  |      0.827      0.523     1.58   0.114       -0.198       1.852
             14  |      0.426      0.446     0.96   0.339       -0.448       1.300
             15  |      1.096      0.690     1.59   0.112       -0.257       2.450
                 |
           educ4 |
              2  |     -0.354      0.380    -0.93   0.352       -1.099       0.392
              3  |     -0.083      0.362    -0.23   0.818       -0.793       0.626
              4  |      0.684      0.380     1.80   0.072       -0.061       1.428
                 |
          income |
              2  |      0.159      0.711     0.22   0.823       -1.235       1.552
              3  |     -0.049      0.707    -0.07   0.945       -1.435       1.338
              4  |     -0.731      0.633    -1.16   0.248       -1.972       0.509
              5  |     -0.471      0.627    -0.75   0.453       -1.701       0.759
              6  |     -0.282      0.606    -0.47   0.641       -1.471       0.906
              7  |     -0.127      0.606    -0.21   0.834       -1.314       1.060
              8  |     -0.300      0.607    -0.49   0.621       -1.489       0.889
              9  |     -0.565      0.592    -0.95   0.340       -1.725       0.595
             10  |      0.228      0.567     0.40   0.688       -0.883       1.338
             11  |     -0.687      0.577    -1.19   0.234       -1.819       0.444
             12  |     -0.065      0.647    -0.10   0.920       -1.332       1.203
             13  |      0.103      0.567     0.18   0.856       -1.008       1.214
             14  |     -0.213      0.575    -0.37   0.710       -1.340       0.913
             15  |     -0.377      0.598    -0.63   0.528       -1.550       0.795
             16  |     -0.409      0.628    -0.65   0.515       -1.641       0.823
             17  |      0.964      0.709     1.36   0.174       -0.426       2.353
             18  |     -0.178      0.634    -0.28   0.779       -1.421       1.064
                 |
         housing |
              2  |      0.307      0.220     1.40   0.162       -0.123       0.738
              3  |     -0.053      0.578    -0.09   0.927       -1.187       1.081
                 |
       home_type |
              2  |     -0.252      0.275    -0.92   0.359       -0.792       0.287
              3  |     -0.574      0.251    -2.29   0.022       -1.065      -0.082
              4  |      0.458      0.367     1.25   0.212       -0.261       1.177
              5  |     -1.464      0.978    -1.50   0.135       -3.381       0.454
                 |
      1.internet |     -0.179      0.272    -0.66   0.510       -0.713       0.354
                 |
    phoneservice |
              2  |     -0.663      0.374    -1.77   0.076       -1.396       0.070
              3  |     -0.452      0.402    -1.12   0.262       -1.241       0.337
              4  |     -0.560      0.377    -1.49   0.137       -1.298       0.178
              5  |     -1.682      0.851    -1.98   0.048       -3.351      -0.014
                 |
          device |
     Smartphone  |     -0.186      0.172    -1.08   0.279       -0.523       0.151
         Tablet  |      0.273      0.299     0.92   0.360       -0.312       0.859
                 |
          durint |
       1-3 mins  |     -1.558      0.753    -2.07   0.039       -3.033      -0.082
       4-6 mins  |     -1.458      0.763    -1.91   0.056       -2.953       0.038
       7-9 mins  |     -1.997      0.840    -2.38   0.017       -3.643      -0.351
10 or more mins  |     -2.175      0.819    -2.66   0.008       -3.780      -0.569
                 |
        partyid7 |     -0.132      0.044    -2.97   0.003       -0.219      -0.045
           _cons |      2.174      1.109     1.96   0.050        0.001       4.347
----------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,005
Model VCE    : Robust

Expression   : Pr(col), predict()
dy/dx w.r.t. : partyid7

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    partyid7 |     -0.021      0.007    -3.04   0.002       -0.035      -0.008
------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -1122.4494  
Iteration 1:   log pseudolikelihood = -987.14217  
Iteration 2:   log pseudolikelihood = -980.94683  
Iteration 3:   log pseudolikelihood = -980.92878  
Iteration 4:   log pseudolikelihood = -980.92877  

Logistic regression                             Number of obs     =      2,005
                                                Wald chi2(77)     =     179.88
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -980.92877               Pseudo R2         =     0.1261

----------------------------------------------------------------------------------
                 |               Robust
             col |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
         region4 |
              2  |      0.323      0.261     1.24   0.216       -0.189       0.834
              3  |      0.166      0.254     0.65   0.514       -0.332       0.663
              4  |      0.453      0.257     1.76   0.078       -0.051       0.958
                 |
         1.metro |      0.304      0.274     1.11   0.268       -0.234       0.841
        1.female |     -0.269      0.158    -1.70   0.089       -0.580       0.041
                 |
            age4 |
              2  |     -0.382      0.240    -1.59   0.112       -0.852       0.088
              3  |     -0.742      0.272    -2.73   0.006       -1.275      -0.210
              4  |     -1.043      0.318    -3.28   0.001       -1.667      -0.420
                 |
           race4 |
              2  |     -0.099      0.273    -0.36   0.716       -0.635       0.436
              3  |     -0.146      0.297    -0.49   0.623       -0.727       0.435
              4  |     -0.425      0.250    -1.70   0.089       -0.915       0.065
                 |
          hhsize |
              2  |     -0.319      0.268    -1.19   0.235       -0.844       0.207
              3  |     -0.485      0.288    -1.68   0.092       -1.050       0.079
              4  |     -0.162      0.335    -0.48   0.629       -0.818       0.494
              5  |     -0.362      0.353    -1.03   0.305       -1.053       0.329
              6  |      0.057      0.330     0.17   0.864       -0.590       0.703
                 |
         marital |
              2  |      0.319      0.445     0.72   0.473       -0.552       1.191
              3  |     -0.164      0.257    -0.64   0.523       -0.668       0.340
              4  |      1.339      0.584     2.29   0.022        0.194       2.484
              5  |      0.078      0.269     0.29   0.771       -0.449       0.605
              6  |      0.498      0.282     1.77   0.077       -0.054       1.050
                 |
           relig |
              2  |     -0.204      0.263    -0.78   0.438       -0.720       0.312
              3  |     -0.969      0.777    -1.25   0.212       -2.493       0.554
              4  |      1.980      0.938     2.11   0.035        0.143       3.818
              5  |      0.317      0.532     0.59   0.552       -0.727       1.360
              6  |     -0.240      1.074    -0.22   0.823       -2.346       1.865
              7  |     -0.203      0.688    -0.29   0.768       -1.552       1.146
              8  |     -2.262      1.133    -2.00   0.046       -4.483      -0.041
              9  |      0.307      0.329     0.93   0.350       -0.337       0.951
             10  |      0.035      0.361     0.10   0.922       -0.673       0.743
             11  |      0.460      0.251     1.83   0.067       -0.033       0.953
             12  |      0.064      0.234     0.28   0.783       -0.395       0.524
             13  |      0.778      0.540     1.44   0.150       -0.280       1.835
             14  |      0.451      0.449     1.00   0.315       -0.428       1.330
             15  |      1.188      0.681     1.74   0.081       -0.147       2.523
                 |
           educ4 |
              2  |     -0.381      0.378    -1.01   0.314       -1.122       0.360
              3  |     -0.112      0.360    -0.31   0.755       -0.817       0.593
              4  |      0.643      0.376     1.71   0.087       -0.094       1.379
                 |
          income |
              2  |      0.135      0.721     0.19   0.851       -1.278       1.549
              3  |     -0.098      0.710    -0.14   0.890       -1.490       1.294
              4  |     -0.757      0.635    -1.19   0.233       -2.001       0.488
              5  |     -0.514      0.639    -0.80   0.422       -1.766       0.739
              6  |     -0.351      0.614    -0.57   0.567       -1.554       0.852
              7  |     -0.217      0.603    -0.36   0.719       -1.398       0.965
              8  |     -0.374      0.616    -0.61   0.544       -1.581       0.833
              9  |     -0.618      0.594    -1.04   0.298       -1.784       0.547
             10  |      0.159      0.574     0.28   0.782       -0.966       1.285
             11  |     -0.705      0.583    -1.21   0.226       -1.848       0.437
             12  |     -0.135      0.649    -0.21   0.835       -1.407       1.136
             13  |      0.046      0.571     0.08   0.935       -1.073       1.166
             14  |     -0.256      0.582    -0.44   0.660       -1.395       0.884
             15  |     -0.437      0.607    -0.72   0.471       -1.626       0.751
             16  |     -0.425      0.633    -0.67   0.502       -1.665       0.815
             17  |      0.919      0.710     1.29   0.195       -0.472       2.311
             18  |     -0.231      0.640    -0.36   0.718       -1.486       1.024
                 |
         housing |
              2  |      0.310      0.218     1.42   0.156       -0.118       0.738
              3  |     -0.011      0.571    -0.02   0.985       -1.129       1.107
                 |
       home_type |
              2  |     -0.286      0.276    -1.04   0.298       -0.827       0.254
              3  |     -0.568      0.248    -2.29   0.022       -1.054      -0.082
              4  |      0.431      0.372     1.16   0.246       -0.297       1.159
              5  |     -1.303      1.003    -1.30   0.194       -3.269       0.664
                 |
      1.internet |     -0.164      0.277    -0.59   0.554       -0.706       0.378
                 |
    phoneservice |
              2  |     -0.648      0.368    -1.76   0.078       -1.369       0.073
              3  |     -0.464      0.397    -1.17   0.242       -1.242       0.314
              4  |     -0.549      0.369    -1.49   0.137       -1.273       0.174
              5  |     -1.671      0.827    -2.02   0.043       -3.292      -0.049
                 |
          device |
     Smartphone  |     -0.215      0.171    -1.26   0.207       -0.550       0.120
         Tablet  |      0.262      0.295     0.89   0.374       -0.316       0.841
                 |
          durint |
       1-3 mins  |     -1.548      0.747    -2.07   0.038       -3.012      -0.084
       4-6 mins  |     -1.475      0.758    -1.95   0.052       -2.961       0.011
       7-9 mins  |     -1.986      0.841    -2.36   0.018       -3.635      -0.338
10 or more mins  |     -2.209      0.812    -2.72   0.007       -3.801      -0.617
                 |
           treat |
             ic  |     -0.513      0.353    -1.45   0.146       -1.204       0.178
            irl  |     -0.740      0.355    -2.08   0.037       -1.436      -0.044
                 |
        partyid7 |     -0.188      0.064    -2.94   0.003       -0.314      -0.063
                 |
treat#c.partyid7 |
             ic  |      0.062      0.088     0.70   0.481       -0.111       0.236
            irl  |      0.136      0.091     1.49   0.136       -0.043       0.314
                 |
           _cons |      2.627      1.116     2.35   0.019        0.440       4.815
----------------------------------------------------------------------------------

Predictive margins                              Number of obs     =      2,005
Model VCE    : Robust

Expression   : Pr(col), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.276      0.021    13.03   0.000        0.235       0.318
         ic  |      0.229      0.020    11.37   0.000        0.190       0.269
        irl  |      0.235      0.021    11.15   0.000        0.194       0.277
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,005
Model VCE    : Robust

Expression   : Pr(col), predict()
dy/dx w.r.t. : 2.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.047      0.029    -1.61   0.107       -0.104       0.010
        irl  |     -0.041      0.030    -1.38   0.168       -0.099       0.017
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,005
Model VCE    : Robust

Expression   : Pr(col), predict()
dy/dx w.r.t. : 1.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.047      0.029     1.61   0.107       -0.010       0.104
        irl  |      0.006      0.030     0.21   0.830       -0.052       0.064
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,005
Model VCE    : Robust

Expression   : Pr(col), predict()
dy/dx w.r.t. : partyid7

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    partyid7 |     -0.020      0.007    -2.98   0.003       -0.034      -0.007
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,005
Model VCE    : Robust

Expression   : Pr(col), predict()
dy/dx w.r.t. : partyid7

1._at        : treat           =           1

2._at        : treat           =           2

3._at        : treat           =           3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
partyid7     |
         _at |
          1  |     -0.032      0.010    -3.11   0.002       -0.052      -0.012
          2  |     -0.019      0.010    -1.86   0.063       -0.040       0.001
          3  |     -0.008      0.011    -0.72   0.469       -0.031       0.014
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,005
Model VCE    : Robust

Expression   : Pr(col), predict()
dy/dx w.r.t. : 2.treat 3.treat

1._at        : partyid7        =           1

2._at        : partyid7        =           2

3._at        : partyid7        =           3

4._at        : partyid7        =           4

5._at        : partyid7        =           5

6._at        : partyid7        =           6

7._at        : partyid7        =           7

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1.treat      |  (base outcome)
-------------+----------------------------------------------------------------
2.treat      |
         _at |
          1  |     -0.085      0.052    -1.63   0.103       -0.188       0.017
          2  |     -0.070      0.039    -1.78   0.075       -0.147       0.007
          3  |     -0.056      0.031    -1.77   0.076       -0.117       0.006
          4  |     -0.042      0.030    -1.40   0.162       -0.102       0.017
          5  |     -0.030      0.034    -0.88   0.380       -0.098       0.037
          6  |     -0.019      0.041    -0.48   0.633       -0.099       0.060
          7  |     -0.010      0.047    -0.21   0.833       -0.102       0.082
-------------+----------------------------------------------------------------
3.treat      |
         _at |
          1  |     -0.112      0.051    -2.21   0.027       -0.211      -0.012
          2  |     -0.083      0.038    -2.18   0.029       -0.158      -0.008
          3  |     -0.057      0.031    -1.83   0.068       -0.118       0.004
          4  |     -0.032      0.031    -1.04   0.300       -0.093       0.029
          5  |     -0.009      0.036    -0.26   0.796       -0.081       0.062
          6  |      0.011      0.044     0.25   0.803       -0.076       0.098
          7  |      0.029      0.053     0.56   0.578       -0.074       0.132
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Iteration 0:   log pseudolikelihood = -1391.4433  
Iteration 1:   log pseudolikelihood = -1192.8933  
Iteration 2:   log pseudolikelihood = -1191.6246  
Iteration 3:   log pseudolikelihood = -1191.6209  
Iteration 4:   log pseudolikelihood = -1191.6209  

Logistic regression                             Number of obs     =      2,009
                                                Wald chi2(74)     =     205.71
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -1191.6209               Pseudo R2         =     0.1436

----------------------------------------------------------------------------------
                 |               Robust
             lib |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
         region4 |
              2  |     -0.022      0.211    -0.10   0.918       -0.435       0.392
              3  |     -0.422      0.202    -2.09   0.037       -0.818      -0.026
              4  |      0.136      0.224     0.61   0.544       -0.303       0.574
                 |
         1.metro |      0.245      0.224     1.10   0.273       -0.193       0.684
        1.female |      0.010      0.139     0.07   0.945       -0.264       0.283
                 |
            age4 |
              2  |     -0.529      0.241    -2.20   0.028       -1.001      -0.057
              3  |     -0.974      0.257    -3.80   0.000       -1.477      -0.471
              4  |     -0.801      0.298    -2.69   0.007       -1.385      -0.217
                 |
           race4 |
              2  |      0.009      0.244     0.04   0.970       -0.469       0.487
              3  |      0.095      0.269     0.35   0.725       -0.432       0.621
              4  |     -0.393      0.205    -1.91   0.056       -0.796       0.010
                 |
          hhsize |
              2  |     -0.491      0.225    -2.18   0.029       -0.933      -0.049
              3  |     -0.845      0.256    -3.30   0.001       -1.347      -0.343
              4  |     -0.708      0.280    -2.53   0.011       -1.256      -0.159
              5  |     -0.163      0.304    -0.54   0.593       -0.759       0.433
              6  |     -0.616      0.295    -2.09   0.037       -1.194      -0.038
                 |
         marital |
              2  |     -0.297      0.321    -0.92   0.355       -0.925       0.332
              3  |     -0.133      0.227    -0.59   0.557       -0.578       0.311
              4  |     -0.411      0.610    -0.67   0.500       -1.606       0.784
              5  |     -0.125      0.232    -0.54   0.588       -0.579       0.329
              6  |     -0.063      0.267    -0.23   0.815       -0.586       0.461
                 |
           relig |
              2  |      0.205      0.203     1.01   0.313       -0.193       0.603
              3  |     -0.336      0.660    -0.51   0.611       -1.629       0.957
              4  |      0.655      0.726     0.90   0.367       -0.768       2.078
              5  |      0.458      0.483     0.95   0.343       -0.489       1.404
              6  |      0.221      0.871     0.25   0.799       -1.485       1.927
              7  |     -0.719      0.601    -1.20   0.231       -1.897       0.458
              8  |     -0.856      0.805    -1.06   0.288       -2.433       0.721
              9  |      1.384      0.406     3.41   0.001        0.589       2.179
             10  |      0.689      0.373     1.85   0.065       -0.042       1.420
             11  |      0.966      0.242     3.99   0.000        0.492       1.441
             12  |     -0.086      0.190    -0.45   0.652       -0.458       0.286
             13  |      0.403      0.604     0.67   0.504       -0.780       1.587
             14  |      0.405      0.476     0.85   0.396       -0.529       1.338
             15  |     -0.769      0.558    -1.38   0.168       -1.862       0.324
                 |
           educ4 |
              2  |     -0.289      0.289    -1.00   0.318       -0.855       0.278
              3  |      0.236      0.274     0.86   0.389       -0.300       0.772
              4  |      0.934      0.292     3.20   0.001        0.361       1.507
                 |
          income |
              2  |     -0.968      0.638    -1.52   0.129       -2.218       0.282
              3  |     -0.954      0.627    -1.52   0.128       -2.183       0.274
              4  |     -0.601      0.600    -1.00   0.317       -1.777       0.575
              5  |     -0.450      0.562    -0.80   0.422       -1.551       0.650
              6  |     -0.835      0.571    -1.46   0.143       -1.954       0.284
              7  |     -0.372      0.579    -0.64   0.521       -1.507       0.764
              8  |     -0.803      0.602    -1.33   0.182       -1.983       0.377
              9  |     -1.188      0.552    -2.15   0.031       -2.269      -0.106
             10  |     -0.587      0.547    -1.07   0.283       -1.660       0.486
             11  |     -0.572      0.566    -1.01   0.312       -1.681       0.538
             12  |     -0.716      0.598    -1.20   0.231       -1.887       0.456
             13  |     -0.435      0.561    -0.78   0.438       -1.535       0.664
             14  |     -0.753      0.573    -1.31   0.189       -1.877       0.370
             15  |     -0.833      0.581    -1.43   0.152       -1.971       0.306
             16  |     -0.708      0.628    -1.13   0.259       -1.939       0.522
             17  |     -0.744      0.712    -1.04   0.297       -2.139       0.652
             18  |     -0.045      0.639    -0.07   0.944       -1.298       1.208
                 |
         housing |
              2  |     -0.060      0.197    -0.31   0.759       -0.446       0.325
              3  |      0.702      0.460     1.53   0.127       -0.199       1.603
                 |
       home_type |
              2  |     -0.286      0.239    -1.20   0.231       -0.753       0.182
              3  |      0.069      0.215     0.32   0.750       -0.353       0.491
              4  |      0.167      0.344     0.49   0.626       -0.506       0.841
              5  |      0.723      1.176     0.62   0.539       -1.582       3.029
                 |
      1.internet |      0.145      0.239     0.61   0.544       -0.324       0.614
                 |
    phoneservice |
              2  |      0.379      0.330     1.15   0.250       -0.267       1.025
              3  |      0.191      0.352     0.54   0.587       -0.499       0.881
              4  |      0.494      0.325     1.52   0.129       -0.143       1.132
              5  |     -0.115      0.888    -0.13   0.897       -1.855       1.625
                 |
          device |
     Smartphone  |     -0.564      0.153    -3.69   0.000       -0.863      -0.264
         Tablet  |      0.164      0.275     0.60   0.552       -0.375       0.703
                 |
          durint |
       1-3 mins  |      0.955      0.670     1.42   0.154       -0.359       2.269
       4-6 mins  |      1.066      0.683     1.56   0.119       -0.273       2.405
       7-9 mins  |      0.704      0.734     0.96   0.337       -0.735       2.144
10 or more mins  |      0.861      0.710     1.21   0.225       -0.531       2.254
                 |
           treat |
             ic  |     -0.185      0.163    -1.14   0.255       -0.504       0.134
            irl  |      0.036      0.164     0.22   0.827       -0.286       0.358
                 |
           _cons |      0.318      1.025     0.31   0.756       -1.691       2.327
----------------------------------------------------------------------------------

Predictive margins                              Number of obs     =      2,009
Model VCE    : Robust

Expression   : Pr(lib), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.536      0.023    22.88   0.000        0.490       0.582
         ic  |      0.498      0.023    21.45   0.000        0.452       0.543
        irl  |      0.543      0.023    23.12   0.000        0.497       0.589
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,009
Model VCE    : Robust

Expression   : Pr(lib), predict()
dy/dx w.r.t. : 2.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.038      0.033    -1.14   0.254       -0.103       0.027
        irl  |      0.007      0.033     0.22   0.827       -0.058       0.073
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,009
Model VCE    : Robust

Expression   : Pr(lib), predict()
dy/dx w.r.t. : 1.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.038      0.033     1.14   0.254       -0.027       0.103
        irl  |      0.045      0.033     1.36   0.173       -0.020       0.110
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Iteration 0:   log pseudolikelihood = -1385.7829  
Iteration 1:   log pseudolikelihood = -1184.5537  
Iteration 2:   log pseudolikelihood = -1183.1637  
Iteration 3:   log pseudolikelihood = -1183.1593  
Iteration 4:   log pseudolikelihood = -1183.1593  

Logistic regression                             Number of obs     =      2,002
                                                Wald chi2(73)     =     215.26
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -1183.1593               Pseudo R2         =     0.1462

----------------------------------------------------------------------------------
                 |               Robust
             lib |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
         region4 |
              2  |     -0.028      0.214    -0.13   0.895       -0.447       0.390
              3  |     -0.395      0.205    -1.92   0.054       -0.798       0.007
              4  |      0.146      0.226     0.65   0.519       -0.297       0.589
                 |
         1.metro |      0.261      0.223     1.17   0.243       -0.176       0.698
        1.female |     -0.028      0.140    -0.20   0.840       -0.303       0.246
                 |
            age4 |
              2  |     -0.540      0.244    -2.21   0.027       -1.019      -0.061
              3  |     -0.975      0.257    -3.79   0.000       -1.479      -0.471
              4  |     -0.841      0.300    -2.80   0.005       -1.429      -0.253
                 |
           race4 |
              2  |     -0.201      0.255    -0.79   0.430       -0.702       0.299
              3  |      0.047      0.265     0.18   0.858       -0.472       0.566
              4  |     -0.471      0.208    -2.26   0.024       -0.878      -0.063
                 |
          hhsize |
              2  |     -0.519      0.229    -2.27   0.023       -0.967      -0.070
              3  |     -0.866      0.259    -3.35   0.001       -1.374      -0.359
              4  |     -0.699      0.286    -2.45   0.014       -1.259      -0.139
              5  |     -0.260      0.305    -0.85   0.394       -0.858       0.338
              6  |     -0.654      0.299    -2.19   0.029       -1.240      -0.068
                 |
         marital |
              2  |     -0.377      0.310    -1.22   0.224       -0.984       0.231
              3  |     -0.168      0.225    -0.74   0.457       -0.610       0.274
              4  |     -0.433      0.637    -0.68   0.497       -1.682       0.816
              5  |     -0.206      0.234    -0.88   0.379       -0.666       0.253
              6  |     -0.111      0.265    -0.42   0.675       -0.631       0.408
                 |
           relig |
              2  |      0.159      0.205     0.77   0.438       -0.243       0.561
              3  |     -0.377      0.628    -0.60   0.548       -1.607       0.854
              4  |      0.601      0.668     0.90   0.368       -0.708       1.910
              5  |      0.345      0.478     0.72   0.471       -0.592       1.281
              6  |      0.110      0.850     0.13   0.897       -1.557       1.776
              7  |     -0.878      0.564    -1.56   0.120       -1.983       0.228
              8  |     -0.989      0.820    -1.21   0.228       -2.596       0.619
              9  |      1.144      0.421     2.71   0.007        0.318       1.970
             10  |      0.515      0.378     1.36   0.173       -0.225       1.256
             11  |      0.857      0.247     3.47   0.001        0.373       1.341
             12  |     -0.104      0.191    -0.55   0.585       -0.478       0.269
             13  |      0.167      0.593     0.28   0.779       -0.996       1.330
             14  |      0.247      0.474     0.52   0.602       -0.681       1.175
             15  |     -0.637      0.719    -0.89   0.375       -2.046       0.771
                 |
           educ4 |
              2  |     -0.235      0.288    -0.81   0.415       -0.800       0.330
              3  |      0.255      0.272     0.94   0.349       -0.278       0.788
              4  |      0.927      0.291     3.18   0.001        0.356       1.498
                 |
          income |
              2  |     -0.897      0.663    -1.35   0.176       -2.195       0.402
              3  |     -0.930      0.650    -1.43   0.153       -2.203       0.344
              4  |     -0.595      0.620    -0.96   0.337       -1.810       0.620
              5  |     -0.479      0.583    -0.82   0.411       -1.622       0.663
              6  |     -0.824      0.596    -1.38   0.167       -1.993       0.345
              7  |     -0.390      0.604    -0.65   0.519       -1.575       0.795
              8  |     -0.757      0.630    -1.20   0.230       -1.993       0.478
              9  |     -1.219      0.580    -2.10   0.036       -2.356      -0.082
             10  |     -0.576      0.575    -1.00   0.316       -1.703       0.550
             11  |     -0.583      0.591    -0.99   0.324       -1.742       0.575
             12  |     -0.721      0.624    -1.16   0.248       -1.944       0.501
             13  |     -0.382      0.585    -0.65   0.514       -1.530       0.765
             14  |     -0.699      0.595    -1.17   0.241       -1.865       0.468
             15  |     -0.770      0.607    -1.27   0.204       -1.959       0.418
             16  |     -0.633      0.647    -0.98   0.328       -1.901       0.635
             17  |     -0.751      0.717    -1.05   0.294       -2.156       0.653
             18  |     -0.037      0.669    -0.06   0.956       -1.348       1.274
                 |
         housing |
              2  |     -0.085      0.199    -0.43   0.669       -0.474       0.304
              3  |      0.768      0.466     1.65   0.099       -0.145       1.680
                 |
       home_type |
              2  |     -0.257      0.237    -1.08   0.279       -0.722       0.208
              3  |      0.061      0.218     0.28   0.780       -0.367       0.489
              4  |      0.172      0.345     0.50   0.619       -0.504       0.847
              5  |      0.666      1.153     0.58   0.564       -1.594       2.925
                 |
      1.internet |      0.136      0.240     0.57   0.571       -0.335       0.608
                 |
    phoneservice |
              2  |      0.369      0.342     1.08   0.281       -0.302       1.040
              3  |      0.176      0.366     0.48   0.632       -0.542       0.894
              4  |      0.494      0.338     1.46   0.144       -0.169       1.157
              5  |     -0.102      0.877    -0.12   0.908       -1.820       1.617
                 |
          device |
     Smartphone  |     -0.571      0.155    -3.70   0.000       -0.874      -0.269
         Tablet  |      0.178      0.279     0.64   0.525       -0.369       0.724
                 |
          durint |
       1-3 mins  |      0.758      0.701     1.08   0.280       -0.616       2.132
       4-6 mins  |      0.837      0.713     1.18   0.240       -0.559       2.234
       7-9 mins  |      0.460      0.764     0.60   0.547       -1.037       1.957
10 or more mins  |      0.696      0.738     0.94   0.346       -0.751       2.143
                 |
        partyid7 |     -0.113      0.037    -3.06   0.002       -0.185      -0.040
           _cons |      1.056      1.073     0.98   0.325       -1.047       3.159
----------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,002
Model VCE    : Robust

Expression   : Pr(lib), predict()
dy/dx w.r.t. : partyid7

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    partyid7 |     -0.023      0.007    -3.09   0.002       -0.037      -0.008
------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -1385.7829  
Iteration 1:   log pseudolikelihood = -1180.4897  
Iteration 2:   log pseudolikelihood =  -1178.864  
Iteration 3:   log pseudolikelihood = -1178.8585  
Iteration 4:   log pseudolikelihood = -1178.8585  

Logistic regression                             Number of obs     =      2,002
                                                Wald chi2(77)     =     221.20
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -1178.8585               Pseudo R2         =     0.1493

----------------------------------------------------------------------------------
                 |               Robust
             lib |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
         region4 |
              2  |     -0.009      0.212    -0.04   0.965       -0.425       0.407
              3  |     -0.400      0.205    -1.95   0.051       -0.801       0.002
              4  |      0.135      0.225     0.60   0.547       -0.305       0.576
                 |
         1.metro |      0.237      0.223     1.06   0.287       -0.200       0.673
        1.female |     -0.019      0.140    -0.14   0.891       -0.293       0.255
                 |
            age4 |
              2  |     -0.537      0.243    -2.21   0.027       -1.013      -0.061
              3  |     -0.966      0.257    -3.76   0.000       -1.470      -0.463
              4  |     -0.823      0.297    -2.77   0.006       -1.406      -0.241
                 |
           race4 |
              2  |     -0.189      0.256    -0.74   0.461       -0.690       0.313
              3  |      0.049      0.269     0.18   0.855       -0.479       0.577
              4  |     -0.453      0.206    -2.20   0.028       -0.858      -0.049
                 |
          hhsize |
              2  |     -0.529      0.228    -2.33   0.020       -0.976      -0.083
              3  |     -0.876      0.259    -3.39   0.001       -1.383      -0.370
              4  |     -0.724      0.284    -2.55   0.011       -1.280      -0.169
              5  |     -0.275      0.304    -0.91   0.365       -0.870       0.320
              6  |     -0.658      0.298    -2.21   0.027       -1.241      -0.075
                 |
         marital |
              2  |     -0.347      0.317    -1.10   0.273       -0.967       0.274
              3  |     -0.166      0.227    -0.73   0.464       -0.611       0.279
              4  |     -0.393      0.634    -0.62   0.536       -1.636       0.851
              5  |     -0.207      0.232    -0.89   0.372       -0.662       0.248
              6  |     -0.097      0.265    -0.37   0.713       -0.618       0.423
                 |
           relig |
              2  |      0.152      0.205     0.74   0.460       -0.250       0.553
              3  |     -0.405      0.624    -0.65   0.516       -1.629       0.818
              4  |      0.726      0.667     1.09   0.276       -0.581       2.032
              5  |      0.401      0.484     0.83   0.407       -0.546       1.349
              6  |      0.080      0.898     0.09   0.929       -1.680       1.839
              7  |     -0.788      0.595    -1.32   0.185       -1.953       0.378
              8  |     -1.026      0.816    -1.26   0.209       -2.625       0.573
              9  |      1.118      0.410     2.73   0.006        0.314       1.921
             10  |      0.522      0.378     1.38   0.168       -0.220       1.263
             11  |      0.847      0.246     3.44   0.001        0.364       1.330
             12  |     -0.094      0.190    -0.50   0.620       -0.466       0.278
             13  |      0.218      0.601     0.36   0.717       -0.959       1.395
             14  |      0.267      0.479     0.56   0.577       -0.671       1.206
             15  |     -0.631      0.718    -0.88   0.379       -2.039       0.777
                 |
           educ4 |
              2  |     -0.241      0.285    -0.84   0.398       -0.799       0.318
              3  |      0.263      0.270     0.98   0.329       -0.265       0.791
              4  |      0.939      0.289     3.25   0.001        0.374       1.505
                 |
          income |
              2  |     -0.897      0.637    -1.41   0.159       -2.146       0.352
              3  |     -0.887      0.617    -1.44   0.151       -2.097       0.323
              4  |     -0.555      0.590    -0.94   0.346       -1.711       0.600
              5  |     -0.510      0.552    -0.92   0.355       -1.591       0.571
              6  |     -0.803      0.565    -1.42   0.155       -1.910       0.304
              7  |     -0.401      0.575    -0.70   0.486       -1.528       0.727
              8  |     -0.740      0.602    -1.23   0.219       -1.921       0.440
              9  |     -1.173      0.548    -2.14   0.032       -2.247      -0.099
             10  |     -0.550      0.545    -1.01   0.313       -1.618       0.518
             11  |     -0.568      0.562    -1.01   0.312       -1.671       0.534
             12  |     -0.685      0.594    -1.15   0.249       -1.849       0.479
             13  |     -0.366      0.557    -0.66   0.511       -1.456       0.725
             14  |     -0.684      0.569    -1.20   0.229       -1.800       0.431
             15  |     -0.777      0.583    -1.33   0.183       -1.920       0.366
             16  |     -0.618      0.626    -0.99   0.324       -1.844       0.609
             17  |     -0.751      0.694    -1.08   0.279       -2.111       0.610
             18  |     -0.001      0.647    -0.00   0.999       -1.269       1.268
                 |
         housing |
              2  |     -0.087      0.197    -0.44   0.660       -0.474       0.300
              3  |      0.767      0.462     1.66   0.097       -0.138       1.672
                 |
       home_type |
              2  |     -0.234      0.237    -0.99   0.322       -0.698       0.229
              3  |      0.074      0.217     0.34   0.734       -0.352       0.499
              4  |      0.187      0.344     0.54   0.587       -0.488       0.862
              5  |      0.523      1.169     0.45   0.655       -1.769       2.814
                 |
      1.internet |      0.125      0.237     0.53   0.599       -0.340       0.589
                 |
    phoneservice |
              2  |      0.395      0.339     1.16   0.245       -0.270       1.060
              3  |      0.196      0.361     0.54   0.588       -0.512       0.904
              4  |      0.509      0.334     1.52   0.127       -0.146       1.165
              5  |      0.000      0.891     0.00   1.000       -1.746       1.746
                 |
          device |
     Smartphone  |     -0.557      0.154    -3.61   0.000       -0.860      -0.254
         Tablet  |      0.163      0.275     0.59   0.553       -0.376       0.703
                 |
          durint |
       1-3 mins  |      0.726      0.677     1.07   0.284       -0.601       2.053
       4-6 mins  |      0.824      0.688     1.20   0.231       -0.525       2.174
       7-9 mins  |      0.378      0.741     0.51   0.610       -1.075       1.831
10 or more mins  |      0.640      0.717     0.89   0.372       -0.765       2.044
                 |
           treat |
             ic  |     -0.327      0.362    -0.90   0.366       -1.036       0.382
            irl  |      0.489      0.364     1.34   0.179       -0.225       1.203
                 |
        partyid7 |     -0.089      0.056    -1.58   0.113       -0.199       0.021
                 |
treat#c.partyid7 |
             ic  |      0.038      0.082     0.46   0.648       -0.124       0.199
            irl  |     -0.109      0.081    -1.35   0.178       -0.268       0.050
                 |
           _cons |      1.004      1.055     0.95   0.342       -1.065       3.072
----------------------------------------------------------------------------------

Predictive margins                              Number of obs     =      2,002
Model VCE    : Robust

Expression   : Pr(lib), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.535      0.023    22.89   0.000        0.489       0.581
         ic  |      0.498      0.023    21.40   0.000        0.453       0.544
        irl  |      0.547      0.023    23.36   0.000        0.501       0.593
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,002
Model VCE    : Robust

Expression   : Pr(lib), predict()
dy/dx w.r.t. : 2.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.037      0.033    -1.11   0.266       -0.102       0.028
        irl  |      0.012      0.033     0.35   0.727       -0.054       0.077
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,002
Model VCE    : Robust

Expression   : Pr(lib), predict()
dy/dx w.r.t. : 1.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.037      0.033     1.11   0.266       -0.028       0.102
        irl  |      0.048      0.033     1.47   0.142       -0.016       0.113
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,002
Model VCE    : Robust

Expression   : Pr(lib), predict()
dy/dx w.r.t. : partyid7

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    partyid7 |     -0.022      0.007    -2.95   0.003       -0.036      -0.007
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,002
Model VCE    : Robust

Expression   : Pr(lib), predict()
dy/dx w.r.t. : partyid7

1._at        : treat           =           1

2._at        : treat           =           2

3._at        : treat           =           3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
partyid7     |
         _at |
          1  |     -0.018      0.011    -1.60   0.109       -0.040       0.004
          2  |     -0.011      0.013    -0.81   0.418       -0.036       0.015
          3  |     -0.039      0.012    -3.31   0.001       -0.062      -0.016
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,002
Model VCE    : Robust

Expression   : Pr(lib), predict()
dy/dx w.r.t. : 2.treat 3.treat

1._at        : partyid7        =           1

2._at        : partyid7        =           2

3._at        : partyid7        =           3

4._at        : partyid7        =           4

5._at        : partyid7        =           5

6._at        : partyid7        =           6

7._at        : partyid7        =           7

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1.treat      |  (base outcome)
-------------+----------------------------------------------------------------
2.treat      |
         _at |
          1  |     -0.059      0.059    -1.00   0.318       -0.175       0.057
          2  |     -0.052      0.046    -1.11   0.266       -0.143       0.039
          3  |     -0.044      0.037    -1.20   0.230       -0.116       0.028
          4  |     -0.037      0.033    -1.09   0.274       -0.102       0.029
          5  |     -0.029      0.038    -0.76   0.448       -0.103       0.046
          6  |     -0.021      0.048    -0.43   0.664       -0.116       0.074
          7  |     -0.013      0.062    -0.22   0.830       -0.134       0.107
-------------+----------------------------------------------------------------
3.treat      |
         _at |
          1  |      0.074      0.057     1.30   0.195       -0.038       0.187
          2  |      0.054      0.046     1.17   0.242       -0.037       0.145
          3  |      0.033      0.038     0.88   0.381       -0.041       0.107
          4  |      0.011      0.034     0.32   0.749       -0.056       0.078
          5  |     -0.011      0.038    -0.30   0.763       -0.086       0.063
          6  |     -0.034      0.048    -0.71   0.477       -0.127       0.059
          7  |     -0.056      0.060    -0.93   0.351       -0.173       0.061
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

. 
. outreg2 [*] ///
>   using docs/logit-margins-with-covariates.xls, ///
>   noaster stats(coef se ci pval) bdec(1) sdec(1) cdec(3)  ///
>   stnum(replace coef=coef*100, replace se=se*100) ///
>   paren(se) bracket(ci) ///
>   excel replace
docs/logit-margins-with-covariates.xls
dir : seeout

. 
. 
. estimates clear

. 
. log close
      name:  <unnamed>
       log:  /Users/stephenmorgan/GitHub/tess-civil-liberties/log/analyze-experimental-results-with-covariates.log
  log type:  text
 closed on:  16 Mar 2019, 14:47:36
-------------------------------------------------------------------------------------------------------------------
