-------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/stephenmorgan/GitHub/tess-civil-liberties/log/analyze-experimental-results-without-covariates.l
> og
  log type:  text
 opened on:  16 Mar 2019, 14:45:46

. 
. use data/tess-civ-lib.dta

. 
. ********************************************************************************
. *** Set up for analysis
. ********************************************************************************
. 
. *** Set macros
. 
. local domain spk col lib 

. 
. *** Create additional regressors
. 
. recode partyid7 1/2 = 1 2/5 = 2 6/7 = 3, gen(partyid3)
(1703 differences between partyid7 and partyid3)

. recode partyid7 1/3 = 1 4 = 2 5/7 = 3, gen(partyid3l)
(1703 differences between partyid7 and partyid3l)

. order partyid7 partyid3 partyid3l, after(treat)

. tab partyid7 partyid3, miss

DATA-ONLY: |
  Computed |
   7-level |
 political |
     party |   RECODE of partyid7 (DATA-ONLY: Computed
identifica |   7-level political party identification)
      tion |         1          2          3          . |     Total
-----------+--------------------------------------------+----------
         1 |       309          0          0          0 |       309 
         2 |       424          0          0          0 |       424 
         3 |         0        220          0          0 |       220 
         4 |         0        338          0          0 |       338 
         5 |         0        191          0          0 |       191 
         6 |         0          0        347          0 |       347 
         7 |         0          0        183          0 |       183 
         . |         0          0          0          7 |         7 
-----------+--------------------------------------------+----------
     Total |       733        749        530          7 |     2,019 

. tab partyid7 partyid3l, miss

DATA-ONLY: |
  Computed |
   7-level |
 political |
     party |   RECODE of partyid7 (DATA-ONLY: Computed
identifica |   7-level political party identification)
      tion |         1          2          3          . |     Total
-----------+--------------------------------------------+----------
         1 |       309          0          0          0 |       309 
         2 |       424          0          0          0 |       424 
         3 |       220          0          0          0 |       220 
         4 |         0        338          0          0 |       338 
         5 |         0          0        191          0 |       191 
         6 |         0          0        347          0 |       347 
         7 |         0          0        183          0 |       183 
         . |         0          0          0          7 |         7 
-----------+--------------------------------------------+----------
     Total |       953        338        721          7 |     2,019 

. 
. ********************************************************************************
. *** Summary of outcomes
. ********************************************************************************
. 
. summ `domain' [aweight = weight]

    Variable |     Obs      Weight        Mean   Std. Dev.       Min        Max
-------------+-----------------------------------------------------------------
         spk |   2,016  2015.95849    .4466732   .4972715          0          1
         col |   2,012   2011.2303    .2497988   .4330041          0          1
         lib |   2,009  2011.16718    .5253773   .4994799          0          1

. corr `domain' [aweight = weight]
(sum of wgt is 2,006.2353708017)
(obs=2,005)

             |      spk      col      lib
-------------+---------------------------
         spk |   1.0000
         col |   0.4948   1.0000
         lib |   0.4078   0.2767   1.0000


. bys treat: corr `domain' [aweight = weight]

-------------------------------------------------------------------------------------------------------------------
-> treat = mc
(sum of wgt is 721.2025177945)
(obs=700)

             |      spk      col      lib
-------------+---------------------------
         spk |   1.0000
         col |   0.4333   1.0000
         lib |   0.3924   0.2744   1.0000


-------------------------------------------------------------------------------------------------------------------
-> treat = ic
(sum of wgt is 665.2614538197)
(obs=656)

             |      spk      col      lib
-------------+---------------------------
         spk |   1.0000
         col |   0.5871   1.0000
         lib |   0.4005   0.2773   1.0000


-------------------------------------------------------------------------------------------------------------------
-> treat = irl
(sum of wgt is 619.7713991875)
(obs=649)

             |      spk      col      lib
-------------+---------------------------
         spk |   1.0000
         col |   0.4702   1.0000
         lib |   0.4327   0.2826   1.0000



. bys partyid3: corr `domain' [aweight = weight]

-------------------------------------------------------------------------------------------------------------------
-> partyid3 = 1
(sum of wgt is 673.5352909395)
(obs=730)

             |      spk      col      lib
-------------+---------------------------
         spk |   1.0000
         col |   0.4307   1.0000
         lib |   0.4276   0.2980   1.0000


-------------------------------------------------------------------------------------------------------------------
-> partyid3 = 2
(sum of wgt is 773.0350914344)
(obs=739)

             |      spk      col      lib
-------------+---------------------------
         spk |   1.0000
         col |   0.5275   1.0000
         lib |   0.3634   0.2834   1.0000


-------------------------------------------------------------------------------------------------------------------
-> partyid3 = 3
(sum of wgt is 551.8284831877)
(obs=529)

             |      spk      col      lib
-------------+---------------------------
         spk |   1.0000
         col |   0.5297   1.0000
         lib |   0.4484   0.2201   1.0000


-------------------------------------------------------------------------------------------------------------------
-> partyid3 = .
(sum of wgt is 7.8365052401)
(obs=7)

             |      spk      col      lib
-------------+---------------------------
         spk |   1.0000
         col |   0.6022   1.0000
         lib |  -0.0632   0.3809   1.0000



. 
. ********************************************************************************
. *** Basic treatment effect analysis
. ********************************************************************************
. 
. *** OLS regression models, with no additional adjustment
. 
. foreach dom in `domain' {
  2. 
. regress `dom' b1.treat [pweight=weight]
  3. estimates store `dom'_r1
  4. 
. regress `dom' c.partyid7 [pweight=weight]
  5. estimates store `dom'_r2
  6. 
. regress `dom' b1.treat##c.partyid7 [pweight=weight]
  7. estimates store `dom'_r3
  8. 
. }
(sum of wgt is 2,015.9584942246)

Linear regression                               Number of obs     =      2,016
                                                F(2, 2013)        =       2.17
                                                Prob > F          =     0.1143
                                                R-squared         =     0.0042
                                                Root MSE          =     .49647

------------------------------------------------------------------------------
             |               Robust
         spk |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.078      0.037    -2.08   0.038       -0.151      -0.004
        irl  |     -0.034      0.039    -0.87   0.383       -0.111       0.043
             |
       _cons |      0.483      0.026    18.61   0.000        0.432       0.534
------------------------------------------------------------------------------
(sum of wgt is 2,008.1219889845)

Linear regression                               Number of obs     =      2,009
                                                F(1, 2007)        =       4.53
                                                Prob > F          =     0.0335
                                                R-squared         =     0.0044
                                                Root MSE          =      .4963

------------------------------------------------------------------------------
             |               Robust
         spk |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    partyid7 |     -0.017      0.008    -2.13   0.033       -0.033      -0.001
       _cons |      0.512      0.036    14.33   0.000        0.442       0.582
------------------------------------------------------------------------------
(sum of wgt is 2,008.1219889845)

Linear regression                               Number of obs     =      2,009
                                                F(5, 2003)        =       2.07
                                                Prob > F          =     0.0660
                                                R-squared         =     0.0090
                                                Root MSE          =     .49565

----------------------------------------------------------------------------------
                 |               Robust
             spk |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           treat |
             ic  |     -0.011      0.082    -0.14   0.891       -0.171       0.149
            irl  |      0.006      0.089     0.07   0.943       -0.168       0.181
                 |
        partyid7 |     -0.009      0.012    -0.71   0.479       -0.033       0.016
                 |
treat#c.partyid7 |
             ic  |     -0.016      0.018    -0.89   0.373       -0.052       0.020
            irl  |     -0.010      0.020    -0.50   0.619       -0.049       0.029
                 |
           _cons |      0.515      0.054     9.61   0.000        0.410       0.620
----------------------------------------------------------------------------------
(sum of wgt is 2,011.2303007225)

Linear regression                               Number of obs     =      2,012
                                                F(2, 2009)        =       1.73
                                                Prob > F          =     0.1784
                                                R-squared         =     0.0035
                                                Root MSE          =     .43245

------------------------------------------------------------------------------
             |               Robust
         col |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.054      0.033    -1.63   0.104       -0.120       0.011
        irl  |     -0.053      0.033    -1.62   0.106       -0.117       0.011
             |
       _cons |      0.284      0.024    11.83   0.000        0.237       0.331
------------------------------------------------------------------------------
(sum of wgt is 2,003.3937954824)

Linear regression                               Number of obs     =      2,005
                                                F(1, 2003)        =      13.89
                                                Prob > F          =     0.0002
                                                R-squared         =     0.0120
                                                Root MSE          =     .42955

------------------------------------------------------------------------------
             |               Robust
         col |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    partyid7 |     -0.024      0.007    -3.73   0.000       -0.037      -0.012
       _cons |      0.342      0.031    11.16   0.000        0.282       0.402
------------------------------------------------------------------------------
(sum of wgt is 2,003.3937954824)

Linear regression                               Number of obs     =      2,005
                                                F(5, 1999)        =       3.96
                                                Prob > F          =     0.0014
                                                R-squared         =     0.0179
                                                Root MSE          =      .4287

----------------------------------------------------------------------------------
                 |               Robust
             col |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           treat |
             ic  |     -0.115      0.073    -1.57   0.117       -0.258       0.029
            irl  |     -0.155      0.072    -2.15   0.031       -0.296      -0.014
                 |
        partyid7 |     -0.038      0.011    -3.53   0.000       -0.059      -0.017
                 |
treat#c.partyid7 |
             ic  |      0.017      0.015     1.10   0.274       -0.013       0.047
            irl  |      0.028      0.016     1.75   0.080       -0.003       0.059
                 |
           _cons |      0.426      0.051     8.39   0.000        0.327       0.526
----------------------------------------------------------------------------------
(sum of wgt is 2,011.1671752376)

Linear regression                               Number of obs     =      2,009
                                                F(2, 2006)        =       2.00
                                                Prob > F          =     0.1352
                                                R-squared         =     0.0041
                                                Root MSE          =     .49869

------------------------------------------------------------------------------
             |               Robust
         lib |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.038      0.038    -1.01   0.315       -0.112       0.036
        irl  |      0.042      0.039     1.08   0.280       -0.035       0.119
             |
       _cons |      0.525      0.026    20.14   0.000        0.474       0.576
------------------------------------------------------------------------------
(sum of wgt is 2,003.3306699975)

Linear regression                               Number of obs     =      2,002
                                                F(1, 2000)        =      19.51
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0182
                                                Root MSE          =     .49497

------------------------------------------------------------------------------
             |               Robust
         lib |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    partyid7 |     -0.035      0.008    -4.42   0.000       -0.050      -0.019
       _cons |      0.660      0.035    19.10   0.000        0.593       0.728
------------------------------------------------------------------------------
(sum of wgt is 2,003.3306699975)

Linear regression                               Number of obs     =      2,002
                                                F(5, 1996)        =       6.42
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0265
                                                Root MSE          =     .49338

----------------------------------------------------------------------------------
                 |               Robust
             lib |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           treat |
             ic  |     -0.081      0.084    -0.97   0.334       -0.245       0.083
            irl  |      0.155      0.077     2.01   0.044        0.004       0.306
                 |
        partyid7 |     -0.028      0.013    -2.20   0.028       -0.053      -0.003
                 |
treat#c.partyid7 |
             ic  |      0.011      0.019     0.56   0.575       -0.027       0.048
            irl  |     -0.030      0.018    -1.66   0.098       -0.065       0.005
                 |
           _cons |      0.634      0.054    11.70   0.000        0.527       0.740
----------------------------------------------------------------------------------

. 
. estimates dir

-------------------------------------------------------
        name | command      depvar       npar  title 
-------------+-----------------------------------------
      spk_r1 | regress      spk             4  
    spk_r1d1 | margins      no depvar       3  
    spk_r1d2 | margins      no depvar       3  
      spk_r2 | regress      spk             2  
      spk_r3 | regress      spk             8  
    spk_r3d1 | margins      no depvar       3  
    spk_r3d2 | margins      no depvar       3  
      spk_r4 | margins      no depvar       1  
      spk_r5 | margins      no depvar       3  
      spk_r6 | margins      no depvar      21  
      col_r1 | regress      col             4  
    col_r1d1 | margins      no depvar       3  
    col_r1d2 | margins      no depvar       3  
      col_r2 | regress      col             2  
      col_r3 | regress      col             8  
    col_r3d1 | margins      no depvar       3  
    col_r3d2 | margins      no depvar       3  
      col_r4 | margins      no depvar       1  
      col_r5 | margins      no depvar       3  
      col_r6 | margins      no depvar      21  
      lib_r1 | regress      lib             4  
    lib_r1d1 | margins      no depvar       3  
    lib_r1d2 | margins      no depvar       3  
      lib_r2 | regress      lib             2  
      lib_r3 | regress      lib             8  
    lib_r3d1 | margins      no depvar       3  
    lib_r3d2 | margins      no depvar       3  
      lib_r4 | margins      no depvar       1  
      lib_r5 | margins      no depvar       3  
      lib_r6 | margins      no depvar      21  
-------------------------------------------------------

. 
. outreg2 [*] ///
>   using docs/ols-estimates-without-covariates.xls, ///
>   noaster stats(coef se ci pval)  dec(3)  ///
>   paren(se) bracket(ci) ///
>   excel replace
docs/ols-estimates-without-covariates.xls
dir : seeout

.   
. estimates clear

. 
. foreach dom in `domain' {
  2. 
. regress `dom' b1.treat [pweight=weight]
  3.   margins b1.treat, post
  4.   estimates store `dom'_r1
  5.     quietly regress `dom' b1.treat [pweight=weight]
  6.     margins, dydx(b1.treat) post
  7.     estimates store `dom'_r1d1
  8.     quietly regress `dom' b2.treat [pweight=weight]
  9.     margins, dydx(b2.treat) post
 10.     estimates store `dom'_r1d2
 11. 
. regress `dom' c.partyid7 [pweight=weight]
 12.   margins, dydx(c.partyid7) post
 13.   estimates store `dom'_r2
 14.    
. regress `dom' b1.treat##c.partyid7 [pweight=weight]
 15.   margins b1.treat, post
 16.   estimates store `dom'_r3
 17.     quietly regress `dom' b1.treat##c.partyid7 [pweight=weight]
 18.     margins, dydx(b1.treat) post
 19.     estimates store `dom'_r3d1
 20.     quietly regress `dom' b2.treat##c.partyid7 [pweight=weight]
 21.     margins, dydx(b2.treat) post
 22.     estimates store `dom'_r3d2
 23.   quietly regress `dom' b1.treat##c.partyid7 [pweight=weight]
 24.     margins, dydx(c.partyid7) post
 25.     estimates store `dom'_r4
 26.   quietly regress `dom' b1.treat##c.partyid7 [pweight=weight]
 27.     margins, dydx(partyid7) at(treat = (1(1)3)) post
 28.     estimates store `dom'_r5
 29.   quietly regress `dom' b1.treat##c.partyid7 [pweight=weight] 
 30.     margins, dydx(b1.treat) at(partyid = (1(1)7)) post
 31.     estimates store `dom'_r6
 32. 
. }
(sum of wgt is 2,015.9584942246)

Linear regression                               Number of obs     =      2,016
                                                F(2, 2013)        =       2.17
                                                Prob > F          =     0.1143
                                                R-squared         =     0.0042
                                                Root MSE          =     .49647

------------------------------------------------------------------------------
             |               Robust
         spk |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.078      0.037    -2.08   0.038       -0.151      -0.004
        irl  |     -0.034      0.039    -0.87   0.383       -0.111       0.043
             |
       _cons |      0.483      0.026    18.61   0.000        0.432       0.534
------------------------------------------------------------------------------

Adjusted predictions                            Number of obs     =      2,016
Model VCE    : Robust

Expression   : Linear prediction, predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.483      0.026    18.61   0.000        0.432       0.534
         ic  |      0.405      0.027    15.14   0.000        0.353       0.458
        irl  |      0.449      0.029    15.32   0.000        0.391       0.506
------------------------------------------------------------------------------

Conditional marginal effects                    Number of obs     =      2,016
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.078      0.037    -2.08   0.038       -0.151      -0.004
        irl  |     -0.034      0.039    -0.87   0.383       -0.111       0.043
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Conditional marginal effects                    Number of obs     =      2,016
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 1.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.078      0.037     2.08   0.038        0.004       0.151
        irl  |      0.043      0.040     1.09   0.274       -0.034       0.121
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.
(sum of wgt is 2,008.1219889845)

Linear regression                               Number of obs     =      2,009
                                                F(1, 2007)        =       4.53
                                                Prob > F          =     0.0335
                                                R-squared         =     0.0044
                                                Root MSE          =      .4963

------------------------------------------------------------------------------
             |               Robust
         spk |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    partyid7 |     -0.017      0.008    -2.13   0.033       -0.033      -0.001
       _cons |      0.512      0.036    14.33   0.000        0.442       0.582
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,009
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : partyid7

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    partyid7 |     -0.017      0.008    -2.13   0.033       -0.033      -0.001
------------------------------------------------------------------------------
(sum of wgt is 2,008.1219889845)

Linear regression                               Number of obs     =      2,009
                                                F(5, 2003)        =       2.07
                                                Prob > F          =     0.0660
                                                R-squared         =     0.0090
                                                Root MSE          =     .49565

----------------------------------------------------------------------------------
                 |               Robust
             spk |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           treat |
             ic  |     -0.011      0.082    -0.14   0.891       -0.171       0.149
            irl  |      0.006      0.089     0.07   0.943       -0.168       0.181
                 |
        partyid7 |     -0.009      0.012    -0.71   0.479       -0.033       0.016
                 |
treat#c.partyid7 |
             ic  |     -0.016      0.018    -0.89   0.373       -0.052       0.020
            irl  |     -0.010      0.020    -0.50   0.619       -0.049       0.029
                 |
           _cons |      0.515      0.054     9.61   0.000        0.410       0.620
----------------------------------------------------------------------------------

Predictive margins                              Number of obs     =      2,009
Model VCE    : Robust

Expression   : Linear prediction, predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.481      0.026    18.47   0.000        0.430       0.532
         ic  |      0.407      0.027    15.23   0.000        0.355       0.460
        irl  |      0.450      0.029    15.36   0.000        0.392       0.507
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,009
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.074      0.037    -1.98   0.047       -0.147      -0.001
        irl  |     -0.032      0.039    -0.81   0.418       -0.109       0.045
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,009
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 1.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.074      0.037     1.98   0.047        0.001       0.147
        irl  |      0.042      0.040     1.07   0.286       -0.035       0.120
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,009
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : partyid7

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    partyid7 |     -0.017      0.008    -2.18   0.029       -0.033      -0.002
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,009
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : partyid7

1._at        : treat           =           1

2._at        : treat           =           2

3._at        : treat           =           3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
partyid7     |
         _at |
          1  |     -0.009      0.012    -0.71   0.479       -0.033       0.016
          2  |     -0.025      0.013    -1.87   0.062       -0.052       0.001
          3  |     -0.019      0.016    -1.21   0.228       -0.049       0.012
------------------------------------------------------------------------------

Conditional marginal effects                    Number of obs     =      2,009
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.treat 3.treat

1._at        : partyid7        =           1

2._at        : partyid7        =           2

3._at        : partyid7        =           3

4._at        : partyid7        =           4

5._at        : partyid7        =           5

6._at        : partyid7        =           6

7._at        : partyid7        =           7

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1.treat      |  (base outcome)
-------------+----------------------------------------------------------------
2.treat      |
         _at |
          1  |     -0.028      0.066    -0.42   0.675       -0.157       0.102
          2  |     -0.044      0.052    -0.85   0.396       -0.146       0.058
          3  |     -0.060      0.041    -1.46   0.143       -0.141       0.020
          4  |     -0.077      0.037    -2.06   0.040       -0.150      -0.004
          5  |     -0.093      0.042    -2.22   0.027       -0.175      -0.011
          6  |     -0.110      0.053    -2.07   0.039       -0.213      -0.006
          7  |     -0.126      0.067    -1.87   0.061       -0.258       0.006
-------------+----------------------------------------------------------------
3.treat      |
         _at |
          1  |     -0.004      0.072    -0.05   0.960       -0.144       0.137
          2  |     -0.014      0.056    -0.24   0.809       -0.123       0.096
          3  |     -0.023      0.044    -0.53   0.594       -0.110       0.063
          4  |     -0.033      0.039    -0.85   0.393       -0.110       0.043
          5  |     -0.043      0.044    -0.99   0.323       -0.129       0.043
          6  |     -0.053      0.056    -0.95   0.340       -0.162       0.056
          7  |     -0.063      0.071    -0.88   0.377       -0.203       0.077
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.
(sum of wgt is 2,011.2303007225)

Linear regression                               Number of obs     =      2,012
                                                F(2, 2009)        =       1.73
                                                Prob > F          =     0.1784
                                                R-squared         =     0.0035
                                                Root MSE          =     .43245

------------------------------------------------------------------------------
             |               Robust
         col |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.054      0.033    -1.63   0.104       -0.120       0.011
        irl  |     -0.053      0.033    -1.62   0.106       -0.117       0.011
             |
       _cons |      0.284      0.024    11.83   0.000        0.237       0.331
------------------------------------------------------------------------------

Adjusted predictions                            Number of obs     =      2,012
Model VCE    : Robust

Expression   : Linear prediction, predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.284      0.024    11.83   0.000        0.237       0.331
         ic  |      0.230      0.023     9.94   0.000        0.185       0.275
        irl  |      0.231      0.022    10.37   0.000        0.187       0.275
------------------------------------------------------------------------------

Conditional marginal effects                    Number of obs     =      2,012
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.054      0.033    -1.63   0.104       -0.120       0.011
        irl  |     -0.053      0.033    -1.62   0.106       -0.117       0.011
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Conditional marginal effects                    Number of obs     =      2,012
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 1.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.054      0.033     1.63   0.104       -0.011       0.120
        irl  |      0.001      0.032     0.04   0.969       -0.062       0.064
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.
(sum of wgt is 2,003.3937954824)

Linear regression                               Number of obs     =      2,005
                                                F(1, 2003)        =      13.89
                                                Prob > F          =     0.0002
                                                R-squared         =     0.0120
                                                Root MSE          =     .42955

------------------------------------------------------------------------------
             |               Robust
         col |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    partyid7 |     -0.024      0.007    -3.73   0.000       -0.037      -0.012
       _cons |      0.342      0.031    11.16   0.000        0.282       0.402
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,005
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : partyid7

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    partyid7 |     -0.024      0.007    -3.73   0.000       -0.037      -0.012
------------------------------------------------------------------------------
(sum of wgt is 2,003.3937954824)

Linear regression                               Number of obs     =      2,005
                                                F(5, 1999)        =       3.96
                                                Prob > F          =     0.0014
                                                R-squared         =     0.0179
                                                Root MSE          =      .4287

----------------------------------------------------------------------------------
                 |               Robust
             col |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           treat |
             ic  |     -0.115      0.073    -1.57   0.117       -0.258       0.029
            irl  |     -0.155      0.072    -2.15   0.031       -0.296      -0.014
                 |
        partyid7 |     -0.038      0.011    -3.53   0.000       -0.059      -0.017
                 |
treat#c.partyid7 |
             ic  |      0.017      0.015     1.10   0.274       -0.013       0.047
            irl  |      0.028      0.016     1.75   0.080       -0.003       0.059
                 |
           _cons |      0.426      0.051     8.39   0.000        0.327       0.526
----------------------------------------------------------------------------------

Predictive margins                              Number of obs     =      2,005
Model VCE    : Robust

Expression   : Linear prediction, predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.280      0.023    11.92   0.000        0.234       0.326
         ic  |      0.229      0.023     9.90   0.000        0.184       0.275
        irl  |      0.231      0.023    10.27   0.000        0.187       0.276
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,005
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.051      0.033    -1.54   0.124       -0.116       0.014
        irl  |     -0.049      0.033    -1.49   0.136       -0.112       0.015
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,005
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 1.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.051      0.033     1.54   0.124       -0.014       0.116
        irl  |      0.002      0.032     0.07   0.944       -0.061       0.066
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,005
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : partyid7

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    partyid7 |     -0.024      0.006    -3.77   0.000       -0.036      -0.012
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,005
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : partyid7

1._at        : treat           =           1

2._at        : treat           =           2

3._at        : treat           =           3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
partyid7     |
         _at |
          1  |     -0.038      0.011    -3.53   0.000       -0.059      -0.017
          2  |     -0.021      0.011    -1.99   0.047       -0.043      -0.000
          3  |     -0.010      0.012    -0.90   0.369       -0.033       0.012
------------------------------------------------------------------------------

Conditional marginal effects                    Number of obs     =      2,005
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.treat 3.treat

1._at        : partyid7        =           1

2._at        : partyid7        =           2

3._at        : partyid7        =           3

4._at        : partyid7        =           4

5._at        : partyid7        =           5

6._at        : partyid7        =           6

7._at        : partyid7        =           7

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1.treat      |  (base outcome)
-------------+----------------------------------------------------------------
2.treat      |
         _at |
          1  |     -0.098      0.060    -1.64   0.101       -0.216       0.019
          2  |     -0.082      0.048    -1.71   0.088       -0.175       0.012
          3  |     -0.065      0.038    -1.71   0.087       -0.139       0.009
          4  |     -0.048      0.033    -1.48   0.139       -0.112       0.016
          5  |     -0.031      0.034    -0.93   0.353       -0.098       0.035
          6  |     -0.015      0.041    -0.36   0.720       -0.096       0.066
          7  |      0.002      0.052     0.04   0.970       -0.100       0.104
-------------+----------------------------------------------------------------
3.treat      |
         _at |
          1  |     -0.127      0.058    -2.19   0.029       -0.241      -0.013
          2  |     -0.100      0.046    -2.17   0.030       -0.190      -0.009
          3  |     -0.072      0.036    -1.97   0.049       -0.143      -0.000
          4  |     -0.044      0.032    -1.36   0.173       -0.108       0.019
          5  |     -0.016      0.036    -0.46   0.645       -0.086       0.053
          6  |      0.011      0.045     0.25   0.799       -0.076       0.099
          7  |      0.039      0.057     0.69   0.491       -0.072       0.150
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.
(sum of wgt is 2,011.1671752376)

Linear regression                               Number of obs     =      2,009
                                                F(2, 2006)        =       2.00
                                                Prob > F          =     0.1352
                                                R-squared         =     0.0041
                                                Root MSE          =     .49869

------------------------------------------------------------------------------
             |               Robust
         lib |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.038      0.038    -1.01   0.315       -0.112       0.036
        irl  |      0.042      0.039     1.08   0.280       -0.035       0.119
             |
       _cons |      0.525      0.026    20.14   0.000        0.474       0.576
------------------------------------------------------------------------------

Adjusted predictions                            Number of obs     =      2,009
Model VCE    : Robust

Expression   : Linear prediction, predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.525      0.026    20.14   0.000        0.474       0.576
         ic  |      0.487      0.027    17.72   0.000        0.433       0.541
        irl  |      0.567      0.029    19.34   0.000        0.510       0.625
------------------------------------------------------------------------------

Conditional marginal effects                    Number of obs     =      2,009
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.038      0.038    -1.01   0.315       -0.112       0.036
        irl  |      0.042      0.039     1.08   0.280       -0.035       0.119
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Conditional marginal effects                    Number of obs     =      2,009
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 1.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.038      0.038     1.01   0.315       -0.036       0.112
        irl  |      0.080      0.040     2.00   0.045        0.002       0.159
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.
(sum of wgt is 2,003.3306699975)

Linear regression                               Number of obs     =      2,002
                                                F(1, 2000)        =      19.51
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0182
                                                Root MSE          =     .49497

------------------------------------------------------------------------------
             |               Robust
         lib |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    partyid7 |     -0.035      0.008    -4.42   0.000       -0.050      -0.019
       _cons |      0.660      0.035    19.10   0.000        0.593       0.728
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,002
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : partyid7

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    partyid7 |     -0.035      0.008    -4.42   0.000       -0.050      -0.019
------------------------------------------------------------------------------
(sum of wgt is 2,003.3306699975)

Linear regression                               Number of obs     =      2,002
                                                F(5, 1996)        =       6.42
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0265
                                                Root MSE          =     .49338

----------------------------------------------------------------------------------
                 |               Robust
             lib |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           treat |
             ic  |     -0.081      0.084    -0.97   0.334       -0.245       0.083
            irl  |      0.155      0.077     2.01   0.044        0.004       0.306
                 |
        partyid7 |     -0.028      0.013    -2.20   0.028       -0.053      -0.003
                 |
treat#c.partyid7 |
             ic  |      0.011      0.019     0.56   0.575       -0.027       0.048
            irl  |     -0.030      0.018    -1.66   0.098       -0.065       0.005
                 |
           _cons |      0.634      0.054    11.70   0.000        0.527       0.740
----------------------------------------------------------------------------------

Predictive margins                              Number of obs     =      2,002
Model VCE    : Robust

Expression   : Linear prediction, predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.527      0.026    20.19   0.000        0.475       0.578
         ic  |      0.487      0.028    17.62   0.000        0.433       0.541
        irl  |      0.567      0.027    20.87   0.000        0.514       0.620
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,002
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.040      0.038    -1.04   0.296       -0.114       0.035
        irl  |      0.040      0.038     1.07   0.285       -0.034       0.114
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,002
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 1.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.040      0.038     1.04   0.296       -0.035       0.114
        irl  |      0.080      0.039     2.06   0.039        0.004       0.156
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,002
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : partyid7

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    partyid7 |     -0.034      0.008    -4.36   0.000       -0.049      -0.018
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,002
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : partyid7

1._at        : treat           =           1

2._at        : treat           =           2

3._at        : treat           =           3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
partyid7     |
         _at |
          1  |     -0.028      0.013    -2.20   0.028       -0.053      -0.003
          2  |     -0.017      0.014    -1.19   0.235       -0.045       0.011
          3  |     -0.058      0.013    -4.50   0.000       -0.083      -0.033
------------------------------------------------------------------------------

Conditional marginal effects                    Number of obs     =      2,002
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.treat 3.treat

1._at        : partyid7        =           1

2._at        : partyid7        =           2

3._at        : partyid7        =           3

4._at        : partyid7        =           4

5._at        : partyid7        =           5

6._at        : partyid7        =           6

7._at        : partyid7        =           7

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1.treat      |  (base outcome)
-------------+----------------------------------------------------------------
2.treat      |
         _at |
          1  |     -0.070      0.067    -1.04   0.296       -0.202       0.062
          2  |     -0.060      0.053    -1.13   0.258       -0.163       0.044
          3  |     -0.049      0.042    -1.17   0.242       -0.130       0.033
          4  |     -0.038      0.038    -1.00   0.318       -0.113       0.037
          5  |     -0.027      0.043    -0.63   0.531       -0.113       0.058
          6  |     -0.016      0.055    -0.30   0.766       -0.125       0.092
          7  |     -0.006      0.071    -0.08   0.935       -0.144       0.133
-------------+----------------------------------------------------------------
3.treat      |
         _at |
          1  |      0.125      0.062     2.02   0.043        0.004       0.246
          2  |      0.095      0.049     1.95   0.051       -0.000       0.191
          3  |      0.065      0.040     1.64   0.101       -0.013       0.143
          4  |      0.036      0.038     0.94   0.349       -0.039       0.110
          5  |      0.006      0.044     0.13   0.897       -0.081       0.092
          6  |     -0.024      0.056    -0.43   0.665       -0.133       0.085
          7  |     -0.054      0.070    -0.77   0.441       -0.191       0.083
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

. 
. outreg2 [*] ///
>   using docs/ols-margins-without-covariates.xls, ///
>   noaster stats(coef se ci pval) bdec(1) sdec(1) cdec(3)  ///
>   stnum(replace coef=coef*100, replace se=se*100) ///
>   paren(se) bracket(ci) ///
>   excel replace
docs/ols-margins-without-covariates.xls
dir : seeout

. 
. estimates clear

. 
. *** Logit models, with no additional adjustment
. 
. foreach dom in `domain' {
  2. 
. logit `dom' b1.treat [pweight=weight]
  3. estimates store `dom'_r1
  4. 
. logit `dom' c.partyid7 [pweight=weight]
  5. estimates store `dom'_r2
  6. 
. logit `dom' b1.treat##c.partyid7 [pweight=weight]
  7. estimates store `dom'_r3
  8. 
. }

Iteration 0:   log pseudolikelihood = -1385.8683  
Iteration 1:   log pseudolikelihood = -1381.6131  
Iteration 2:   log pseudolikelihood = -1381.6128  
Iteration 3:   log pseudolikelihood = -1381.6128  

Logistic regression                             Number of obs     =      2,016
                                                Wald chi2(2)      =       4.30
                                                Prob > chi2       =     0.1165
Log pseudolikelihood = -1381.6128               Pseudo R2         =     0.0031

------------------------------------------------------------------------------
             |               Robust
         spk |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.315      0.152    -2.07   0.038       -0.613      -0.017
        irl  |     -0.137      0.157    -0.87   0.383       -0.446       0.171
             |
       _cons |     -0.068      0.104    -0.66   0.511       -0.272       0.135
------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -1380.5082  
Iteration 1:   log pseudolikelihood = -1376.0711  
Iteration 2:   log pseudolikelihood = -1376.0708  
Iteration 3:   log pseudolikelihood = -1376.0708  

Logistic regression                             Number of obs     =      2,009
                                                Wald chi2(1)      =       4.49
                                                Prob > chi2       =     0.0341
Log pseudolikelihood = -1376.0708               Pseudo R2         =     0.0032

------------------------------------------------------------------------------
             |               Robust
         spk |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    partyid7 |     -0.069      0.033    -2.12   0.034       -0.133      -0.005
       _cons |      0.051      0.144     0.35   0.723       -0.231       0.333
------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -1380.5082  
Iteration 1:   log pseudolikelihood =  -1371.398  
Iteration 2:   log pseudolikelihood =  -1371.393  
Iteration 3:   log pseudolikelihood =  -1371.393  

Logistic regression                             Number of obs     =      2,009
                                                Wald chi2(5)      =       9.89
                                                Prob > chi2       =     0.0783
Log pseudolikelihood =  -1371.393               Pseudo R2         =     0.0066

----------------------------------------------------------------------------------
                 |               Robust
             spk |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           treat |
             ic  |     -0.036      0.331    -0.11   0.914       -0.684       0.613
            irl  |      0.027      0.357     0.08   0.939       -0.673       0.727
                 |
        partyid7 |     -0.035      0.050    -0.71   0.479       -0.134       0.063
                 |
treat#c.partyid7 |
             ic  |     -0.070      0.076    -0.92   0.356       -0.218       0.078
            irl  |     -0.041      0.081    -0.50   0.615       -0.199       0.118
                 |
           _cons |      0.061      0.214     0.29   0.775       -0.359       0.481
----------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -1130.5407  
Iteration 1:   log pseudolikelihood = -1127.0235  
Iteration 2:   log pseudolikelihood = -1127.0183  
Iteration 3:   log pseudolikelihood = -1127.0183  

Logistic regression                             Number of obs     =      2,012
                                                Wald chi2(2)      =       3.59
                                                Prob > chi2       =     0.1665
Log pseudolikelihood = -1127.0183               Pseudo R2         =     0.0031

------------------------------------------------------------------------------
             |               Robust
         col |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.285      0.176    -1.62   0.105       -0.630       0.060
        irl  |     -0.278      0.172    -1.62   0.106       -0.615       0.059
             |
       _cons |     -0.924      0.118    -7.83   0.000       -1.155      -0.693
------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -1122.4494  
Iteration 1:   log pseudolikelihood = -1110.4121  
Iteration 2:   log pseudolikelihood = -1110.3611  
Iteration 3:   log pseudolikelihood = -1110.3611  

Logistic regression                             Number of obs     =      2,005
                                                Wald chi2(1)      =      13.58
                                                Prob > chi2       =     0.0002
Log pseudolikelihood = -1110.3611               Pseudo R2         =     0.0108

------------------------------------------------------------------------------
             |               Robust
         col |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    partyid7 |     -0.133      0.036    -3.68   0.000       -0.204      -0.062
       _cons |     -0.615      0.152    -4.05   0.000       -0.912      -0.318
------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -1122.4494  
Iteration 1:   log pseudolikelihood = -1105.2356  
Iteration 2:   log pseudolikelihood = -1105.0478  
Iteration 3:   log pseudolikelihood = -1105.0477  

Logistic regression                             Number of obs     =      2,005
                                                Wald chi2(5)      =      20.66
                                                Prob > chi2       =     0.0009
Log pseudolikelihood = -1105.0477               Pseudo R2         =     0.0155

----------------------------------------------------------------------------------
                 |               Robust
             col |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           treat |
             ic  |     -0.524      0.359    -1.46   0.144       -1.228       0.179
            irl  |     -0.749      0.358    -2.09   0.036       -1.452      -0.047
                 |
        partyid7 |     -0.195      0.058    -3.38   0.001       -0.308      -0.082
                 |
treat#c.partyid7 |
             ic  |      0.072      0.084     0.85   0.393       -0.093       0.237
            irl  |      0.136      0.087     1.57   0.117       -0.034       0.307
                 |
           _cons |     -0.229      0.232    -0.99   0.322       -0.684       0.225
----------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -1391.4433  
Iteration 1:   log pseudolikelihood = -1387.2689  
Iteration 2:   log pseudolikelihood = -1387.2688  

Logistic regression                             Number of obs     =      2,009
                                                Wald chi2(2)      =       3.97
                                                Prob > chi2       =     0.1373
Log pseudolikelihood = -1387.2688               Pseudo R2         =     0.0030

------------------------------------------------------------------------------
             |               Robust
         lib |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.152      0.152    -1.00   0.315       -0.450       0.145
        irl  |      0.171      0.159     1.08   0.281       -0.140       0.482
             |
       _cons |      0.100      0.104     0.95   0.340       -0.105       0.304
------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -1385.7829  
Iteration 1:   log pseudolikelihood = -1367.4214  
Iteration 2:   log pseudolikelihood = -1367.4188  
Iteration 3:   log pseudolikelihood = -1367.4188  

Logistic regression                             Number of obs     =      2,002
                                                Wald chi2(1)      =      18.69
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -1367.4188               Pseudo R2         =     0.0133

------------------------------------------------------------------------------
             |               Robust
         lib |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    partyid7 |     -0.141      0.033    -4.32   0.000       -0.205      -0.077
       _cons |      0.651      0.144     4.51   0.000        0.368       0.933
------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -1385.7829  
Iteration 1:   log pseudolikelihood = -1358.7639  
Iteration 2:   log pseudolikelihood = -1358.7141  
Iteration 3:   log pseudolikelihood = -1358.7141  

Logistic regression                             Number of obs     =      2,002
                                                Wald chi2(5)      =      27.89
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -1358.7141               Pseudo R2         =     0.0195

----------------------------------------------------------------------------------
                 |               Robust
             lib |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           treat |
             ic  |     -0.329      0.340    -0.97   0.333       -0.995       0.337
            irl  |      0.675      0.339     1.99   0.047        0.010       1.341
                 |
        partyid7 |     -0.112      0.052    -2.17   0.030       -0.214      -0.011
                 |
treat#c.partyid7 |
             ic  |      0.044      0.078     0.56   0.573       -0.108       0.196
            irl  |     -0.130      0.077    -1.68   0.093       -0.281       0.021
                 |
           _cons |      0.540      0.223     2.42   0.015        0.103       0.977
----------------------------------------------------------------------------------

. 
. estimates dir

-------------------------------------------------------
        name | command      depvar       npar  title 
-------------+-----------------------------------------
      spk_r1 | logit        spk             4  
      spk_r2 | logit        spk             2  
      spk_r3 | logit        spk             8  
      col_r1 | logit        col             4  
      col_r2 | logit        col             2  
      col_r3 | logit        col             8  
      lib_r1 | logit        lib             4  
      lib_r2 | logit        lib             2  
      lib_r3 | logit        lib             8  
-------------------------------------------------------

. 
. outreg2 [*] ///
>   using docs/logit-estimates-without-covariates.xls, ///
>   noaster stats(coef se ci pval)  dec(3)  ///
>   paren(se) bracket(ci) ///
>   excel replace
docs/logit-estimates-without-covariates.xls
dir : seeout

. 
. estimates clear

. 
. foreach dom in `domain' {
  2. 
. logit `dom' b1.treat [pweight=weight]
  3.   margins b1.treat, post
  4.   estimates store `dom'_r1
  5.     quietly logit `dom' b1.treat [pweight=weight]
  6.     margins, dydx(b1.treat) post
  7.     estimates store `dom'_r1d1
  8.     quietly logit `dom' b2.treat [pweight=weight]
  9.     margins, dydx(b2.treat) post
 10.     estimates store `dom'_r1d2
 11. 
. logit `dom' c.partyid7 [pweight=weight]
 12.   margins, dydx(c.partyid7) post
 13.   estimates store `dom'_r2
 14.    
. logit `dom' b1.treat##c.partyid7 [pweight=weight]
 15.   margins b1.treat, post
 16.   estimates store `dom'_r3
 17.     quietly logit `dom' b1.treat##c.partyid7 [pweight=weight]
 18.     margins, dydx(b1.treat) post
 19.     estimates store `dom'_r3d1
 20.     quietly logit `dom' b2.treat##c.partyid7 [pweight=weight]
 21.     margins, dydx(b2.treat) post
 22.     estimates store `dom'_r3d2
 23.   quietly logit `dom' b1.treat##c.partyid7 [pweight=weight]
 24.     margins, dydx(c.partyid7) post
 25.     estimates store `dom'_r4
 26.   quietly logit `dom' b1.treat##c.partyid7 [pweight=weight]
 27.     margins, dydx(partyid7) at(treat = (1(1)3)) post
 28.     estimates store `dom'_r5
 29.   quietly logit `dom' b1.treat##c.partyid7 [pweight=weight] 
 30.     margins, dydx(b1.treat) at(partyid = (1(1)7)) post
 31.     estimates store `dom'_r6
 32. 
. }

Iteration 0:   log pseudolikelihood = -1385.8683  
Iteration 1:   log pseudolikelihood = -1381.6131  
Iteration 2:   log pseudolikelihood = -1381.6128  
Iteration 3:   log pseudolikelihood = -1381.6128  

Logistic regression                             Number of obs     =      2,016
                                                Wald chi2(2)      =       4.30
                                                Prob > chi2       =     0.1165
Log pseudolikelihood = -1381.6128               Pseudo R2         =     0.0031

------------------------------------------------------------------------------
             |               Robust
         spk |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.315      0.152    -2.07   0.038       -0.613      -0.017
        irl  |     -0.137      0.157    -0.87   0.383       -0.446       0.171
             |
       _cons |     -0.068      0.104    -0.66   0.511       -0.272       0.135
------------------------------------------------------------------------------

Adjusted predictions                            Number of obs     =      2,016
Model VCE    : Robust

Expression   : Pr(spk), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.483      0.026    18.62   0.000        0.432       0.534
         ic  |      0.405      0.027    15.15   0.000        0.353       0.458
        irl  |      0.449      0.029    15.32   0.000        0.391       0.506
------------------------------------------------------------------------------

Conditional marginal effects                    Number of obs     =      2,016
Model VCE    : Robust

Expression   : Pr(spk), predict()
dy/dx w.r.t. : 2.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.078      0.037    -2.08   0.037       -0.151      -0.005
        irl  |     -0.034      0.039    -0.87   0.382       -0.111       0.042
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Conditional marginal effects                    Number of obs     =      2,016
Model VCE    : Robust

Expression   : Pr(spk), predict()
dy/dx w.r.t. : 1.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.078      0.037     2.08   0.037        0.005       0.151
        irl  |      0.043      0.040     1.09   0.274       -0.034       0.121
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Iteration 0:   log pseudolikelihood = -1380.5082  
Iteration 1:   log pseudolikelihood = -1376.0711  
Iteration 2:   log pseudolikelihood = -1376.0708  
Iteration 3:   log pseudolikelihood = -1376.0708  

Logistic regression                             Number of obs     =      2,009
                                                Wald chi2(1)      =       4.49
                                                Prob > chi2       =     0.0341
Log pseudolikelihood = -1376.0708               Pseudo R2         =     0.0032

------------------------------------------------------------------------------
             |               Robust
         spk |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    partyid7 |     -0.069      0.033    -2.12   0.034       -0.133      -0.005
       _cons |      0.051      0.144     0.35   0.723       -0.231       0.333
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,009
Model VCE    : Robust

Expression   : Pr(spk), predict()
dy/dx w.r.t. : partyid7

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    partyid7 |     -0.017      0.008    -2.13   0.033       -0.033      -0.001
------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -1380.5082  
Iteration 1:   log pseudolikelihood =  -1371.398  
Iteration 2:   log pseudolikelihood =  -1371.393  
Iteration 3:   log pseudolikelihood =  -1371.393  

Logistic regression                             Number of obs     =      2,009
                                                Wald chi2(5)      =       9.89
                                                Prob > chi2       =     0.0783
Log pseudolikelihood =  -1371.393               Pseudo R2         =     0.0066

----------------------------------------------------------------------------------
                 |               Robust
             spk |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           treat |
             ic  |     -0.036      0.331    -0.11   0.914       -0.684       0.613
            irl  |      0.027      0.357     0.08   0.939       -0.673       0.727
                 |
        partyid7 |     -0.035      0.050    -0.71   0.479       -0.134       0.063
                 |
treat#c.partyid7 |
             ic  |     -0.070      0.076    -0.92   0.356       -0.218       0.078
            irl  |     -0.041      0.081    -0.50   0.615       -0.199       0.118
                 |
           _cons |      0.061      0.214     0.29   0.775       -0.359       0.481
----------------------------------------------------------------------------------

Predictive margins                              Number of obs     =      2,009
Model VCE    : Robust

Expression   : Pr(spk), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.481      0.026    18.49   0.000        0.430       0.532
         ic  |      0.407      0.027    15.26   0.000        0.355       0.460
        irl  |      0.450      0.029    15.38   0.000        0.392       0.507
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,009
Model VCE    : Robust

Expression   : Pr(spk), predict()
dy/dx w.r.t. : 2.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.074      0.037    -1.98   0.047       -0.147      -0.001
        irl  |     -0.032      0.039    -0.81   0.417       -0.108       0.045
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,009
Model VCE    : Robust

Expression   : Pr(spk), predict()
dy/dx w.r.t. : 1.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.074      0.037     1.98   0.047        0.001       0.147
        irl  |      0.042      0.040     1.07   0.286       -0.035       0.120
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,009
Model VCE    : Robust

Expression   : Pr(spk), predict()
dy/dx w.r.t. : partyid7

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    partyid7 |     -0.017      0.008    -2.19   0.029       -0.033      -0.002
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,009
Model VCE    : Robust

Expression   : Pr(spk), predict()
dy/dx w.r.t. : partyid7

1._at        : treat           =           1

2._at        : treat           =           2

3._at        : treat           =           3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
partyid7     |
         _at |
          1  |     -0.009      0.012    -0.71   0.478       -0.033       0.016
          2  |     -0.025      0.013    -1.88   0.059       -0.051       0.001
          3  |     -0.019      0.015    -1.21   0.225       -0.049       0.012
------------------------------------------------------------------------------

Conditional marginal effects                    Number of obs     =      2,009
Model VCE    : Robust

Expression   : Pr(spk), predict()
dy/dx w.r.t. : 2.treat 3.treat

1._at        : partyid7        =           1

2._at        : partyid7        =           2

3._at        : partyid7        =           3

4._at        : partyid7        =           4

5._at        : partyid7        =           5

6._at        : partyid7        =           6

7._at        : partyid7        =           7

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1.treat      |  (base outcome)
-------------+----------------------------------------------------------------
2.treat      |
         _at |
          1  |     -0.026      0.066    -0.40   0.691       -0.157       0.104
          2  |     -0.044      0.052    -0.84   0.399       -0.145       0.058
          3  |     -0.061      0.041    -1.48   0.139       -0.141       0.020
          4  |     -0.078      0.037    -2.07   0.038       -0.151      -0.004
          5  |     -0.094      0.042    -2.22   0.027       -0.177      -0.011
          6  |     -0.109      0.053    -2.07   0.038       -0.213      -0.006
          7  |     -0.124      0.066    -1.89   0.059       -0.253       0.005
-------------+----------------------------------------------------------------
3.treat      |
         _at |
          1  |     -0.003      0.072    -0.05   0.963       -0.144       0.137
          2  |     -0.013      0.056    -0.24   0.809       -0.123       0.096
          3  |     -0.024      0.044    -0.54   0.590       -0.110       0.062
          4  |     -0.034      0.039    -0.86   0.390       -0.110       0.043
          5  |     -0.043      0.044    -0.99   0.323       -0.130       0.043
          6  |     -0.053      0.056    -0.96   0.339       -0.162       0.056
          7  |     -0.063      0.071    -0.89   0.375       -0.201       0.076
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Iteration 0:   log pseudolikelihood = -1130.5407  
Iteration 1:   log pseudolikelihood = -1127.0235  
Iteration 2:   log pseudolikelihood = -1127.0183  
Iteration 3:   log pseudolikelihood = -1127.0183  

Logistic regression                             Number of obs     =      2,012
                                                Wald chi2(2)      =       3.59
                                                Prob > chi2       =     0.1665
Log pseudolikelihood = -1127.0183               Pseudo R2         =     0.0031

------------------------------------------------------------------------------
             |               Robust
         col |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.285      0.176    -1.62   0.105       -0.630       0.060
        irl  |     -0.278      0.172    -1.62   0.106       -0.615       0.059
             |
       _cons |     -0.924      0.118    -7.83   0.000       -1.155      -0.693
------------------------------------------------------------------------------

Adjusted predictions                            Number of obs     =      2,012
Model VCE    : Robust

Expression   : Pr(col), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.284      0.024    11.84   0.000        0.237       0.331
         ic  |      0.230      0.023     9.95   0.000        0.185       0.275
        irl  |      0.231      0.022    10.38   0.000        0.187       0.275
------------------------------------------------------------------------------

Conditional marginal effects                    Number of obs     =      2,012
Model VCE    : Robust

Expression   : Pr(col), predict()
dy/dx w.r.t. : 2.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.054      0.033    -1.63   0.103       -0.120       0.011
        irl  |     -0.053      0.033    -1.62   0.105       -0.117       0.011
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Conditional marginal effects                    Number of obs     =      2,012
Model VCE    : Robust

Expression   : Pr(col), predict()
dy/dx w.r.t. : 1.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.054      0.033     1.63   0.103       -0.011       0.120
        irl  |      0.001      0.032     0.04   0.969       -0.062       0.064
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Iteration 0:   log pseudolikelihood = -1122.4494  
Iteration 1:   log pseudolikelihood = -1110.4121  
Iteration 2:   log pseudolikelihood = -1110.3611  
Iteration 3:   log pseudolikelihood = -1110.3611  

Logistic regression                             Number of obs     =      2,005
                                                Wald chi2(1)      =      13.58
                                                Prob > chi2       =     0.0002
Log pseudolikelihood = -1110.3611               Pseudo R2         =     0.0108

------------------------------------------------------------------------------
             |               Robust
         col |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    partyid7 |     -0.133      0.036    -3.68   0.000       -0.204      -0.062
       _cons |     -0.615      0.152    -4.05   0.000       -0.912      -0.318
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,005
Model VCE    : Robust

Expression   : Pr(col), predict()
dy/dx w.r.t. : partyid7

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    partyid7 |     -0.024      0.007    -3.72   0.000       -0.037      -0.012
------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -1122.4494  
Iteration 1:   log pseudolikelihood = -1105.2356  
Iteration 2:   log pseudolikelihood = -1105.0478  
Iteration 3:   log pseudolikelihood = -1105.0477  

Logistic regression                             Number of obs     =      2,005
                                                Wald chi2(5)      =      20.66
                                                Prob > chi2       =     0.0009
Log pseudolikelihood = -1105.0477               Pseudo R2         =     0.0155

----------------------------------------------------------------------------------
                 |               Robust
             col |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           treat |
             ic  |     -0.524      0.359    -1.46   0.144       -1.228       0.179
            irl  |     -0.749      0.358    -2.09   0.036       -1.452      -0.047
                 |
        partyid7 |     -0.195      0.058    -3.38   0.001       -0.308      -0.082
                 |
treat#c.partyid7 |
             ic  |      0.072      0.084     0.85   0.393       -0.093       0.237
            irl  |      0.136      0.087     1.57   0.117       -0.034       0.307
                 |
           _cons |     -0.229      0.232    -0.99   0.322       -0.684       0.225
----------------------------------------------------------------------------------

Predictive margins                              Number of obs     =      2,005
Model VCE    : Robust

Expression   : Pr(col), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.279      0.024    11.89   0.000        0.233       0.326
         ic  |      0.230      0.023     9.90   0.000        0.184       0.275
        irl  |      0.231      0.023    10.28   0.000        0.187       0.276
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,005
Model VCE    : Robust

Expression   : Pr(col), predict()
dy/dx w.r.t. : 2.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.050      0.033    -1.51   0.130       -0.115       0.015
        irl  |     -0.048      0.033    -1.48   0.140       -0.112       0.016
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,005
Model VCE    : Robust

Expression   : Pr(col), predict()
dy/dx w.r.t. : 1.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.050      0.033     1.51   0.130       -0.015       0.115
        irl  |      0.002      0.032     0.06   0.953       -0.061       0.065
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,005
Model VCE    : Robust

Expression   : Pr(col), predict()
dy/dx w.r.t. : partyid7

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    partyid7 |     -0.024      0.006    -3.77   0.000       -0.037      -0.012
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,005
Model VCE    : Robust

Expression   : Pr(col), predict()
dy/dx w.r.t. : partyid7

1._at        : treat           =           1

2._at        : treat           =           2

3._at        : treat           =           3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
partyid7     |
         _at |
          1  |     -0.038      0.011    -3.54   0.000       -0.059      -0.017
          2  |     -0.022      0.011    -1.98   0.048       -0.043      -0.000
          3  |     -0.010      0.012    -0.90   0.369       -0.033       0.012
------------------------------------------------------------------------------

Conditional marginal effects                    Number of obs     =      2,005
Model VCE    : Robust

Expression   : Pr(col), predict()
dy/dx w.r.t. : 2.treat 3.treat

1._at        : partyid7        =           1

2._at        : partyid7        =           2

3._at        : partyid7        =           3

4._at        : partyid7        =           4

5._at        : partyid7        =           5

6._at        : partyid7        =           6

7._at        : partyid7        =           7

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1.treat      |  (base outcome)
-------------+----------------------------------------------------------------
2.treat      |
         _at |
          1  |     -0.102      0.064    -1.59   0.111       -0.227       0.024
          2  |     -0.081      0.048    -1.69   0.092       -0.175       0.013
          3  |     -0.061      0.037    -1.66   0.098       -0.134       0.011
          4  |     -0.044      0.033    -1.31   0.190       -0.109       0.022
          5  |     -0.028      0.036    -0.78   0.435       -0.098       0.042
          6  |     -0.014      0.041    -0.35   0.727       -0.094       0.066
          7  |     -0.003      0.046    -0.06   0.951       -0.093       0.088
-------------+----------------------------------------------------------------
3.treat      |
         _at |
          1  |     -0.134      0.061    -2.19   0.028       -0.253      -0.014
          2  |     -0.099      0.046    -2.17   0.030       -0.189      -0.009
          3  |     -0.067      0.036    -1.88   0.061       -0.138       0.003
          4  |     -0.038      0.033    -1.14   0.254       -0.103       0.027
          5  |     -0.012      0.037    -0.31   0.754       -0.085       0.061
          6  |      0.011      0.044     0.25   0.800       -0.076       0.098
          7  |      0.031      0.052     0.59   0.553       -0.071       0.133
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Iteration 0:   log pseudolikelihood = -1391.4433  
Iteration 1:   log pseudolikelihood = -1387.2689  
Iteration 2:   log pseudolikelihood = -1387.2688  

Logistic regression                             Number of obs     =      2,009
                                                Wald chi2(2)      =       3.97
                                                Prob > chi2       =     0.1373
Log pseudolikelihood = -1387.2688               Pseudo R2         =     0.0030

------------------------------------------------------------------------------
             |               Robust
         lib |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.152      0.152    -1.00   0.315       -0.450       0.145
        irl  |      0.171      0.159     1.08   0.281       -0.140       0.482
             |
       _cons |      0.100      0.104     0.95   0.340       -0.105       0.304
------------------------------------------------------------------------------

Adjusted predictions                            Number of obs     =      2,009
Model VCE    : Robust

Expression   : Pr(lib), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.525      0.026    20.15   0.000        0.474       0.576
         ic  |      0.487      0.027    17.73   0.000        0.433       0.541
        irl  |      0.567      0.029    19.35   0.000        0.510       0.625
------------------------------------------------------------------------------

Conditional marginal effects                    Number of obs     =      2,009
Model VCE    : Robust

Expression   : Pr(lib), predict()
dy/dx w.r.t. : 2.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.038      0.038    -1.01   0.315       -0.112       0.036
        irl  |      0.042      0.039     1.08   0.280       -0.034       0.119
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Conditional marginal effects                    Number of obs     =      2,009
Model VCE    : Robust

Expression   : Pr(lib), predict()
dy/dx w.r.t. : 1.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.038      0.038     1.01   0.315       -0.036       0.112
        irl  |      0.080      0.040     2.00   0.045        0.002       0.159
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Iteration 0:   log pseudolikelihood = -1385.7829  
Iteration 1:   log pseudolikelihood = -1367.4214  
Iteration 2:   log pseudolikelihood = -1367.4188  
Iteration 3:   log pseudolikelihood = -1367.4188  

Logistic regression                             Number of obs     =      2,002
                                                Wald chi2(1)      =      18.69
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -1367.4188               Pseudo R2         =     0.0133

------------------------------------------------------------------------------
             |               Robust
         lib |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    partyid7 |     -0.141      0.033    -4.32   0.000       -0.205      -0.077
       _cons |      0.651      0.144     4.51   0.000        0.368       0.933
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,002
Model VCE    : Robust

Expression   : Pr(lib), predict()
dy/dx w.r.t. : partyid7

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    partyid7 |     -0.035      0.008    -4.49   0.000       -0.050      -0.019
------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -1385.7829  
Iteration 1:   log pseudolikelihood = -1358.7639  
Iteration 2:   log pseudolikelihood = -1358.7141  
Iteration 3:   log pseudolikelihood = -1358.7141  

Logistic regression                             Number of obs     =      2,002
                                                Wald chi2(5)      =      27.89
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -1358.7141               Pseudo R2         =     0.0195

----------------------------------------------------------------------------------
                 |               Robust
             lib |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           treat |
             ic  |     -0.329      0.340    -0.97   0.333       -0.995       0.337
            irl  |      0.675      0.339     1.99   0.047        0.010       1.341
                 |
        partyid7 |     -0.112      0.052    -2.17   0.030       -0.214      -0.011
                 |
treat#c.partyid7 |
             ic  |      0.044      0.078     0.56   0.573       -0.108       0.196
            irl  |     -0.130      0.077    -1.68   0.093       -0.281       0.021
                 |
           _cons |      0.540      0.223     2.42   0.015        0.103       0.977
----------------------------------------------------------------------------------

Predictive margins                              Number of obs     =      2,002
Model VCE    : Robust

Expression   : Pr(lib), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.527      0.026    20.20   0.000        0.476       0.578
         ic  |      0.487      0.028    17.65   0.000        0.433       0.541
        irl  |      0.567      0.027    20.80   0.000        0.514       0.621
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,002
Model VCE    : Robust

Expression   : Pr(lib), predict()
dy/dx w.r.t. : 2.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.040      0.038    -1.05   0.295       -0.114       0.035
        irl  |      0.041      0.038     1.07   0.283       -0.033       0.114
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,002
Model VCE    : Robust

Expression   : Pr(lib), predict()
dy/dx w.r.t. : 1.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.040      0.038     1.05   0.295       -0.035       0.114
        irl  |      0.080      0.039     2.07   0.039        0.004       0.156
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,002
Model VCE    : Robust

Expression   : Pr(lib), predict()
dy/dx w.r.t. : partyid7

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    partyid7 |     -0.033      0.007    -4.41   0.000       -0.048      -0.018
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,002
Model VCE    : Robust

Expression   : Pr(lib), predict()
dy/dx w.r.t. : partyid7

1._at        : treat           =           1

2._at        : treat           =           2

3._at        : treat           =           3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
partyid7     |
         _at |
          1  |     -0.028      0.012    -2.22   0.026       -0.052      -0.003
          2  |     -0.017      0.014    -1.19   0.232       -0.045       0.011
          3  |     -0.056      0.012    -4.70   0.000       -0.080      -0.033
------------------------------------------------------------------------------

Conditional marginal effects                    Number of obs     =      2,002
Model VCE    : Robust

Expression   : Pr(lib), predict()
dy/dx w.r.t. : 2.treat 3.treat

1._at        : partyid7        =           1

2._at        : partyid7        =           2

3._at        : partyid7        =           3

4._at        : partyid7        =           4

5._at        : partyid7        =           5

6._at        : partyid7        =           6

7._at        : partyid7        =           7

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1.treat      |  (base outcome)
-------------+----------------------------------------------------------------
2.treat      |
         _at |
          1  |     -0.070      0.067    -1.05   0.296       -0.200       0.061
          2  |     -0.060      0.053    -1.13   0.257       -0.163       0.044
          3  |     -0.049      0.042    -1.17   0.241       -0.131       0.033
          4  |     -0.038      0.038    -1.00   0.317       -0.113       0.037
          5  |     -0.027      0.044    -0.63   0.531       -0.113       0.058
          6  |     -0.016      0.055    -0.29   0.769       -0.125       0.092
          7  |     -0.005      0.070    -0.08   0.939       -0.143       0.132
-------------+----------------------------------------------------------------
3.treat      |
         _at |
          1  |      0.120      0.059     2.03   0.042        0.004       0.237
          2  |      0.097      0.050     1.96   0.051       -0.000       0.194
          3  |      0.069      0.041     1.67   0.095       -0.012       0.151
          4  |      0.039      0.039     0.99   0.324       -0.038       0.115
          5  |      0.006      0.045     0.14   0.885       -0.082       0.094
          6  |     -0.026      0.056    -0.46   0.646       -0.136       0.084
          7  |     -0.057      0.069    -0.82   0.414       -0.192       0.079
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

. 
. outreg2 [*] ///
>   using docs/logit-margins-without-covariates.xls, ///
>   noaster stats(coef se ci pval) bdec(1) sdec(1) cdec(3)  ///
>   stnum(replace coef=coef*100, replace se=se*100) ///
>   paren(se) bracket(ci) ///
>   excel replace
docs/logit-margins-without-covariates.xls
dir : seeout

. 
. log close
      name:  <unnamed>
       log:  /Users/stephenmorgan/GitHub/tess-civil-liberties/log/analyze-experimental-results-without-covariates.l
> og
  log type:  text
 closed on:  16 Mar 2019, 14:46:03
-------------------------------------------------------------------------------------------------------------------
