-------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/stephenmorgan/GitHub/tess-civil-liberties/log/analyze-experimental-results-without-covariates-3
> party.log
  log type:  text
 opened on:  16 Mar 2019, 16:24:26

. 
. use data/tess-civ-lib.dta

. 
. ********************************************************************************
. *** Set up for analysis
. ********************************************************************************
. 
. *** Set macros
. 
. local domain spk col lib 

. 
. *** Create additional regressors
. 
. recode partyid7 1/2 = 1 2/5 = 2 6/7 = 3, gen(partyid3)
(1703 differences between partyid7 and partyid3)

. recode partyid7 1/3 = 1 4 = 2 5/7 = 3, gen(partyid3l)
(1703 differences between partyid7 and partyid3l)

. order partyid7 partyid3 partyid3l, after(treat)

. tab partyid7 partyid3, miss

DATA-ONLY: |
  Computed |
   7-level |
 political |
     party |   RECODE of partyid7 (DATA-ONLY: Computed
identifica |   7-level political party identification)
      tion |         1          2          3          . |     Total
-----------+--------------------------------------------+----------
         1 |       309          0          0          0 |       309 
         2 |       424          0          0          0 |       424 
         3 |         0        220          0          0 |       220 
         4 |         0        338          0          0 |       338 
         5 |         0        191          0          0 |       191 
         6 |         0          0        347          0 |       347 
         7 |         0          0        183          0 |       183 
         . |         0          0          0          7 |         7 
-----------+--------------------------------------------+----------
     Total |       733        749        530          7 |     2,019 

. tab partyid7 partyid3l, miss

DATA-ONLY: |
  Computed |
   7-level |
 political |
     party |   RECODE of partyid7 (DATA-ONLY: Computed
identifica |   7-level political party identification)
      tion |         1          2          3          . |     Total
-----------+--------------------------------------------+----------
         1 |       309          0          0          0 |       309 
         2 |       424          0          0          0 |       424 
         3 |       220          0          0          0 |       220 
         4 |         0        338          0          0 |       338 
         5 |         0          0        191          0 |       191 
         6 |         0          0        347          0 |       347 
         7 |         0          0        183          0 |       183 
         . |         0          0          0          7 |         7 
-----------+--------------------------------------------+----------
     Total |       953        338        721          7 |     2,019 

. 
. ********************************************************************************
. *** Summary of outcomes
. ********************************************************************************
. 
. summ `domain' [aweight = weight]

    Variable |     Obs      Weight        Mean   Std. Dev.       Min        Max
-------------+-----------------------------------------------------------------
         spk |   2,016  2015.95849    .4466732   .4972715          0          1
         col |   2,012   2011.2303    .2497988   .4330041          0          1
         lib |   2,009  2011.16718    .5253773   .4994799          0          1

. corr `domain' [aweight = weight]
(sum of wgt is 2,006.2353708017)
(obs=2,005)

             |      spk      col      lib
-------------+---------------------------
         spk |   1.0000
         col |   0.4948   1.0000
         lib |   0.4078   0.2767   1.0000


. bys treat: corr `domain' [aweight = weight]

-------------------------------------------------------------------------------------------------------------------
-> treat = mc
(sum of wgt is 721.2025177945)
(obs=700)

             |      spk      col      lib
-------------+---------------------------
         spk |   1.0000
         col |   0.4333   1.0000
         lib |   0.3924   0.2744   1.0000


-------------------------------------------------------------------------------------------------------------------
-> treat = ic
(sum of wgt is 665.2614538197)
(obs=656)

             |      spk      col      lib
-------------+---------------------------
         spk |   1.0000
         col |   0.5871   1.0000
         lib |   0.4005   0.2773   1.0000


-------------------------------------------------------------------------------------------------------------------
-> treat = irl
(sum of wgt is 619.7713991875)
(obs=649)

             |      spk      col      lib
-------------+---------------------------
         spk |   1.0000
         col |   0.4702   1.0000
         lib |   0.4327   0.2826   1.0000



. bys partyid3: corr `domain' [aweight = weight]

-------------------------------------------------------------------------------------------------------------------
-> partyid3 = 1
(sum of wgt is 673.5352909395)
(obs=730)

             |      spk      col      lib
-------------+---------------------------
         spk |   1.0000
         col |   0.4307   1.0000
         lib |   0.4276   0.2980   1.0000


-------------------------------------------------------------------------------------------------------------------
-> partyid3 = 2
(sum of wgt is 773.0350914344)
(obs=739)

             |      spk      col      lib
-------------+---------------------------
         spk |   1.0000
         col |   0.5275   1.0000
         lib |   0.3634   0.2834   1.0000


-------------------------------------------------------------------------------------------------------------------
-> partyid3 = 3
(sum of wgt is 551.8284831877)
(obs=529)

             |      spk      col      lib
-------------+---------------------------
         spk |   1.0000
         col |   0.5297   1.0000
         lib |   0.4484   0.2201   1.0000


-------------------------------------------------------------------------------------------------------------------
-> partyid3 = .
(sum of wgt is 7.8365052401)
(obs=7)

             |      spk      col      lib
-------------+---------------------------
         spk |   1.0000
         col |   0.6022   1.0000
         lib |  -0.0632   0.3809   1.0000



. 
. ********************************************************************************
. *** Basic treatment effect analysis
. ********************************************************************************
. 
. *** OLS regression models, with no additional adjustment
. 
. foreach dom in `domain' {
  2. 
. regress `dom' b1.treat b1.partyid3 [pweight=weight]
  3. estimates store `dom'_r4
  4. 
. regress `dom' b1.treat##b1.partyid3 [pweight=weight]
  5. estimates store `dom'_r5
  6. 
. regress `dom' b1.treat b1.partyid3l [pweight=weight]
  7. estimates store `dom'_r6
  8. 
. regress `dom' b1.treat##b1.partyid3l [pweight=weight]
  9. estimates store `dom'_r7
 10. 
. }
(sum of wgt is 2,008.1219889845)

Linear regression                               Number of obs     =      2,009
                                                F(4, 2004)        =       2.34
                                                Prob > F          =     0.0528
                                                R-squared         =     0.0083
                                                Root MSE          =      .4957

------------------------------------------------------------------------------
             |               Robust
         spk |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.082      0.037    -2.18   0.029       -0.155      -0.008
        irl  |     -0.032      0.039    -0.80   0.421       -0.109       0.046
             |
    partyid3 |
          2  |      0.029      0.038     0.77   0.441       -0.046       0.104
          3  |     -0.052      0.040    -1.31   0.191       -0.130       0.026
             |
       _cons |      0.486      0.033    14.55   0.000        0.421       0.552
------------------------------------------------------------------------------
(sum of wgt is 2,008.1219889845)

Linear regression                               Number of obs     =      2,009
                                                F(8, 2000)        =       1.55
                                                Prob > F          =     0.1350
                                                R-squared         =     0.0101
                                                Root MSE          =     .49574

--------------------------------------------------------------------------------
               |               Robust
           spk |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
         treat |
           ic  |     -0.063      0.065    -0.97   0.333       -0.191       0.065
          irl  |      0.011      0.069     0.15   0.879       -0.126       0.147
               |
      partyid3 |
            2  |      0.061      0.062     0.99   0.322       -0.060       0.183
            3  |     -0.025      0.064    -0.39   0.695       -0.150       0.100
               |
treat#partyid3 |
         ic#2  |     -0.014      0.090    -0.16   0.875       -0.191       0.162
         ic#3  |     -0.058      0.092    -0.63   0.531       -0.239       0.123
        irl#2  |     -0.093      0.095    -0.97   0.330       -0.279       0.094
        irl#3  |     -0.031      0.098    -0.32   0.749       -0.224       0.161
               |
         _cons |      0.468      0.042    11.20   0.000        0.386       0.549
--------------------------------------------------------------------------------
(sum of wgt is 2,008.1219889845)

Linear regression                               Number of obs     =      2,009
                                                F(4, 2004)        =       1.92
                                                Prob > F          =     0.1045
                                                R-squared         =     0.0070
                                                Root MSE          =     .49602

------------------------------------------------------------------------------
             |               Robust
         spk |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.075      0.037    -2.02   0.044       -0.149      -0.002
        irl  |     -0.031      0.039    -0.79   0.431       -0.108       0.046
             |
   partyid3l |
          2  |     -0.005      0.045    -0.11   0.909       -0.094       0.084
          3  |     -0.058      0.034    -1.68   0.093       -0.125       0.010
             |
       _cons |      0.504      0.031    16.39   0.000        0.443       0.564
------------------------------------------------------------------------------
(sum of wgt is 2,008.1219889845)

Linear regression                               Number of obs     =      2,009
                                                F(8, 2000)        =       1.48
                                                Prob > F          =     0.1600
                                                R-squared         =     0.0098
                                                Root MSE          =     .49583

---------------------------------------------------------------------------------
                |               Robust
            spk |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
          treat |
            ic  |     -0.040      0.057    -0.70   0.483       -0.151       0.072
           irl  |     -0.001      0.060    -0.02   0.981       -0.118       0.116
                |
      partyid3l |
             2  |      0.012      0.079     0.16   0.876       -0.142       0.167
             3  |     -0.011      0.056    -0.20   0.842       -0.121       0.099
                |
treat#partyid3l |
          ic#2  |      0.007      0.109     0.06   0.950       -0.206       0.220
          ic#3  |     -0.103      0.081    -1.28   0.202       -0.261       0.055
         irl#2  |     -0.076      0.114    -0.67   0.506       -0.299       0.147
         irl#3  |     -0.042      0.086    -0.49   0.621       -0.210       0.125
                |
          _cons |      0.483      0.037    13.11   0.000        0.411       0.556
---------------------------------------------------------------------------------
(sum of wgt is 2,003.3937954824)

Linear regression                               Number of obs     =      2,005
                                                F(4, 2000)        =       4.85
                                                Prob > F          =     0.0007
                                                R-squared         =     0.0160
                                                Root MSE          =     .42899

------------------------------------------------------------------------------
             |               Robust
         col |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.059      0.033    -1.79   0.074       -0.124       0.006
        irl  |     -0.049      0.033    -1.49   0.137       -0.113       0.016
             |
    partyid3 |
          2  |      0.012      0.033     0.35   0.724       -0.054       0.077
          3  |     -0.103      0.033    -3.12   0.002       -0.167      -0.038
             |
       _cons |      0.307      0.031     9.76   0.000        0.245       0.368
------------------------------------------------------------------------------
(sum of wgt is 2,003.3937954824)

Linear regression                               Number of obs     =      2,005
                                                F(8, 1996)        =       2.91
                                                Prob > F          =     0.0031
                                                R-squared         =     0.0192
                                                Root MSE          =     .42873

--------------------------------------------------------------------------------
               |               Robust
           col |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
         treat |
           ic  |     -0.109      0.062    -1.76   0.078       -0.229       0.012
          irl  |     -0.099      0.058    -1.72   0.086       -0.212       0.014
               |
      partyid3 |
            2  |     -0.019      0.059    -0.33   0.744       -0.135       0.097
            3  |     -0.170      0.057    -2.99   0.003       -0.282      -0.059
               |
treat#partyid3 |
         ic#2  |      0.064      0.083     0.77   0.443       -0.099       0.226
         ic#3  |      0.084      0.079     1.06   0.288       -0.071       0.240
        irl#2  |      0.032      0.080     0.40   0.687       -0.125       0.189
        irl#3  |      0.132      0.080     1.65   0.100       -0.025       0.289
               |
         _cons |      0.337      0.042     7.97   0.000        0.254       0.420
--------------------------------------------------------------------------------
(sum of wgt is 2,003.3937954824)

Linear regression                               Number of obs     =      2,005
                                                F(4, 2000)        =       4.75
                                                Prob > F          =     0.0008
                                                R-squared         =     0.0172
                                                Root MSE          =     .42873

------------------------------------------------------------------------------
             |               Robust
         col |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.054      0.033    -1.63   0.103       -0.118       0.011
        irl  |     -0.049      0.033    -1.47   0.140       -0.114       0.016
             |
   partyid3l |
          2  |      0.022      0.040     0.54   0.591       -0.057       0.100
          3  |     -0.098      0.029    -3.41   0.001       -0.154      -0.041
             |
       _cons |      0.313      0.029    10.87   0.000        0.256       0.369
------------------------------------------------------------------------------
(sum of wgt is 2,003.3937954824)

Linear regression                               Number of obs     =      2,005
                                                F(8, 1996)        =       3.09
                                                Prob > F          =     0.0018
                                                R-squared         =     0.0225
                                                Root MSE          =       .428

---------------------------------------------------------------------------------
                |               Robust
            col |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
          treat |
            ic  |     -0.087      0.052    -1.66   0.096       -0.190       0.016
           irl  |     -0.090      0.050    -1.80   0.072       -0.188       0.008
                |
      partyid3l |
             2  |      0.011      0.073     0.16   0.875       -0.131       0.154
             3  |     -0.156      0.051    -3.10   0.002       -0.255      -0.057
                |
treat#partyid3l |
          ic#2  |      0.056      0.101     0.56   0.576       -0.141       0.254
          ic#3  |      0.057      0.069     0.83   0.406       -0.078       0.193
         irl#2  |     -0.036      0.095    -0.38   0.705       -0.222       0.150
         irl#3  |      0.129      0.071     1.81   0.070       -0.011       0.269
                |
          _cons |      0.336      0.037     9.15   0.000        0.264       0.408
---------------------------------------------------------------------------------
(sum of wgt is 2,003.3306699975)

Linear regression                               Number of obs     =      2,002
                                                F(4, 1997)        =       4.31
                                                Prob > F          =     0.0018
                                                R-squared         =     0.0161
                                                Root MSE          =     .49589

------------------------------------------------------------------------------
             |               Robust
         lib |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.043      0.038    -1.13   0.258       -0.118       0.032
        irl  |      0.042      0.039     1.10   0.272       -0.033       0.118
             |
    partyid3 |
          2  |     -0.046      0.038    -1.20   0.230       -0.120       0.029
          3  |     -0.137      0.039    -3.47   0.001       -0.214      -0.059
             |
       _cons |      0.583      0.033    17.59   0.000        0.518       0.648
------------------------------------------------------------------------------
(sum of wgt is 2,003.3306699975)

Linear regression                               Number of obs     =      2,002
                                                F(8, 1993)        =       2.93
                                                Prob > F          =     0.0029
                                                R-squared         =     0.0212
                                                Root MSE          =     .49509

--------------------------------------------------------------------------------
               |               Robust
           lib |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
         treat |
           ic  |     -0.060      0.066    -0.90   0.366       -0.189       0.070
          irl  |      0.128      0.061     2.08   0.038        0.007       0.248
               |
      partyid3 |
            2  |      0.004      0.062     0.06   0.950       -0.119       0.126
            3  |     -0.119      0.064    -1.87   0.062       -0.244       0.006
               |
treat#partyid3 |
         ic#2  |     -0.017      0.091    -0.18   0.855       -0.196       0.162
         ic#3  |      0.080      0.096     0.83   0.404       -0.108       0.268
        irl#2  |     -0.135      0.091    -1.48   0.139       -0.313       0.044
        irl#3  |     -0.128      0.093    -1.38   0.167       -0.310       0.053
               |
         _cons |      0.561      0.042    13.41   0.000        0.479       0.643
--------------------------------------------------------------------------------
(sum of wgt is 2,003.3306699975)

Linear regression                               Number of obs     =      2,002
                                                F(4, 1997)        =       5.85
                                                Prob > F          =     0.0001
                                                R-squared         =     0.0217
                                                Root MSE          =     .49448

------------------------------------------------------------------------------
             |               Robust
         lib |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.036      0.038    -0.96   0.340       -0.111       0.038
        irl  |      0.042      0.038     1.11   0.267       -0.032       0.117
             |
   partyid3l |
          2  |     -0.106      0.045    -2.34   0.019       -0.196      -0.017
          3  |     -0.142      0.034    -4.16   0.000       -0.209      -0.075
             |
       _cons |      0.599      0.030    19.85   0.000        0.540       0.659
------------------------------------------------------------------------------
(sum of wgt is 2,003.3306699975)

Linear regression                               Number of obs     =      2,002
                                                F(8, 1993)        =       3.30
                                                Prob > F          =     0.0010
                                                R-squared         =     0.0239
                                                Root MSE          =     .49441

---------------------------------------------------------------------------------
                |               Robust
            lib |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
          treat |
            ic  |     -0.067      0.057    -1.18   0.240       -0.179       0.045
           irl  |      0.075      0.054     1.40   0.162       -0.030       0.181
                |
      partyid3l |
             2  |     -0.112      0.079    -1.42   0.157       -0.266       0.043
             3  |     -0.137      0.056    -2.46   0.014       -0.246      -0.028
                |
treat#partyid3l |
          ic#2  |      0.044      0.109     0.40   0.689       -0.170       0.258
          ic#3  |      0.056      0.083     0.68   0.498       -0.106       0.219
         irl#2  |     -0.028      0.114    -0.25   0.804       -0.252       0.195
         irl#3  |     -0.075      0.082    -0.91   0.362       -0.235       0.086
                |
          _cons |      0.598      0.036    16.56   0.000        0.527       0.669
---------------------------------------------------------------------------------

. 
. estimates dir

-------------------------------------------------------
        name | command      depvar       npar  title 
-------------+-----------------------------------------
      spk_r4 | regress      spk             7  
      spk_r5 | regress      spk            16  
      spk_r6 | regress      spk             7  
      spk_r7 | regress      spk            16  
      col_r4 | regress      col             7  
      col_r5 | regress      col            16  
      col_r6 | regress      col             7  
      col_r7 | regress      col            16  
      lib_r4 | regress      lib             7  
      lib_r5 | regress      lib            16  
      lib_r6 | regress      lib             7  
      lib_r7 | regress      lib            16  
-------------------------------------------------------

. 
. outreg2 [*] ///
>   using docs/ols-estimates-without-covariates-3party.xls, ///
>   noaster stats(coef se ci pval)  dec(3)  ///
>   paren(se) bracket(ci) ///
>   excel replace
docs/ols-estimates-without-covariates-3party.xls
dir : seeout

.   
. estimates clear

. 
. foreach dom in `domain' {
  2. 
. regress `dom' b1.partyid3 [pweight=weight]
  3.   margins, dydx(b1.partyid3) post
  4.   estimates store `dom'_r2
  5.   
. regress `dom' b1.treat##b1.partyid3 [pweight=weight]
  6.   margins b1.treat, post
  7.   estimates store `dom'_r3
  8.     quietly regress `dom' b1.treat##b1.partyid3 [pweight=weight]
  9.     margins, dydx(b1.treat) post
 10.     estimates store `dom'_r3d1
 11.     quietly regress `dom' b2.treat##b1.partyid3 [pweight=weight]
 12.     margins, dydx(b2.treat) post
 13.     estimates store `dom'_r3d2
 14.   quietly regress `dom' b1.treat##b1.partyid3 [pweight=weight]
 15.     margins, dydx(b1.partyid3) post
 16.     estimates store `dom'_r4
 17.   quietly regress `dom' b1.treat##b1.partyid3 [pweight=weight]
 18.     margins, dydx(b1.partyid3) at(treat = (1(1)3)) post
 19.     estimates store `dom'_r5
 20.   quietly regress `dom' b1.treat##b1.partyid3 [pweight=weight] 
 21.     margins, dydx(b1.treat) at(partyid3 = (1(1)3)) post
 22.     estimates store `dom'_r6
 23. 
. regress `dom' b1.partyid3l [pweight=weight]
 24.   margins, dydx(b1.partyid3l) post
 25.   estimates store `dom'_r2l
 26. 
. regress `dom' b1.treat##b1.partyid3l [pweight=weight]
 27.   margins b1.treat, post
 28.   estimates store `dom'_r3l
 29.     quietly regress `dom' b1.treat##b1.partyid3l [pweight=weight]
 30.     margins, dydx(b1.treat) post
 31.     estimates store `dom'_r3ld1
 32.     quietly regress `dom' b2.treat##b1.partyid3l [pweight=weight]
 33.     margins, dydx(b2.treat) post
 34.     estimates store `dom'_r3ld2
 35.   quietly regress `dom' b1.treat##b1.partyid3l [pweight=weight]
 36.     margins, dydx(b1.partyid3l) post
 37.     estimates store `dom'_r4l
 38.   quietly regress `dom' b1.treat##b1.partyid3l [pweight=weight]
 39.     margins, dydx(b1.partyid3l) at(treat = (1(1)3)) post
 40.     estimates store `dom'_r5l
 41.   quietly regress `dom' b1.treat##b1.partyid3l [pweight=weight] 
 42.     margins, dydx(b1.treat) at(partyid3l = (1(1)3)) post
 43.     estimates store `dom'_r6l
 44. 
. }
(sum of wgt is 2,008.1219889845)

Linear regression                               Number of obs     =      2,009
                                                F(2, 2006)        =       1.96
                                                Prob > F          =     0.1412
                                                R-squared         =     0.0037
                                                Root MSE          =     .49661

------------------------------------------------------------------------------
             |               Robust
         spk |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    partyid3 |
          2  |      0.023      0.038     0.60   0.548       -0.052       0.098
          3  |     -0.052      0.040    -1.30   0.193       -0.130       0.026
             |
       _cons |      0.452      0.028    16.13   0.000        0.397       0.507
------------------------------------------------------------------------------

Conditional marginal effects                    Number of obs     =      2,009
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.partyid3 3.partyid3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    partyid3 |
          2  |      0.023      0.038     0.60   0.548       -0.052       0.098
          3  |     -0.052      0.040    -1.30   0.193       -0.130       0.026
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.
(sum of wgt is 2,008.1219889845)

Linear regression                               Number of obs     =      2,009
                                                F(8, 2000)        =       1.55
                                                Prob > F          =     0.1350
                                                R-squared         =     0.0101
                                                Root MSE          =     .49574

--------------------------------------------------------------------------------
               |               Robust
           spk |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
         treat |
           ic  |     -0.063      0.065    -0.97   0.333       -0.191       0.065
          irl  |      0.011      0.069     0.15   0.879       -0.126       0.147
               |
      partyid3 |
            2  |      0.061      0.062     0.99   0.322       -0.060       0.183
            3  |     -0.025      0.064    -0.39   0.695       -0.150       0.100
               |
treat#partyid3 |
         ic#2  |     -0.014      0.090    -0.16   0.875       -0.191       0.162
         ic#3  |     -0.058      0.092    -0.63   0.531       -0.239       0.123
        irl#2  |     -0.093      0.095    -0.97   0.330       -0.279       0.094
        irl#3  |     -0.031      0.098    -0.32   0.749       -0.224       0.161
               |
         _cons |      0.468      0.042    11.20   0.000        0.386       0.549
--------------------------------------------------------------------------------

Predictive margins                              Number of obs     =      2,009
Model VCE    : Robust

Expression   : Linear prediction, predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.484      0.026    18.49   0.000        0.433       0.536
         ic  |      0.400      0.027    15.08   0.000        0.348       0.452
        irl  |      0.450      0.029    15.32   0.000        0.393       0.508
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,009
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.085      0.037    -2.27   0.023       -0.158      -0.011
        irl  |     -0.034      0.039    -0.86   0.388       -0.111       0.043
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,009
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 1.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.085      0.037     2.27   0.023        0.011       0.158
        irl  |      0.051      0.040     1.28   0.202       -0.027       0.128
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,009
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.partyid3 3.partyid3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    partyid3 |
          2  |      0.028      0.038     0.73   0.465       -0.047       0.103
          3  |     -0.054      0.039    -1.37   0.172       -0.131       0.023
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Conditional marginal effects                    Number of obs     =      2,009
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.partyid3 3.partyid3

1._at        : treat           =           1

2._at        : treat           =           2

3._at        : treat           =           3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1.partyid3   |  (base outcome)
-------------+----------------------------------------------------------------
2.partyid3   |
         _at |
          1  |      0.061      0.062     0.99   0.322       -0.060       0.183
          2  |      0.047      0.065     0.72   0.472       -0.081       0.175
          3  |     -0.031      0.072    -0.44   0.663       -0.173       0.110
-------------+----------------------------------------------------------------
3.partyid3   |
         _at |
          1  |     -0.025      0.064    -0.39   0.695       -0.150       0.100
          2  |     -0.083      0.067    -1.23   0.217       -0.215       0.049
          3  |     -0.056      0.075    -0.75   0.452       -0.203       0.091
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Conditional marginal effects                    Number of obs     =      2,009
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.treat 3.treat

1._at        : partyid3        =           1

2._at        : partyid3        =           2

3._at        : partyid3        =           3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1.treat      |  (base outcome)
-------------+----------------------------------------------------------------
2.treat      |
         _at |
          1  |     -0.063      0.065    -0.97   0.333       -0.191       0.065
          2  |     -0.077      0.062    -1.24   0.214       -0.199       0.045
          3  |     -0.121      0.066    -1.84   0.065       -0.250       0.008
-------------+----------------------------------------------------------------
3.treat      |
         _at |
          1  |      0.011      0.069     0.15   0.879       -0.126       0.147
          2  |     -0.082      0.065    -1.26   0.206       -0.210       0.045
          3  |     -0.021      0.070    -0.30   0.764       -0.157       0.115
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.
(sum of wgt is 2,008.1219889845)

Linear regression                               Number of obs     =      2,009
                                                F(2, 2006)        =       1.59
                                                Prob > F          =     0.2035
                                                R-squared         =     0.0030
                                                Root MSE          =     .49677

------------------------------------------------------------------------------
             |               Robust
         spk |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   partyid3l |
          2  |     -0.009      0.045    -0.21   0.834       -0.098       0.079
          3  |     -0.059      0.034    -1.72   0.085       -0.127       0.008
             |
       _cons |      0.471      0.024    19.43   0.000        0.423       0.518
------------------------------------------------------------------------------

Conditional marginal effects                    Number of obs     =      2,009
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.partyid3l 3.partyid3l

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   partyid3l |
          2  |     -0.009      0.045    -0.21   0.834       -0.098       0.079
          3  |     -0.059      0.034    -1.72   0.085       -0.127       0.008
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.
(sum of wgt is 2,008.1219889845)

Linear regression                               Number of obs     =      2,009
                                                F(8, 2000)        =       1.48
                                                Prob > F          =     0.1600
                                                R-squared         =     0.0098
                                                Root MSE          =     .49583

---------------------------------------------------------------------------------
                |               Robust
            spk |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
          treat |
            ic  |     -0.040      0.057    -0.70   0.483       -0.151       0.072
           irl  |     -0.001      0.060    -0.02   0.981       -0.118       0.116
                |
      partyid3l |
             2  |      0.012      0.079     0.16   0.876       -0.142       0.167
             3  |     -0.011      0.056    -0.20   0.842       -0.121       0.099
                |
treat#partyid3l |
          ic#2  |      0.007      0.109     0.06   0.950       -0.206       0.220
          ic#3  |     -0.103      0.081    -1.28   0.202       -0.261       0.055
         irl#2  |     -0.076      0.114    -0.67   0.506       -0.299       0.147
         irl#3  |     -0.042      0.086    -0.49   0.621       -0.210       0.125
                |
          _cons |      0.483      0.037    13.11   0.000        0.411       0.556
---------------------------------------------------------------------------------

Predictive margins                              Number of obs     =      2,009
Model VCE    : Robust

Expression   : Linear prediction, predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.482      0.026    18.36   0.000        0.430       0.533
         ic  |      0.405      0.026    15.31   0.000        0.353       0.457
        irl  |      0.449      0.029    15.32   0.000        0.392       0.507
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,009
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.076      0.037    -2.05   0.040       -0.150      -0.003
        irl  |     -0.032      0.039    -0.82   0.413       -0.109       0.045
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,009
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 1.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.076      0.037     2.05   0.040        0.003       0.150
        irl  |      0.044      0.040     1.12   0.263       -0.033       0.122
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,009
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.partyid3l 3.partyid3l

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   partyid3l |
          2  |     -0.009      0.045    -0.19   0.846       -0.098       0.080
          3  |     -0.058      0.034    -1.70   0.089       -0.126       0.009
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Conditional marginal effects                    Number of obs     =      2,009
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.partyid3l 3.partyid3l

1._at        : treat           =           1

2._at        : treat           =           2

3._at        : treat           =           3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1.partyid3l  |  (base outcome)
-------------+----------------------------------------------------------------
2.partyid3l  |
         _at |
          1  |      0.012      0.079     0.16   0.876       -0.142       0.167
          2  |      0.019      0.075     0.25   0.799       -0.128       0.166
          3  |     -0.063      0.082    -0.77   0.440       -0.224       0.098
-------------+----------------------------------------------------------------
3.partyid3l  |
         _at |
          1  |     -0.011      0.056    -0.20   0.842       -0.121       0.099
          2  |     -0.114      0.058    -1.96   0.050       -0.228      -0.000
          3  |     -0.054      0.065    -0.83   0.408       -0.180       0.073
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Conditional marginal effects                    Number of obs     =      2,009
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.treat 3.treat

1._at        : partyid3l       =           1

2._at        : partyid3l       =           2

3._at        : partyid3l       =           3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1.treat      |  (base outcome)
-------------+----------------------------------------------------------------
2.treat      |
         _at |
          1  |     -0.040      0.057    -0.70   0.483       -0.151       0.072
          2  |     -0.033      0.093    -0.36   0.722       -0.215       0.149
          3  |     -0.143      0.057    -2.49   0.013       -0.255      -0.030
-------------+----------------------------------------------------------------
3.treat      |
         _at |
          1  |     -0.001      0.060    -0.02   0.981       -0.118       0.116
          2  |     -0.077      0.097    -0.80   0.426       -0.267       0.113
          3  |     -0.044      0.061    -0.71   0.476       -0.164       0.077
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.
(sum of wgt is 2,003.3937954824)

Linear regression                               Number of obs     =      2,005
                                                F(2, 2002)        =       7.62
                                                Prob > F          =     0.0005
                                                R-squared         =     0.0123
                                                Root MSE          =     .42958

------------------------------------------------------------------------------
             |               Robust
         col |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    partyid3 |
          2  |      0.008      0.033     0.24   0.814       -0.058       0.074
          3  |     -0.103      0.033    -3.10   0.002       -0.168      -0.038
             |
       _cons |      0.273      0.025    10.98   0.000        0.225       0.322
------------------------------------------------------------------------------

Conditional marginal effects                    Number of obs     =      2,005
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.partyid3 3.partyid3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    partyid3 |
          2  |      0.008      0.033     0.24   0.814       -0.058       0.074
          3  |     -0.103      0.033    -3.10   0.002       -0.168      -0.038
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.
(sum of wgt is 2,003.3937954824)

Linear regression                               Number of obs     =      2,005
                                                F(8, 1996)        =       2.91
                                                Prob > F          =     0.0031
                                                R-squared         =     0.0192
                                                Root MSE          =     .42873

--------------------------------------------------------------------------------
               |               Robust
           col |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
         treat |
           ic  |     -0.109      0.062    -1.76   0.078       -0.229       0.012
          irl  |     -0.099      0.058    -1.72   0.086       -0.212       0.014
               |
      partyid3 |
            2  |     -0.019      0.059    -0.33   0.744       -0.135       0.097
            3  |     -0.170      0.057    -2.99   0.003       -0.282      -0.059
               |
treat#partyid3 |
         ic#2  |      0.064      0.083     0.77   0.443       -0.099       0.226
         ic#3  |      0.084      0.079     1.06   0.288       -0.071       0.240
        irl#2  |      0.032      0.080     0.40   0.687       -0.125       0.189
        irl#3  |      0.132      0.080     1.65   0.100       -0.025       0.289
               |
         _cons |      0.337      0.042     7.97   0.000        0.254       0.420
--------------------------------------------------------------------------------

Predictive margins                              Number of obs     =      2,005
Model VCE    : Robust

Expression   : Linear prediction, predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.283      0.024    11.85   0.000        0.236       0.330
         ic  |      0.222      0.023     9.80   0.000        0.178       0.267
        irl  |      0.233      0.023    10.34   0.000        0.189       0.277
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,005
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.061      0.033    -1.84   0.065       -0.125       0.004
        irl  |     -0.050      0.033    -1.52   0.128       -0.114       0.014
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,005
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 1.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.061      0.033     1.84   0.065       -0.004       0.125
        irl  |      0.011      0.032     0.34   0.736       -0.052       0.073
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,005
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.partyid3 3.partyid3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    partyid3 |
          2  |      0.012      0.033     0.35   0.724       -0.053       0.077
          3  |     -0.102      0.033    -3.13   0.002       -0.165      -0.038
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Conditional marginal effects                    Number of obs     =      2,005
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.partyid3 3.partyid3

1._at        : treat           =           1

2._at        : treat           =           2

3._at        : treat           =           3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1.partyid3   |  (base outcome)
-------------+----------------------------------------------------------------
2.partyid3   |
         _at |
          1  |     -0.019      0.059    -0.33   0.744       -0.135       0.097
          2  |      0.044      0.058     0.76   0.447       -0.070       0.158
          3  |      0.013      0.054     0.24   0.811       -0.093       0.119
-------------+----------------------------------------------------------------
3.partyid3   |
         _at |
          1  |     -0.170      0.057    -2.99   0.003       -0.282      -0.059
          2  |     -0.086      0.055    -1.56   0.119       -0.194       0.022
          3  |     -0.038      0.056    -0.68   0.497       -0.149       0.072
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Conditional marginal effects                    Number of obs     =      2,005
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.treat 3.treat

1._at        : partyid3        =           1

2._at        : partyid3        =           2

3._at        : partyid3        =           3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1.treat      |  (base outcome)
-------------+----------------------------------------------------------------
2.treat      |
         _at |
          1  |     -0.109      0.062    -1.76   0.078       -0.229       0.012
          2  |     -0.045      0.055    -0.81   0.418       -0.154       0.064
          3  |     -0.024      0.050    -0.49   0.628       -0.122       0.074
-------------+----------------------------------------------------------------
3.treat      |
         _at |
          1  |     -0.099      0.058    -1.72   0.086       -0.212       0.014
          2  |     -0.067      0.056    -1.20   0.231       -0.176       0.042
          3  |      0.033      0.056     0.60   0.551       -0.076       0.143
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.
(sum of wgt is 2,003.3937954824)

Linear regression                               Number of obs     =      2,005
                                                F(2, 2002)        =       7.78
                                                Prob > F          =     0.0004
                                                R-squared         =     0.0140
                                                Root MSE          =     .42923

------------------------------------------------------------------------------
             |               Robust
         col |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   partyid3l |
          2  |      0.019      0.040     0.48   0.631       -0.059       0.098
          3  |     -0.099      0.029    -3.42   0.001       -0.155      -0.042
             |
       _cons |      0.281      0.021    13.20   0.000        0.239       0.322
------------------------------------------------------------------------------

Conditional marginal effects                    Number of obs     =      2,005
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.partyid3l 3.partyid3l

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   partyid3l |
          2  |      0.019      0.040     0.48   0.631       -0.059       0.098
          3  |     -0.099      0.029    -3.42   0.001       -0.155      -0.042
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.
(sum of wgt is 2,003.3937954824)

Linear regression                               Number of obs     =      2,005
                                                F(8, 1996)        =       3.09
                                                Prob > F          =     0.0018
                                                R-squared         =     0.0225
                                                Root MSE          =       .428

---------------------------------------------------------------------------------
                |               Robust
            col |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
          treat |
            ic  |     -0.087      0.052    -1.66   0.096       -0.190       0.016
           irl  |     -0.090      0.050    -1.80   0.072       -0.188       0.008
                |
      partyid3l |
             2  |      0.011      0.073     0.16   0.875       -0.131       0.154
             3  |     -0.156      0.051    -3.10   0.002       -0.255      -0.057
                |
treat#partyid3l |
          ic#2  |      0.056      0.101     0.56   0.576       -0.141       0.254
          ic#3  |      0.057      0.069     0.83   0.406       -0.078       0.193
         irl#2  |     -0.036      0.095    -0.38   0.705       -0.222       0.150
         irl#3  |      0.129      0.071     1.81   0.070       -0.011       0.269
                |
          _cons |      0.336      0.037     9.15   0.000        0.264       0.408
---------------------------------------------------------------------------------

Predictive margins                              Number of obs     =      2,005
Model VCE    : Robust

Expression   : Linear prediction, predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.281      0.024    11.74   0.000        0.234       0.328
         ic  |      0.226      0.022    10.05   0.000        0.182       0.270
        irl  |      0.232      0.022    10.30   0.000        0.187       0.276
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,005
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.055      0.033    -1.67   0.095       -0.119       0.010
        irl  |     -0.049      0.033    -1.50   0.134       -0.114       0.015
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,005
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 1.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.055      0.033     1.67   0.095       -0.010       0.119
        irl  |      0.006      0.032     0.17   0.861       -0.057       0.068
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,005
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.partyid3l 3.partyid3l

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   partyid3l |
          2  |      0.019      0.040     0.48   0.630       -0.059       0.097
          3  |     -0.097      0.029    -3.41   0.001       -0.153      -0.041
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Conditional marginal effects                    Number of obs     =      2,005
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.partyid3l 3.partyid3l

1._at        : treat           =           1

2._at        : treat           =           2

3._at        : treat           =           3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1.partyid3l  |  (base outcome)
-------------+----------------------------------------------------------------
2.partyid3l  |
         _at |
          1  |      0.011      0.073     0.16   0.875       -0.131       0.154
          2  |      0.068      0.070     0.97   0.330       -0.069       0.204
          3  |     -0.024      0.061    -0.40   0.688       -0.144       0.095
-------------+----------------------------------------------------------------
3.partyid3l  |
         _at |
          1  |     -0.156      0.051    -3.10   0.002       -0.255      -0.057
          2  |     -0.099      0.047    -2.11   0.035       -0.191      -0.007
          3  |     -0.027      0.050    -0.54   0.592       -0.126       0.072
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Conditional marginal effects                    Number of obs     =      2,005
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.treat 3.treat

1._at        : partyid3l       =           1

2._at        : partyid3l       =           2

3._at        : partyid3l       =           3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1.treat      |  (base outcome)
-------------+----------------------------------------------------------------
2.treat      |
         _at |
          1  |     -0.087      0.052    -1.66   0.096       -0.190       0.016
          2  |     -0.031      0.086    -0.36   0.718       -0.199       0.137
          3  |     -0.030      0.045    -0.67   0.504       -0.118       0.058
-------------+----------------------------------------------------------------
3.treat      |
         _at |
          1  |     -0.090      0.050    -1.80   0.072       -0.188       0.008
          2  |     -0.126      0.080    -1.56   0.118       -0.284       0.032
          3  |      0.039      0.051     0.77   0.440       -0.061       0.140
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.
(sum of wgt is 2,003.3306699975)

Linear regression                               Number of obs     =      2,002
                                                F(2, 1999)        =       5.98
                                                Prob > F          =     0.0026
                                                R-squared         =     0.0114
                                                Root MSE          =     .49682

------------------------------------------------------------------------------
             |               Robust
         lib |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    partyid3 |
          2  |     -0.051      0.038    -1.33   0.183       -0.126       0.024
          3  |     -0.136      0.040    -3.43   0.001       -0.214      -0.058
             |
       _cons |      0.584      0.028    21.14   0.000        0.530       0.638
------------------------------------------------------------------------------

Conditional marginal effects                    Number of obs     =      2,002
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.partyid3 3.partyid3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    partyid3 |
          2  |     -0.051      0.038    -1.33   0.183       -0.126       0.024
          3  |     -0.136      0.040    -3.43   0.001       -0.214      -0.058
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.
(sum of wgt is 2,003.3306699975)

Linear regression                               Number of obs     =      2,002
                                                F(8, 1993)        =       2.93
                                                Prob > F          =     0.0029
                                                R-squared         =     0.0212
                                                Root MSE          =     .49509

--------------------------------------------------------------------------------
               |               Robust
           lib |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
         treat |
           ic  |     -0.060      0.066    -0.90   0.366       -0.189       0.070
          irl  |      0.128      0.061     2.08   0.038        0.007       0.248
               |
      partyid3 |
            2  |      0.004      0.062     0.06   0.950       -0.119       0.126
            3  |     -0.119      0.064    -1.87   0.062       -0.244       0.006
               |
treat#partyid3 |
         ic#2  |     -0.017      0.091    -0.18   0.855       -0.196       0.162
         ic#3  |      0.080      0.096     0.83   0.404       -0.108       0.268
        irl#2  |     -0.135      0.091    -1.48   0.139       -0.313       0.044
        irl#3  |     -0.128      0.093    -1.38   0.167       -0.310       0.053
               |
         _cons |      0.561      0.042    13.41   0.000        0.479       0.643
--------------------------------------------------------------------------------

Predictive margins                              Number of obs     =      2,002
Model VCE    : Robust

Expression   : Linear prediction, predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.529      0.026    20.07   0.000        0.478       0.581
         ic  |      0.485      0.028    17.59   0.000        0.431       0.539
        irl  |      0.570      0.028    20.48   0.000        0.515       0.624
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,002
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.044      0.038    -1.16   0.248       -0.119       0.031
        irl  |      0.040      0.038     1.05   0.294       -0.035       0.115
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,002
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 1.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.044      0.038     1.16   0.248       -0.031       0.119
        irl  |      0.084      0.039     2.15   0.031        0.008       0.161
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,002
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.partyid3 3.partyid3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    partyid3 |
          2  |     -0.043      0.038    -1.15   0.249       -0.117       0.030
          3  |     -0.132      0.039    -3.39   0.001       -0.209      -0.056
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Conditional marginal effects                    Number of obs     =      2,002
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.partyid3 3.partyid3

1._at        : treat           =           1

2._at        : treat           =           2

3._at        : treat           =           3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1.partyid3   |  (base outcome)
-------------+----------------------------------------------------------------
2.partyid3   |
         _at |
          1  |      0.004      0.062     0.06   0.950       -0.119       0.126
          2  |     -0.013      0.067    -0.19   0.848       -0.143       0.118
          3  |     -0.131      0.066    -1.98   0.048       -0.261      -0.001
-------------+----------------------------------------------------------------
3.partyid3   |
         _at |
          1  |     -0.119      0.064    -1.87   0.062       -0.244       0.006
          2  |     -0.039      0.072    -0.54   0.588       -0.180       0.102
          3  |     -0.247      0.067    -3.68   0.000       -0.379      -0.115
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Conditional marginal effects                    Number of obs     =      2,002
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.treat 3.treat

1._at        : partyid3        =           1

2._at        : partyid3        =           2

3._at        : partyid3        =           3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1.treat      |  (base outcome)
-------------+----------------------------------------------------------------
2.treat      |
         _at |
          1  |     -0.060      0.066    -0.90   0.366       -0.189       0.070
          2  |     -0.076      0.063    -1.21   0.225       -0.200       0.047
          3  |      0.020      0.070     0.29   0.770       -0.116       0.157
-------------+----------------------------------------------------------------
3.treat      |
         _at |
          1  |      0.128      0.061     2.08   0.038        0.007       0.248
          2  |     -0.007      0.067    -0.11   0.916       -0.139       0.125
          3  |     -0.000      0.069    -0.01   0.996       -0.136       0.136
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.
(sum of wgt is 2,003.3306699975)

Linear regression                               Number of obs     =      2,002
                                                F(2, 1999)        =       9.23
                                                Prob > F          =     0.0001
                                                R-squared         =     0.0177
                                                Root MSE          =     .49523

------------------------------------------------------------------------------
             |               Robust
         lib |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   partyid3l |
          2  |     -0.110      0.045    -2.44   0.015       -0.199      -0.022
          3  |     -0.144      0.034    -4.18   0.000       -0.211      -0.076
             |
       _cons |      0.602      0.024    25.44   0.000        0.555       0.648
------------------------------------------------------------------------------

Conditional marginal effects                    Number of obs     =      2,002
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.partyid3l 3.partyid3l

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   partyid3l |
          2  |     -0.110      0.045    -2.44   0.015       -0.199      -0.022
          3  |     -0.144      0.034    -4.18   0.000       -0.211      -0.076
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.
(sum of wgt is 2,003.3306699975)

Linear regression                               Number of obs     =      2,002
                                                F(8, 1993)        =       3.30
                                                Prob > F          =     0.0010
                                                R-squared         =     0.0239
                                                Root MSE          =     .49441

---------------------------------------------------------------------------------
                |               Robust
            lib |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
          treat |
            ic  |     -0.067      0.057    -1.18   0.240       -0.179       0.045
           irl  |      0.075      0.054     1.40   0.162       -0.030       0.181
                |
      partyid3l |
             2  |     -0.112      0.079    -1.42   0.157       -0.266       0.043
             3  |     -0.137      0.056    -2.46   0.014       -0.246      -0.028
                |
treat#partyid3l |
          ic#2  |      0.044      0.109     0.40   0.689       -0.170       0.258
          ic#3  |      0.056      0.083     0.68   0.498       -0.106       0.219
         irl#2  |     -0.028      0.114    -0.25   0.804       -0.252       0.195
         irl#3  |     -0.075      0.082    -0.91   0.362       -0.235       0.086
                |
          _cons |      0.598      0.036    16.56   0.000        0.527       0.669
---------------------------------------------------------------------------------

Predictive margins                              Number of obs     =      2,002
Model VCE    : Robust

Expression   : Linear prediction, predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.525      0.026    20.12   0.000        0.474       0.577
         ic  |      0.488      0.028    17.68   0.000        0.434       0.542
        irl  |      0.568      0.028    20.35   0.000        0.513       0.622
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,002
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.037      0.038    -0.99   0.324       -0.112       0.037
        irl  |      0.042      0.038     1.10   0.270       -0.033       0.117
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,002
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 1.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.037      0.038     0.99   0.324       -0.037       0.112
        irl  |      0.080      0.039     2.03   0.042        0.003       0.157
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,002
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.partyid3l 3.partyid3l

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   partyid3l |
          2  |     -0.106      0.046    -2.33   0.020       -0.195      -0.017
          3  |     -0.141      0.034    -4.15   0.000       -0.208      -0.074
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Conditional marginal effects                    Number of obs     =      2,002
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.partyid3l 3.partyid3l

1._at        : treat           =           1

2._at        : treat           =           2

3._at        : treat           =           3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1.partyid3l  |  (base outcome)
-------------+----------------------------------------------------------------
2.partyid3l  |
         _at |
          1  |     -0.112      0.079    -1.42   0.157       -0.266       0.043
          2  |     -0.068      0.075    -0.90   0.368       -0.216       0.080
          3  |     -0.140      0.082    -1.70   0.089       -0.301       0.021
-------------+----------------------------------------------------------------
3.partyid3l  |
         _at |
          1  |     -0.137      0.056    -2.46   0.014       -0.246      -0.028
          2  |     -0.081      0.062    -1.31   0.190       -0.201       0.040
          3  |     -0.211      0.060    -3.52   0.000       -0.329      -0.094
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Conditional marginal effects                    Number of obs     =      2,002
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 2.treat 3.treat

1._at        : partyid3l       =           1

2._at        : partyid3l       =           2

3._at        : partyid3l       =           3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1.treat      |  (base outcome)
-------------+----------------------------------------------------------------
2.treat      |
         _at |
          1  |     -0.067      0.057    -1.18   0.240       -0.179       0.045
          2  |     -0.023      0.093    -0.25   0.801       -0.206       0.159
          3  |     -0.011      0.060    -0.18   0.857       -0.129       0.107
-------------+----------------------------------------------------------------
3.treat      |
         _at |
          1  |      0.075      0.054     1.40   0.162       -0.030       0.181
          2  |      0.047      0.100     0.47   0.638       -0.149       0.244
          3  |      0.001      0.062     0.01   0.989       -0.120       0.122
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

. 
. outreg2 [*] ///
>   using docs/ols-margins-without-covariates-3party.xls, ///
>   noaster stats(coef se ci pval) bdec(1) sdec(1) cdec(3)  ///
>   stnum(replace coef=coef*100, replace se=se*100) ///
>   paren(se) bracket(ci) ///
>   excel replace
docs/ols-margins-without-covariates-3party.xls
dir : seeout

. 
. estimates clear

. 
. *** Logit models, with no additional adjustment
. 
. foreach dom in `domain' {
  2. 
. logit `dom' b1.treat b1.partyid3 [pweight=weight]
  3. estimates store `dom'_r4
  4. 
. logit `dom' b1.treat##b1.partyid3 [pweight=weight]
  5. estimates store `dom'_r5
  6. 
. logit `dom' b1.treat b1.partyid3l [pweight=weight]
  7. estimates store `dom'_r6
  8. 
. logit `dom' b1.treat##b1.partyid3l [pweight=weight]
  9. estimates store `dom'_r7
 10. 
. }

Iteration 0:   log pseudolikelihood = -1380.5082  
Iteration 1:   log pseudolikelihood = -1372.1018  
Iteration 2:   log pseudolikelihood = -1372.0999  
Iteration 3:   log pseudolikelihood = -1372.0999  

Logistic regression                             Number of obs     =      2,009
                                                Wald chi2(4)      =       9.11
                                                Prob > chi2       =     0.0584
Log pseudolikelihood = -1372.0999               Pseudo R2         =     0.0061

------------------------------------------------------------------------------
             |               Robust
         spk |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.332      0.153    -2.17   0.030       -0.632      -0.032
        irl  |     -0.128      0.159    -0.80   0.421       -0.440       0.184
             |
    partyid3 |
          2  |      0.119      0.155     0.77   0.440       -0.184       0.422
          3  |     -0.213      0.163    -1.31   0.191       -0.533       0.107
             |
       _cons |     -0.054      0.135    -0.40   0.690       -0.318       0.210
------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -1380.5082  
Iteration 1:   log pseudolikelihood =   -1370.21  
Iteration 2:   log pseudolikelihood = -1370.1974  
Iteration 3:   log pseudolikelihood = -1370.1974  

Logistic regression                             Number of obs     =      2,009
                                                Wald chi2(8)      =      11.47
                                                Prob > chi2       =     0.1763
Log pseudolikelihood = -1370.1974               Pseudo R2         =     0.0075

--------------------------------------------------------------------------------
               |               Robust
           spk |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
         treat |
           ic  |     -0.257      0.266    -0.96   0.335       -0.779       0.265
          irl  |      0.042      0.278     0.15   0.879       -0.503       0.587
               |
      partyid3 |
            2  |      0.245      0.248     0.99   0.323       -0.241       0.732
            3  |     -0.101      0.256    -0.39   0.695       -0.603       0.401
               |
treat#partyid3 |
         ic#2  |     -0.053      0.365    -0.15   0.885       -0.768       0.662
         ic#3  |     -0.259      0.388    -0.67   0.504       -1.020       0.501
        irl#2  |     -0.372      0.382    -0.97   0.330       -1.120       0.376
        irl#3  |     -0.127      0.397    -0.32   0.748       -0.905       0.650
               |
         _cons |     -0.130      0.167    -0.78   0.436       -0.458       0.198
--------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -1380.5082  
Iteration 1:   log pseudolikelihood = -1373.4221  
Iteration 2:   log pseudolikelihood =  -1373.421  
Iteration 3:   log pseudolikelihood =  -1373.421  

Logistic regression                             Number of obs     =      2,009
                                                Wald chi2(4)      =       7.52
                                                Prob > chi2       =     0.1107
Log pseudolikelihood =  -1373.421               Pseudo R2         =     0.0051

------------------------------------------------------------------------------
             |               Robust
         spk |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.307      0.153    -2.01   0.044       -0.607      -0.008
        irl  |     -0.125      0.159    -0.79   0.431       -0.436       0.186
             |
   partyid3l |
          2  |     -0.021      0.183    -0.11   0.910       -0.380       0.339
          3  |     -0.236      0.140    -1.68   0.093       -0.511       0.039
             |
       _cons |      0.016      0.124     0.13   0.895       -0.226       0.258
------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -1380.5082  
Iteration 1:   log pseudolikelihood = -1370.5124  
Iteration 2:   log pseudolikelihood = -1370.4988  
Iteration 3:   log pseudolikelihood = -1370.4988  

Logistic regression                             Number of obs     =      2,009
                                                Wald chi2(8)      =      10.86
                                                Prob > chi2       =     0.2098
Log pseudolikelihood = -1370.4988               Pseudo R2         =     0.0073

---------------------------------------------------------------------------------
                |               Robust
            spk |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
          treat |
            ic  |     -0.160      0.228    -0.70   0.483       -0.608       0.288
           irl  |     -0.006      0.238    -0.02   0.981       -0.473       0.462
                |
      partyid3l |
             2  |      0.049      0.314     0.16   0.876       -0.567       0.665
             3  |     -0.045      0.224    -0.20   0.841       -0.484       0.394
                |
treat#partyid3l |
          ic#2  |      0.028      0.436     0.06   0.949       -0.826       0.881
          ic#3  |     -0.439      0.334    -1.31   0.189       -1.092       0.215
         irl#2  |     -0.305      0.458    -0.67   0.505       -1.204       0.593
         irl#3  |     -0.171      0.344    -0.50   0.619       -0.846       0.503
                |
          _cons |     -0.067      0.147    -0.45   0.650       -0.355       0.222
---------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -1122.4494  
Iteration 1:   log pseudolikelihood = -1105.9046  
Iteration 2:   log pseudolikelihood = -1105.7287  
Iteration 3:   log pseudolikelihood = -1105.7286  

Logistic regression                             Number of obs     =      2,005
                                                Wald chi2(4)      =      16.83
                                                Prob > chi2       =     0.0021
Log pseudolikelihood = -1105.7286               Pseudo R2         =     0.0149

------------------------------------------------------------------------------
             |               Robust
         col |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.317      0.178    -1.79   0.074       -0.666       0.031
        irl  |     -0.261      0.176    -1.48   0.138       -0.606       0.084
             |
    partyid3 |
          2  |      0.061      0.167     0.36   0.717       -0.267       0.388
          3  |     -0.606      0.198    -3.05   0.002       -0.994      -0.217
             |
       _cons |     -0.804      0.155    -5.18   0.000       -1.109      -0.500
------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -1122.4494  
Iteration 1:   log pseudolikelihood = -1103.0831  
Iteration 2:   log pseudolikelihood = -1102.7909  
Iteration 3:   log pseudolikelihood = -1102.7906  
Iteration 4:   log pseudolikelihood = -1102.7906  

Logistic regression                             Number of obs     =      2,005
                                                Wald chi2(8)      =      20.60
                                                Prob > chi2       =     0.0083
Log pseudolikelihood = -1102.7906               Pseudo R2         =     0.0175

--------------------------------------------------------------------------------
               |               Robust
           col |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
         treat |
           ic  |     -0.540      0.316    -1.71   0.088       -1.160       0.080
          irl  |     -0.486      0.286    -1.70   0.089       -1.046       0.075
               |
      partyid3 |
            2  |     -0.088      0.268    -0.33   0.743       -0.613       0.437
            3  |     -0.933      0.333    -2.80   0.005       -1.585      -0.280
               |
treat#partyid3 |
         ic#2  |      0.324      0.413     0.78   0.433       -0.486       1.134
         ic#3  |      0.355      0.494     0.72   0.473       -0.614       1.323
        irl#2  |      0.157      0.396     0.40   0.691       -0.618       0.933
        irl#3  |      0.708      0.470     1.51   0.132       -0.214       1.631
               |
         _cons |     -0.676      0.189    -3.58   0.000       -1.046      -0.305
--------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -1122.4494  
Iteration 1:   log pseudolikelihood =  -1104.913  
Iteration 2:   log pseudolikelihood = -1104.7729  
Iteration 3:   log pseudolikelihood = -1104.7729  

Logistic regression                             Number of obs     =      2,005
                                                Wald chi2(4)      =      17.53
                                                Prob > chi2       =     0.0015
Log pseudolikelihood = -1104.7729               Pseudo R2         =     0.0157

------------------------------------------------------------------------------
             |               Robust
         col |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.288      0.177    -1.62   0.104       -0.635       0.060
        irl  |     -0.260      0.177    -1.47   0.142       -0.607       0.087
             |
   partyid3l |
          2  |      0.106      0.193     0.55   0.584       -0.273       0.485
          3  |     -0.558      0.168    -3.33   0.001       -0.887      -0.230
             |
       _cons |     -0.773      0.141    -5.48   0.000       -1.049      -0.496
------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -1122.4494  
Iteration 1:   log pseudolikelihood = -1100.0291  
Iteration 2:   log pseudolikelihood = -1099.7048  
Iteration 3:   log pseudolikelihood = -1099.7046  
Iteration 4:   log pseudolikelihood = -1099.7046  

Logistic regression                             Number of obs     =      2,005
                                                Wald chi2(8)      =      23.18
                                                Prob > chi2       =     0.0031
Log pseudolikelihood = -1099.7046               Pseudo R2         =     0.0203

---------------------------------------------------------------------------------
                |               Robust
            col |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
          treat |
            ic  |     -0.424      0.258    -1.64   0.101       -0.931       0.083
           irl  |     -0.438      0.245    -1.79   0.074       -0.918       0.042
                |
      partyid3l |
             2  |      0.051      0.321     0.16   0.874       -0.578       0.680
             3  |     -0.837      0.286    -2.92   0.003       -1.398      -0.276
                |
treat#partyid3l |
          ic#2  |      0.284      0.465     0.61   0.541       -0.627       1.195
          ic#3  |      0.206      0.413     0.50   0.618       -0.604       1.016
         irl#2  |     -0.187      0.470    -0.40   0.691       -1.109       0.734
         irl#3  |      0.685      0.403     1.70   0.089       -0.105       1.475
                |
          _cons |     -0.680      0.164    -4.13   0.000       -1.002      -0.357
---------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -1385.7829  
Iteration 1:   log pseudolikelihood = -1369.6218  
Iteration 2:   log pseudolikelihood = -1369.6194  
Iteration 3:   log pseudolikelihood = -1369.6194  

Logistic regression                             Number of obs     =      2,002
                                                Wald chi2(4)      =      16.49
                                                Prob > chi2       =     0.0024
Log pseudolikelihood = -1369.6194               Pseudo R2         =     0.0117

------------------------------------------------------------------------------
             |               Robust
         lib |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.175      0.155    -1.13   0.259       -0.478       0.129
        irl  |      0.174      0.158     1.10   0.272       -0.136       0.484
             |
    partyid3 |
          2  |     -0.186      0.155    -1.20   0.230       -0.489       0.118
          3  |     -0.553      0.161    -3.43   0.001       -0.869      -0.237
             |
       _cons |      0.336      0.136     2.47   0.013        0.070       0.602
------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -1385.7829  
Iteration 1:   log pseudolikelihood = -1364.2463  
Iteration 2:   log pseudolikelihood = -1364.2143  
Iteration 3:   log pseudolikelihood = -1364.2143  

Logistic regression                             Number of obs     =      2,002
                                                Wald chi2(8)      =      21.09
                                                Prob > chi2       =     0.0069
Log pseudolikelihood = -1364.2143               Pseudo R2         =     0.0156

--------------------------------------------------------------------------------
               |               Robust
           lib |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
         treat |
           ic  |     -0.240      0.265    -0.90   0.366       -0.760       0.280
          irl  |      0.549      0.269     2.04   0.041        0.021       1.077
               |
      partyid3 |
            2  |      0.016      0.253     0.06   0.950       -0.480       0.512
            3  |     -0.478      0.258    -1.85   0.064       -0.984       0.027
               |
treat#partyid3 |
         ic#2  |     -0.067      0.367    -0.18   0.856       -0.786       0.653
         ic#3  |      0.322      0.386     0.83   0.404       -0.434       1.079
        irl#2  |     -0.578      0.383    -1.51   0.131       -1.328       0.173
        irl#3  |     -0.550      0.389    -1.42   0.157       -1.312       0.212
               |
         _cons |      0.244      0.169     1.44   0.150       -0.088       0.576
--------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -1385.7829  
Iteration 1:   log pseudolikelihood = -1363.9404  
Iteration 2:   log pseudolikelihood = -1363.9345  
Iteration 3:   log pseudolikelihood = -1363.9345  

Logistic regression                             Number of obs     =      2,002
                                                Wald chi2(4)      =      22.27
                                                Prob > chi2       =     0.0002
Log pseudolikelihood = -1363.9345               Pseudo R2         =     0.0158

------------------------------------------------------------------------------
             |               Robust
         lib |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.148      0.155    -0.95   0.340       -0.451       0.156
        irl  |      0.175      0.157     1.11   0.267       -0.134       0.483
             |
   partyid3l |
          2  |     -0.433      0.184    -2.35   0.019       -0.794      -0.071
          3  |     -0.578      0.140    -4.11   0.000       -0.853      -0.303
             |
       _cons |      0.404      0.125     3.24   0.001        0.160       0.649
------------------------------------------------------------------------------

Iteration 0:   log pseudolikelihood = -1385.7829  
Iteration 1:   log pseudolikelihood = -1361.5715  
Iteration 2:   log pseudolikelihood = -1361.5463  
Iteration 3:   log pseudolikelihood = -1361.5463  

Logistic regression                             Number of obs     =      2,002
                                                Wald chi2(8)      =      24.28
                                                Prob > chi2       =     0.0021
Log pseudolikelihood = -1361.5463               Pseudo R2         =     0.0175

---------------------------------------------------------------------------------
                |               Robust
            lib |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
          treat |
            ic  |     -0.273      0.232    -1.18   0.239       -0.728       0.182
           irl  |      0.327      0.236     1.39   0.166       -0.136       0.789
                |
      partyid3l |
             2  |     -0.452      0.317    -1.42   0.155       -1.074       0.170
             3  |     -0.553      0.226    -2.44   0.015       -0.997      -0.109
                |
treat#partyid3l |
          ic#2  |      0.179      0.438     0.41   0.682       -0.680       1.039
          ic#3  |      0.230      0.335     0.69   0.493       -0.427       0.887
         irl#2  |     -0.138      0.466    -0.30   0.768       -1.050       0.775
         irl#3  |     -0.323      0.342    -0.95   0.344       -0.993       0.346
                |
          _cons |      0.399      0.150     2.66   0.008        0.105       0.693
---------------------------------------------------------------------------------

. 
. estimates dir

-------------------------------------------------------
        name | command      depvar       npar  title 
-------------+-----------------------------------------
      spk_r4 | logit        spk             7  
      spk_r5 | logit        spk            16  
      spk_r6 | logit        spk             7  
      spk_r7 | logit        spk            16  
      col_r4 | logit        col             7  
      col_r5 | logit        col            16  
      col_r6 | logit        col             7  
      col_r7 | logit        col            16  
      lib_r4 | logit        lib             7  
      lib_r5 | logit        lib            16  
      lib_r6 | logit        lib             7  
      lib_r7 | logit        lib            16  
-------------------------------------------------------

. 
. outreg2 [*] ///
>   using docs/logit-estimates-without-covariates-3party.xls, ///
>   noaster stats(coef se ci pval)  dec(3)  ///
>   paren(se) bracket(ci) ///
>   excel replace
docs/logit-estimates-without-covariates-3party.xls
dir : seeout

. 
. estimates clear

. 
. foreach dom in `domain' {
  2. 
. logit `dom' b1.partyid3 [pweight=weight]
  3.   margins, dydx(b1.partyid3) post
  4.   estimates store `dom'_r2
  5.   
. logit `dom' b1.treat##b1.partyid3 [pweight=weight]
  6.   margins b1.treat, post
  7.   estimates store `dom'_r3
  8.     quietly logit `dom' b1.treat##b1.partyid3 [pweight=weight]
  9.     margins, dydx(b1.treat) post
 10.     estimates store `dom'_r3d1
 11.     quietly logit `dom' b2.treat##b1.partyid3 [pweight=weight]
 12.     margins, dydx(b2.treat) post
 13.     estimates store `dom'_r3d2
 14.   quietly logit `dom' b1.treat##b1.partyid3 [pweight=weight]
 15.     margins, dydx(b1.partyid3) post
 16.     estimates store `dom'_r4
 17.   quietly logit `dom' b1.treat##b1.partyid3 [pweight=weight]
 18.     margins, dydx(b1.partyid3) at(treat = (1(1)3)) post
 19.     estimates store `dom'_r5
 20.   quietly logit `dom' b1.treat##b1.partyid3 [pweight=weight] 
 21.     margins, dydx(b1.treat) at(partyid3 = (1(1)3)) post
 22.     estimates store `dom'_r6
 23. 
. logit `dom' b1.partyid3l [pweight=weight]
 24.   margins, dydx(b1.partyid3l) post
 25.   estimates store `dom'_r2l
 26. 
. logit `dom' b1.treat##b1.partyid3l [pweight=weight]
 27.   margins b1.treat, post
 28.   estimates store `dom'_r3l
 29.     quietly logit `dom' b1.treat##b1.partyid3l [pweight=weight]
 30.     margins, dydx(b1.treat) post
 31.     estimates store `dom'_r3ld1
 32.     quietly logit `dom' b2.treat##b1.partyid3l [pweight=weight]
 33.     margins, dydx(b2.treat) post
 34.     estimates store `dom'_r3ld2
 35.   quietly logit `dom' b1.treat##b1.partyid3l [pweight=weight]
 36.     margins, dydx(b1.partyid3l) post
 37.     estimates store `dom'_r4l
 38.   quietly logit `dom' b1.treat##b1.partyid3l [pweight=weight]
 39.     margins, dydx(b1.partyid3l) at(treat = (1(1)3)) post
 40.     estimates store `dom'_r5l
 41.   quietly logit `dom' b1.treat##b1.partyid3l [pweight=weight] 
 42.     margins, dydx(b1.treat) at(partyid3l = (1(1)3)) post
 43.     estimates store `dom'_r6l
 44. 
. }

Iteration 0:   log pseudolikelihood = -1380.5082  
Iteration 1:   log pseudolikelihood = -1376.7923  
Iteration 2:   log pseudolikelihood = -1376.7918  
Iteration 3:   log pseudolikelihood = -1376.7918  

Logistic regression                             Number of obs     =      2,009
                                                Wald chi2(2)      =       3.86
                                                Prob > chi2       =     0.1452
Log pseudolikelihood = -1376.7918               Pseudo R2         =     0.0027

------------------------------------------------------------------------------
             |               Robust
         spk |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    partyid3 |
          2  |      0.092      0.154     0.60   0.548       -0.209       0.393
          3  |     -0.212      0.163    -1.30   0.194       -0.531       0.108
             |
       _cons |     -0.192      0.113    -1.70   0.089       -0.414       0.029
------------------------------------------------------------------------------

Conditional marginal effects                    Number of obs     =      2,009
Model VCE    : Robust

Expression   : Pr(spk), predict()
dy/dx w.r.t. : 2.partyid3 3.partyid3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    partyid3 |
          2  |      0.023      0.038     0.60   0.547       -0.052       0.098
          3  |     -0.052      0.040    -1.30   0.193       -0.130       0.026
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Iteration 0:   log pseudolikelihood = -1380.5082  
Iteration 1:   log pseudolikelihood =   -1370.21  
Iteration 2:   log pseudolikelihood = -1370.1974  
Iteration 3:   log pseudolikelihood = -1370.1974  

Logistic regression                             Number of obs     =      2,009
                                                Wald chi2(8)      =      11.47
                                                Prob > chi2       =     0.1763
Log pseudolikelihood = -1370.1974               Pseudo R2         =     0.0075

--------------------------------------------------------------------------------
               |               Robust
           spk |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
         treat |
           ic  |     -0.257      0.266    -0.96   0.335       -0.779       0.265
          irl  |      0.042      0.278     0.15   0.879       -0.503       0.587
               |
      partyid3 |
            2  |      0.245      0.248     0.99   0.323       -0.241       0.732
            3  |     -0.101      0.256    -0.39   0.695       -0.603       0.401
               |
treat#partyid3 |
         ic#2  |     -0.053      0.365    -0.15   0.885       -0.768       0.662
         ic#3  |     -0.259      0.388    -0.67   0.504       -1.020       0.501
        irl#2  |     -0.372      0.382    -0.97   0.330       -1.120       0.376
        irl#3  |     -0.127      0.397    -0.32   0.748       -0.905       0.650
               |
         _cons |     -0.130      0.167    -0.78   0.436       -0.458       0.198
--------------------------------------------------------------------------------

Predictive margins                              Number of obs     =      2,009
Model VCE    : Robust

Expression   : Pr(spk), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.484      0.026    18.53   0.000        0.433       0.536
         ic  |      0.400      0.026    15.11   0.000        0.348       0.452
        irl  |      0.450      0.029    15.36   0.000        0.393       0.508
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,009
Model VCE    : Robust

Expression   : Pr(spk), predict()
dy/dx w.r.t. : 2.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.085      0.037    -2.27   0.023       -0.157      -0.012
        irl  |     -0.034      0.039    -0.87   0.387       -0.111       0.043
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,009
Model VCE    : Robust

Expression   : Pr(spk), predict()
dy/dx w.r.t. : 1.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.085      0.037     2.27   0.023        0.012       0.157
        irl  |      0.051      0.040     1.28   0.201       -0.027       0.128
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,009
Model VCE    : Robust

Expression   : Pr(spk), predict()
dy/dx w.r.t. : 2.partyid3 3.partyid3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    partyid3 |
          2  |      0.028      0.038     0.73   0.464       -0.047       0.103
          3  |     -0.054      0.039    -1.37   0.171       -0.131       0.023
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Conditional marginal effects                    Number of obs     =      2,009
Model VCE    : Robust

Expression   : Pr(spk), predict()
dy/dx w.r.t. : 2.partyid3 3.partyid3

1._at        : treat           =           1

2._at        : treat           =           2

3._at        : treat           =           3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1.partyid3   |  (base outcome)
-------------+----------------------------------------------------------------
2.partyid3   |
         _at |
          1  |      0.061      0.062     0.99   0.321       -0.060       0.182
          2  |      0.047      0.065     0.72   0.471       -0.081       0.175
          3  |     -0.031      0.072    -0.44   0.662       -0.173       0.110
-------------+----------------------------------------------------------------
3.partyid3   |
         _at |
          1  |     -0.025      0.063    -0.39   0.694       -0.149       0.099
          2  |     -0.083      0.067    -1.24   0.216       -0.214       0.048
          3  |     -0.056      0.075    -0.75   0.451       -0.203       0.090
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Conditional marginal effects                    Number of obs     =      2,009
Model VCE    : Robust

Expression   : Pr(spk), predict()
dy/dx w.r.t. : 2.treat 3.treat

1._at        : partyid3        =           1

2._at        : partyid3        =           2

3._at        : partyid3        =           3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1.treat      |  (base outcome)
-------------+----------------------------------------------------------------
2.treat      |
         _at |
          1  |     -0.063      0.065    -0.97   0.332       -0.190       0.064
          2  |     -0.077      0.062    -1.25   0.213       -0.199       0.044
          3  |     -0.121      0.065    -1.85   0.065       -0.249       0.007
-------------+----------------------------------------------------------------
3.treat      |
         _at |
          1  |      0.011      0.069     0.15   0.879       -0.125       0.146
          2  |     -0.082      0.065    -1.27   0.205       -0.209       0.045
          3  |     -0.021      0.069    -0.30   0.763       -0.157       0.115
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Iteration 0:   log pseudolikelihood = -1380.5082  
Iteration 1:   log pseudolikelihood = -1377.4441  
Iteration 2:   log pseudolikelihood = -1377.4439  
Iteration 3:   log pseudolikelihood = -1377.4439  

Logistic regression                             Number of obs     =      2,009
                                                Wald chi2(2)      =       3.16
                                                Prob > chi2       =     0.2060
Log pseudolikelihood = -1377.4439               Pseudo R2         =     0.0022

------------------------------------------------------------------------------
             |               Robust
         spk |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   partyid3l |
          2  |     -0.038      0.182    -0.21   0.834       -0.395       0.319
          3  |     -0.241      0.140    -1.72   0.086       -0.516       0.034
             |
       _cons |     -0.118      0.097    -1.21   0.226       -0.308       0.073
------------------------------------------------------------------------------

Conditional marginal effects                    Number of obs     =      2,009
Model VCE    : Robust

Expression   : Pr(spk), predict()
dy/dx w.r.t. : 2.partyid3l 3.partyid3l

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   partyid3l |
          2  |     -0.009      0.045    -0.21   0.834       -0.098       0.079
          3  |     -0.059      0.034    -1.72   0.085       -0.127       0.008
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Iteration 0:   log pseudolikelihood = -1380.5082  
Iteration 1:   log pseudolikelihood = -1370.5124  
Iteration 2:   log pseudolikelihood = -1370.4988  
Iteration 3:   log pseudolikelihood = -1370.4988  

Logistic regression                             Number of obs     =      2,009
                                                Wald chi2(8)      =      10.86
                                                Prob > chi2       =     0.2098
Log pseudolikelihood = -1370.4988               Pseudo R2         =     0.0073

---------------------------------------------------------------------------------
                |               Robust
            spk |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
          treat |
            ic  |     -0.160      0.228    -0.70   0.483       -0.608       0.288
           irl  |     -0.006      0.238    -0.02   0.981       -0.473       0.462
                |
      partyid3l |
             2  |      0.049      0.314     0.16   0.876       -0.567       0.665
             3  |     -0.045      0.224    -0.20   0.841       -0.484       0.394
                |
treat#partyid3l |
          ic#2  |      0.028      0.436     0.06   0.949       -0.826       0.881
          ic#3  |     -0.439      0.334    -1.31   0.189       -1.092       0.215
         irl#2  |     -0.305      0.458    -0.67   0.505       -1.204       0.593
         irl#3  |     -0.171      0.344    -0.50   0.619       -0.846       0.503
                |
          _cons |     -0.067      0.147    -0.45   0.650       -0.355       0.222
---------------------------------------------------------------------------------

Predictive margins                              Number of obs     =      2,009
Model VCE    : Robust

Expression   : Pr(spk), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.482      0.026    18.40   0.000        0.430       0.533
         ic  |      0.405      0.026    15.34   0.000        0.353       0.457
        irl  |      0.449      0.029    15.35   0.000        0.392       0.507
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,009
Model VCE    : Robust

Expression   : Pr(spk), predict()
dy/dx w.r.t. : 2.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.076      0.037    -2.06   0.040       -0.149      -0.004
        irl  |     -0.032      0.039    -0.82   0.412       -0.109       0.045
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,009
Model VCE    : Robust

Expression   : Pr(spk), predict()
dy/dx w.r.t. : 1.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.076      0.037     2.06   0.040        0.004       0.149
        irl  |      0.044      0.039     1.12   0.262       -0.033       0.122
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,009
Model VCE    : Robust

Expression   : Pr(spk), predict()
dy/dx w.r.t. : 2.partyid3l 3.partyid3l

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   partyid3l |
          2  |     -0.009      0.045    -0.19   0.846       -0.098       0.080
          3  |     -0.058      0.034    -1.70   0.088       -0.125       0.009
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Conditional marginal effects                    Number of obs     =      2,009
Model VCE    : Robust

Expression   : Pr(spk), predict()
dy/dx w.r.t. : 2.partyid3l 3.partyid3l

1._at        : treat           =           1

2._at        : treat           =           2

3._at        : treat           =           3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1.partyid3l  |  (base outcome)
-------------+----------------------------------------------------------------
2.partyid3l  |
         _at |
          1  |      0.012      0.079     0.16   0.876       -0.142       0.166
          2  |      0.019      0.075     0.25   0.799       -0.128       0.166
          3  |     -0.063      0.082    -0.77   0.439       -0.224       0.097
-------------+----------------------------------------------------------------
3.partyid3l  |
         _at |
          1  |     -0.011      0.056    -0.20   0.841       -0.121       0.098
          2  |     -0.114      0.058    -1.97   0.049       -0.227      -0.000
          3  |     -0.054      0.065    -0.83   0.407       -0.180       0.073
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Conditional marginal effects                    Number of obs     =      2,009
Model VCE    : Robust

Expression   : Pr(spk), predict()
dy/dx w.r.t. : 2.treat 3.treat

1._at        : partyid3l       =           1

2._at        : partyid3l       =           2

3._at        : partyid3l       =           3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1.treat      |  (base outcome)
-------------+----------------------------------------------------------------
2.treat      |
         _at |
          1  |     -0.040      0.057    -0.70   0.482       -0.151       0.071
          2  |     -0.033      0.092    -0.36   0.721       -0.214       0.148
          3  |     -0.143      0.057    -2.50   0.013       -0.255      -0.031
-------------+----------------------------------------------------------------
3.treat      |
         _at |
          1  |     -0.001      0.060    -0.02   0.981       -0.118       0.115
          2  |     -0.077      0.097    -0.80   0.425       -0.266       0.112
          3  |     -0.044      0.061    -0.71   0.475       -0.164       0.076
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Iteration 0:   log pseudolikelihood = -1122.4494  
Iteration 1:   log pseudolikelihood = -1109.5481  
Iteration 2:   log pseudolikelihood = -1109.4486  
Iteration 3:   log pseudolikelihood = -1109.4486  

Logistic regression                             Number of obs     =      2,005
                                                Wald chi2(2)      =      12.80
                                                Prob > chi2       =     0.0017
Log pseudolikelihood = -1109.4486               Pseudo R2         =     0.0116

------------------------------------------------------------------------------
             |               Robust
         col |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    partyid3 |
          2  |      0.039      0.167     0.24   0.814       -0.288       0.367
          3  |     -0.604      0.199    -3.04   0.002       -0.993      -0.214
             |
       _cons |     -0.977      0.125    -7.80   0.000       -1.223      -0.732
------------------------------------------------------------------------------

Conditional marginal effects                    Number of obs     =      2,005
Model VCE    : Robust

Expression   : Pr(col), predict()
dy/dx w.r.t. : 2.partyid3 3.partyid3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    partyid3 |
          2  |      0.008      0.033     0.24   0.814       -0.058       0.074
          3  |     -0.103      0.033    -3.10   0.002       -0.168      -0.038
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Iteration 0:   log pseudolikelihood = -1122.4494  
Iteration 1:   log pseudolikelihood = -1103.0831  
Iteration 2:   log pseudolikelihood = -1102.7909  
Iteration 3:   log pseudolikelihood = -1102.7906  
Iteration 4:   log pseudolikelihood = -1102.7906  

Logistic regression                             Number of obs     =      2,005
                                                Wald chi2(8)      =      20.60
                                                Prob > chi2       =     0.0083
Log pseudolikelihood = -1102.7906               Pseudo R2         =     0.0175

--------------------------------------------------------------------------------
               |               Robust
           col |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
         treat |
           ic  |     -0.540      0.316    -1.71   0.088       -1.160       0.080
          irl  |     -0.486      0.286    -1.70   0.089       -1.046       0.075
               |
      partyid3 |
            2  |     -0.088      0.268    -0.33   0.743       -0.613       0.437
            3  |     -0.933      0.333    -2.80   0.005       -1.585      -0.280
               |
treat#partyid3 |
         ic#2  |      0.324      0.413     0.78   0.433       -0.486       1.134
         ic#3  |      0.355      0.494     0.72   0.473       -0.614       1.323
        irl#2  |      0.157      0.396     0.40   0.691       -0.618       0.933
        irl#3  |      0.708      0.470     1.51   0.132       -0.214       1.631
               |
         _cons |     -0.676      0.189    -3.58   0.000       -1.046      -0.305
--------------------------------------------------------------------------------

Predictive margins                              Number of obs     =      2,005
Model VCE    : Robust

Expression   : Pr(col), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.283      0.024    11.88   0.000        0.236       0.329
         ic  |      0.222      0.023     9.82   0.000        0.178       0.266
        irl  |      0.233      0.022    10.37   0.000        0.189       0.277
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,005
Model VCE    : Robust

Expression   : Pr(col), predict()
dy/dx w.r.t. : 2.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.061      0.033    -1.85   0.065       -0.125       0.004
        irl  |     -0.050      0.033    -1.52   0.127       -0.114       0.014
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,005
Model VCE    : Robust

Expression   : Pr(col), predict()
dy/dx w.r.t. : 1.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.061      0.033     1.85   0.065       -0.004       0.125
        irl  |      0.011      0.032     0.34   0.735       -0.052       0.073
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,005
Model VCE    : Robust

Expression   : Pr(col), predict()
dy/dx w.r.t. : 2.partyid3 3.partyid3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    partyid3 |
          2  |      0.012      0.033     0.35   0.723       -0.053       0.077
          3  |     -0.102      0.032    -3.13   0.002       -0.165      -0.038
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Conditional marginal effects                    Number of obs     =      2,005
Model VCE    : Robust

Expression   : Pr(col), predict()
dy/dx w.r.t. : 2.partyid3 3.partyid3

1._at        : treat           =           1

2._at        : treat           =           2

3._at        : treat           =           3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1.partyid3   |  (base outcome)
-------------+----------------------------------------------------------------
2.partyid3   |
         _at |
          1  |     -0.019      0.059    -0.33   0.743       -0.135       0.096
          2  |      0.044      0.058     0.76   0.446       -0.070       0.158
          3  |      0.013      0.054     0.24   0.811       -0.093       0.118
-------------+----------------------------------------------------------------
3.partyid3   |
         _at |
          1  |     -0.170      0.057    -3.00   0.003       -0.282      -0.059
          2  |     -0.086      0.055    -1.56   0.118       -0.194       0.022
          3  |     -0.038      0.056    -0.68   0.496       -0.149       0.072
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Conditional marginal effects                    Number of obs     =      2,005
Model VCE    : Robust

Expression   : Pr(col), predict()
dy/dx w.r.t. : 2.treat 3.treat

1._at        : partyid3        =           1

2._at        : partyid3        =           2

3._at        : partyid3        =           3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1.treat      |  (base outcome)
-------------+----------------------------------------------------------------
2.treat      |
         _at |
          1  |     -0.109      0.062    -1.76   0.078       -0.229       0.012
          2  |     -0.045      0.055    -0.81   0.417       -0.153       0.064
          3  |     -0.024      0.050    -0.49   0.627       -0.122       0.073
-------------+----------------------------------------------------------------
3.treat      |
         _at |
          1  |     -0.099      0.057    -1.72   0.086       -0.211       0.014
          2  |     -0.067      0.055    -1.20   0.230       -0.175       0.042
          3  |      0.033      0.056     0.60   0.550       -0.076       0.143
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Iteration 0:   log pseudolikelihood = -1122.4494  
Iteration 1:   log pseudolikelihood = -1108.1532  
Iteration 2:   log pseudolikelihood = -1108.0503  
Iteration 3:   log pseudolikelihood = -1108.0503  

Logistic regression                             Number of obs     =      2,005
                                                Wald chi2(2)      =      14.16
                                                Prob > chi2       =     0.0008
Log pseudolikelihood = -1108.0503               Pseudo R2         =     0.0128

------------------------------------------------------------------------------
             |               Robust
         col |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   partyid3l |
          2  |      0.094      0.193     0.48   0.628       -0.285       0.472
          3  |     -0.561      0.168    -3.34   0.001       -0.889      -0.232
             |
       _cons |     -0.941      0.105    -8.94   0.000       -1.147      -0.735
------------------------------------------------------------------------------

Conditional marginal effects                    Number of obs     =      2,005
Model VCE    : Robust

Expression   : Pr(col), predict()
dy/dx w.r.t. : 2.partyid3l 3.partyid3l

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   partyid3l |
          2  |      0.019      0.040     0.48   0.630       -0.059       0.098
          3  |     -0.099      0.029    -3.42   0.001       -0.155      -0.042
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Iteration 0:   log pseudolikelihood = -1122.4494  
Iteration 1:   log pseudolikelihood = -1100.0291  
Iteration 2:   log pseudolikelihood = -1099.7048  
Iteration 3:   log pseudolikelihood = -1099.7046  
Iteration 4:   log pseudolikelihood = -1099.7046  

Logistic regression                             Number of obs     =      2,005
                                                Wald chi2(8)      =      23.18
                                                Prob > chi2       =     0.0031
Log pseudolikelihood = -1099.7046               Pseudo R2         =     0.0203

---------------------------------------------------------------------------------
                |               Robust
            col |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
          treat |
            ic  |     -0.424      0.258    -1.64   0.101       -0.931       0.083
           irl  |     -0.438      0.245    -1.79   0.074       -0.918       0.042
                |
      partyid3l |
             2  |      0.051      0.321     0.16   0.874       -0.578       0.680
             3  |     -0.837      0.286    -2.92   0.003       -1.398      -0.276
                |
treat#partyid3l |
          ic#2  |      0.284      0.465     0.61   0.541       -0.627       1.195
          ic#3  |      0.206      0.413     0.50   0.618       -0.604       1.016
         irl#2  |     -0.187      0.470    -0.40   0.691       -1.109       0.734
         irl#3  |      0.685      0.403     1.70   0.089       -0.105       1.475
                |
          _cons |     -0.680      0.164    -4.13   0.000       -1.002      -0.357
---------------------------------------------------------------------------------

Predictive margins                              Number of obs     =      2,005
Model VCE    : Robust

Expression   : Pr(col), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.281      0.024    11.77   0.000        0.234       0.328
         ic  |      0.226      0.022    10.07   0.000        0.182       0.270
        irl  |      0.232      0.022    10.32   0.000        0.188       0.276
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,005
Model VCE    : Robust

Expression   : Pr(col), predict()
dy/dx w.r.t. : 2.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.055      0.033    -1.67   0.095       -0.119       0.009
        irl  |     -0.049      0.033    -1.50   0.133       -0.113       0.015
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,005
Model VCE    : Robust

Expression   : Pr(col), predict()
dy/dx w.r.t. : 1.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.055      0.033     1.67   0.095       -0.009       0.119
        irl  |      0.006      0.032     0.17   0.861       -0.057       0.068
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,005
Model VCE    : Robust

Expression   : Pr(col), predict()
dy/dx w.r.t. : 2.partyid3l 3.partyid3l

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   partyid3l |
          2  |      0.019      0.040     0.48   0.629       -0.058       0.097
          3  |     -0.097      0.028    -3.42   0.001       -0.153      -0.042
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Conditional marginal effects                    Number of obs     =      2,005
Model VCE    : Robust

Expression   : Pr(col), predict()
dy/dx w.r.t. : 2.partyid3l 3.partyid3l

1._at        : treat           =           1

2._at        : treat           =           2

3._at        : treat           =           3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1.partyid3l  |  (base outcome)
-------------+----------------------------------------------------------------
2.partyid3l  |
         _at |
          1  |      0.011      0.073     0.16   0.875       -0.131       0.154
          2  |      0.068      0.069     0.98   0.329       -0.068       0.204
          3  |     -0.024      0.061    -0.40   0.687       -0.143       0.094
-------------+----------------------------------------------------------------
3.partyid3l  |
         _at |
          1  |     -0.156      0.050    -3.10   0.002       -0.255      -0.058
          2  |     -0.099      0.047    -2.11   0.034       -0.191      -0.007
          3  |     -0.027      0.050    -0.54   0.591       -0.126       0.072
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Conditional marginal effects                    Number of obs     =      2,005
Model VCE    : Robust

Expression   : Pr(col), predict()
dy/dx w.r.t. : 2.treat 3.treat

1._at        : partyid3l       =           1

2._at        : partyid3l       =           2

3._at        : partyid3l       =           3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1.treat      |  (base outcome)
-------------+----------------------------------------------------------------
2.treat      |
         _at |
          1  |     -0.087      0.052    -1.67   0.095       -0.190       0.015
          2  |     -0.031      0.086    -0.36   0.717       -0.199       0.137
          3  |     -0.030      0.045    -0.67   0.503       -0.117       0.058
-------------+----------------------------------------------------------------
3.treat      |
         _at |
          1  |     -0.090      0.050    -1.80   0.071       -0.188       0.008
          2  |     -0.126      0.080    -1.57   0.117       -0.283       0.032
          3  |      0.039      0.051     0.77   0.439       -0.060       0.139
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Iteration 0:   log pseudolikelihood = -1385.7829  
Iteration 1:   log pseudolikelihood = -1374.3685  
Iteration 2:   log pseudolikelihood = -1374.3681  
Iteration 3:   log pseudolikelihood = -1374.3681  

Logistic regression                             Number of obs     =      2,002
                                                Wald chi2(2)      =      11.70
                                                Prob > chi2       =     0.0029
Log pseudolikelihood = -1374.3681               Pseudo R2         =     0.0082

------------------------------------------------------------------------------
             |               Robust
         lib |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    partyid3 |
          2  |     -0.206      0.155    -1.33   0.183       -0.510       0.098
          3  |     -0.549      0.162    -3.39   0.001       -0.866      -0.231
             |
       _cons |      0.338      0.114     2.98   0.003        0.115       0.561
------------------------------------------------------------------------------

Conditional marginal effects                    Number of obs     =      2,002
Model VCE    : Robust

Expression   : Pr(lib), predict()
dy/dx w.r.t. : 2.partyid3 3.partyid3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    partyid3 |
          2  |     -0.051      0.038    -1.33   0.182       -0.126       0.024
          3  |     -0.136      0.040    -3.43   0.001       -0.214      -0.058
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Iteration 0:   log pseudolikelihood = -1385.7829  
Iteration 1:   log pseudolikelihood = -1364.2463  
Iteration 2:   log pseudolikelihood = -1364.2143  
Iteration 3:   log pseudolikelihood = -1364.2143  

Logistic regression                             Number of obs     =      2,002
                                                Wald chi2(8)      =      21.09
                                                Prob > chi2       =     0.0069
Log pseudolikelihood = -1364.2143               Pseudo R2         =     0.0156

--------------------------------------------------------------------------------
               |               Robust
           lib |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
         treat |
           ic  |     -0.240      0.265    -0.90   0.366       -0.760       0.280
          irl  |      0.549      0.269     2.04   0.041        0.021       1.077
               |
      partyid3 |
            2  |      0.016      0.253     0.06   0.950       -0.480       0.512
            3  |     -0.478      0.258    -1.85   0.064       -0.984       0.027
               |
treat#partyid3 |
         ic#2  |     -0.067      0.367    -0.18   0.856       -0.786       0.653
         ic#3  |      0.322      0.386     0.83   0.404       -0.434       1.079
        irl#2  |     -0.578      0.383    -1.51   0.131       -1.328       0.173
        irl#3  |     -0.550      0.389    -1.42   0.157       -1.312       0.212
               |
         _cons |      0.244      0.169     1.44   0.150       -0.088       0.576
--------------------------------------------------------------------------------

Predictive margins                              Number of obs     =      2,002
Model VCE    : Robust

Expression   : Pr(lib), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.529      0.026    20.11   0.000        0.478       0.581
         ic  |      0.485      0.028    17.63   0.000        0.431       0.539
        irl  |      0.570      0.028    20.52   0.000        0.515       0.624
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,002
Model VCE    : Robust

Expression   : Pr(lib), predict()
dy/dx w.r.t. : 2.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.044      0.038    -1.16   0.247       -0.119       0.031
        irl  |      0.040      0.038     1.05   0.293       -0.035       0.115
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,002
Model VCE    : Robust

Expression   : Pr(lib), predict()
dy/dx w.r.t. : 1.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.044      0.038     1.16   0.247       -0.031       0.119
        irl  |      0.084      0.039     2.16   0.031        0.008       0.161
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,002
Model VCE    : Robust

Expression   : Pr(lib), predict()
dy/dx w.r.t. : 2.partyid3 3.partyid3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    partyid3 |
          2  |     -0.043      0.037    -1.16   0.248       -0.117       0.030
          3  |     -0.132      0.039    -3.39   0.001       -0.208      -0.056
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Conditional marginal effects                    Number of obs     =      2,002
Model VCE    : Robust

Expression   : Pr(lib), predict()
dy/dx w.r.t. : 2.partyid3 3.partyid3

1._at        : treat           =           1

2._at        : treat           =           2

3._at        : treat           =           3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1.partyid3   |  (base outcome)
-------------+----------------------------------------------------------------
2.partyid3   |
         _at |
          1  |      0.004      0.062     0.06   0.950       -0.118       0.126
          2  |     -0.013      0.066    -0.19   0.848       -0.143       0.117
          3  |     -0.131      0.066    -1.98   0.048       -0.260      -0.001
-------------+----------------------------------------------------------------
3.partyid3   |
         _at |
          1  |     -0.119      0.064    -1.87   0.061       -0.244       0.006
          2  |     -0.039      0.072    -0.54   0.587       -0.179       0.102
          3  |     -0.247      0.067    -3.68   0.000       -0.379      -0.116
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Conditional marginal effects                    Number of obs     =      2,002
Model VCE    : Robust

Expression   : Pr(lib), predict()
dy/dx w.r.t. : 2.treat 3.treat

1._at        : partyid3        =           1

2._at        : partyid3        =           2

3._at        : partyid3        =           3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1.treat      |  (base outcome)
-------------+----------------------------------------------------------------
2.treat      |
         _at |
          1  |     -0.060      0.066    -0.91   0.365       -0.189       0.070
          2  |     -0.076      0.063    -1.22   0.224       -0.199       0.047
          3  |      0.020      0.069     0.29   0.769       -0.116       0.156
-------------+----------------------------------------------------------------
3.treat      |
         _at |
          1  |      0.128      0.061     2.09   0.037        0.008       0.248
          2  |     -0.007      0.067    -0.11   0.916       -0.138       0.124
          3  |     -0.000      0.069    -0.01   0.996       -0.136       0.135
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Iteration 0:   log pseudolikelihood = -1385.7829  
Iteration 1:   log pseudolikelihood = -1367.9923  
Iteration 2:   log pseudolikelihood = -1367.9899  
Iteration 3:   log pseudolikelihood = -1367.9899  

Logistic regression                             Number of obs     =      2,002
                                                Wald chi2(2)      =      17.92
                                                Prob > chi2       =     0.0001
Log pseudolikelihood = -1367.9899               Pseudo R2         =     0.0128

------------------------------------------------------------------------------
             |               Robust
         lib |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   partyid3l |
          2  |     -0.447      0.183    -2.44   0.015       -0.806      -0.088
          3  |     -0.581      0.141    -4.12   0.000       -0.856      -0.305
             |
       _cons |      0.413      0.099     4.18   0.000        0.220       0.606
------------------------------------------------------------------------------

Conditional marginal effects                    Number of obs     =      2,002
Model VCE    : Robust

Expression   : Pr(lib), predict()
dy/dx w.r.t. : 2.partyid3l 3.partyid3l

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   partyid3l |
          2  |     -0.110      0.045    -2.44   0.015       -0.199      -0.022
          3  |     -0.144      0.034    -4.18   0.000       -0.211      -0.076
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Iteration 0:   log pseudolikelihood = -1385.7829  
Iteration 1:   log pseudolikelihood = -1361.5715  
Iteration 2:   log pseudolikelihood = -1361.5463  
Iteration 3:   log pseudolikelihood = -1361.5463  

Logistic regression                             Number of obs     =      2,002
                                                Wald chi2(8)      =      24.28
                                                Prob > chi2       =     0.0021
Log pseudolikelihood = -1361.5463               Pseudo R2         =     0.0175

---------------------------------------------------------------------------------
                |               Robust
            lib |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
          treat |
            ic  |     -0.273      0.232    -1.18   0.239       -0.728       0.182
           irl  |      0.327      0.236     1.39   0.166       -0.136       0.789
                |
      partyid3l |
             2  |     -0.452      0.317    -1.42   0.155       -1.074       0.170
             3  |     -0.553      0.226    -2.44   0.015       -0.997      -0.109
                |
treat#partyid3l |
          ic#2  |      0.179      0.438     0.41   0.682       -0.680       1.039
          ic#3  |      0.230      0.335     0.69   0.493       -0.427       0.887
         irl#2  |     -0.138      0.466    -0.30   0.768       -1.050       0.775
         irl#3  |     -0.323      0.342    -0.95   0.344       -0.993       0.346
                |
          _cons |      0.399      0.150     2.66   0.008        0.105       0.693
---------------------------------------------------------------------------------

Predictive margins                              Number of obs     =      2,002
Model VCE    : Robust

Expression   : Pr(lib), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.525      0.026    20.16   0.000        0.474       0.576
         ic  |      0.488      0.028    17.72   0.000        0.434       0.542
        irl  |      0.568      0.028    20.39   0.000        0.513       0.622
------------------------------------------------------------------------------

Average marginal effects                        Number of obs     =      2,002
Model VCE    : Robust

Expression   : Pr(lib), predict()
dy/dx w.r.t. : 2.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         ic  |     -0.037      0.038    -0.99   0.323       -0.112       0.037
        irl  |      0.042      0.038     1.11   0.269       -0.033       0.117
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,002
Model VCE    : Robust

Expression   : Pr(lib), predict()
dy/dx w.r.t. : 1.treat 3.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
         mc  |      0.037      0.038     0.99   0.323       -0.037       0.112
        irl  |      0.080      0.039     2.03   0.042        0.003       0.156
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Average marginal effects                        Number of obs     =      2,002
Model VCE    : Robust

Expression   : Pr(lib), predict()
dy/dx w.r.t. : 2.partyid3l 3.partyid3l

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   partyid3l |
          2  |     -0.106      0.045    -2.33   0.020       -0.195      -0.017
          3  |     -0.141      0.034    -4.16   0.000       -0.208      -0.075
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Conditional marginal effects                    Number of obs     =      2,002
Model VCE    : Robust

Expression   : Pr(lib), predict()
dy/dx w.r.t. : 2.partyid3l 3.partyid3l

1._at        : treat           =           1

2._at        : treat           =           2

3._at        : treat           =           3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1.partyid3l  |  (base outcome)
-------------+----------------------------------------------------------------
2.partyid3l  |
         _at |
          1  |     -0.112      0.079    -1.42   0.156       -0.266       0.042
          2  |     -0.068      0.075    -0.90   0.367       -0.215       0.080
          3  |     -0.140      0.082    -1.70   0.088       -0.301       0.021
-------------+----------------------------------------------------------------
3.partyid3l  |
         _at |
          1  |     -0.137      0.055    -2.47   0.014       -0.246      -0.028
          2  |     -0.081      0.061    -1.31   0.189       -0.201       0.040
          3  |     -0.211      0.060    -3.52   0.000       -0.329      -0.094
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Conditional marginal effects                    Number of obs     =      2,002
Model VCE    : Robust

Expression   : Pr(lib), predict()
dy/dx w.r.t. : 2.treat 3.treat

1._at        : partyid3l       =           1

2._at        : partyid3l       =           2

3._at        : partyid3l       =           3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1.treat      |  (base outcome)
-------------+----------------------------------------------------------------
2.treat      |
         _at |
          1  |     -0.067      0.057    -1.18   0.239       -0.179       0.045
          2  |     -0.023      0.093    -0.25   0.801       -0.205       0.158
          3  |     -0.011      0.060    -0.18   0.857       -0.128       0.107
-------------+----------------------------------------------------------------
3.treat      |
         _at |
          1  |      0.075      0.054     1.40   0.161       -0.030       0.181
          2  |      0.047      0.100     0.47   0.637       -0.149       0.243
          3  |      0.001      0.061     0.01   0.989       -0.120       0.121
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

. 
. outreg2 [*] ///
>   using docs/logit-margins-without-covariates-3party.xls, ///
>   noaster stats(coef se ci pval) bdec(1) sdec(1) cdec(3)  ///
>   stnum(replace coef=coef*100, replace se=se*100) ///
>   paren(se) bracket(ci) ///
>   excel replace
docs/logit-margins-without-covariates-3party.xls
dir : seeout

. 
. log close
      name:  <unnamed>
       log:  /Users/stephenmorgan/GitHub/tess-civil-liberties/log/analyze-experimental-results-without-covariates-3
> party.log
  log type:  text
 closed on:  16 Mar 2019, 16:25:02
-------------------------------------------------------------------------------------------------------------------
